Repository: felipeduarte26/waapi-flutter-module
Catalog: lib/app/core/localization/l10n/lang_*.arb
Languages: es, pt

# socialNameRight
source: The social name is a right guaranteed by Brazilian legislation that **allows transgender people, transvestites, and non-binary people to be called by the name with which they identify**, instead of the name registered on their civil identity document.
es: El nombre social es un derecho garantizado por la legislación brasileña que **permite a las personas transgénero, travestís y no binarias ser llamadas por el nombre con el que se identifican**, en lugar del nombre registrado en su documento de identidad civil.
pt: O nome social é um direito garantido pela legislação brasileira que **permite que pessoas transgênero, travestis e pessoas não binárias sejam chamadas pelo nome com o qual se identificam**, em vez do nome registrado em seu documento de identidade civil.

# socialNameDocuments
source: In Brazil, the social name can be included in official documents such as RG (General Registry), CPF (Natural Person Register), and work permits in many cases. However, in other cases where there is no specific legislation for name change in civil records, the civil registration name remains on official documents.
es: En Brasil, el nombre social puede ser incluido en documentos oficiales como RG (Registro General), CPF (Registro Nacional de Persona) y documento de trabajo en muchos casos. En otros casos donde no hay legislación específica para el cambio de nombre en los registros civiles, el nombre del registro civil permanece en los documentos oficiales.
pt: No Brasil, o nome social pode ser incluído em documentos oficiais como RG, CPF e carteira de trabalho em muitos casos. Mas em outros casos onde não há legislação específica para alteração do nome nos registros civis, o nome de registro civil permanece nos documentos oficiais.

source: Gender Identities
es: Identidades de Género
pt: Identidades de Gênero

# cisgenderFemaleTitle
source: Cisgender Female
es: Mujer Cisgénero
pt: Feminino Cisgênero

# cisgenderFemaleDescription
source: Refers to people who were born female and identify with their birth sex.
es: Se refiere a las personas que nacieron mujeres y se identifican con su sexo de nacimiento.
pt: Refere-se a pessoas que nasceram mulheres e se identificam com o sexo de nascimento.

# cisgenderMaleTitle
source: Cisgender Male
es: Hombre Cisgénero
pt: Masculino Cisgênero

# cisgenderMaleDescription
source: Refers to people who were born male and identify with their birth sex.
es: Se refiere a las personas que nacieron hombres y se identifican con su sexo de nacimiento.
pt: Refere-se a pessoas que nasceram homens e se identificam com o sexo de nascimento

# transgenderFemaleTitle
source: Transgender Female
es: Mujer Transgénero
pt: Feminino Transgênero

# transgenderFemaleDescription
source: Indicates people who were born male but identify as female.
es: Indica las personas que nacieron hombres, pero se identifican como mujeres.
pt: Indica pessoas que nasceram homens, mas se identificam como mulheres.

# transgenderMaleTitle
source: Transgender Male
es: Hombre Transgénero
pt: Masculino Transgênero

# transgenderMaleDescription
source: Indicates people who were born female but identify as male.
es: Indica las personas que nacieron mujeres, pero se identifican como hombres.
pt: Indica pessoas que nasceram mulheres, mas se identificam como homens.

# nonBinaryTitle
source: Non-binary
es: No Binario
pt: Não binário

# nonBinaryDescription
source: Refers to people whose gender identity does not fit exclusively into the categories of male or female. They may identify in various ways outside the traditional gender binary.
es: Se refiere a las personas cuya identidad de género no encaja exclusivamente en las categorías de hombre o mujer. Pueden identificarse de diferentes maneras fuera del binario de género tradicional.
pt: Refere-se a pessoas cuja identidade de gênero não se encaixa exclusivamente nas categorias de homem ou mulher. Elas podem se identificar de diversas maneiras fora do tradicional binário de gênero.

# otherDescription
source: This option allows people to describe their gender identity in a way that is not included in the previous options. It is inclusive and respects the diversity of gender identities.
es: Esta opción permite a las personas describir su identidad de género de una forma que no está incluida en las opciones anteriores. Es inclusiva y respeta la diversidad de identidades de género.
pt: Esta opção permite que as pessoas descrevam sua identidade de gênero de uma forma que não está incluída nas opções anteriores. Ela é inclusiva e respeita a diversidade de identidades de gênero.

# refugeeDescription
source: A refugee is a person who leaves their country of origin due to persecution based on race, religion, nationality, social group, or political opinions, and who cannot or does not want to return due to fear of persecution.
es: Un refugiado es una persona que deja su país de origen debido a la persecución por motivos de raza, religión, nacionalidad, grupo social u opinión política, y que no puede o no quiere regresar por miedo a la persecución.
pt: Refugiado é uma pessoa que deixa seu país de origem devido a perseguições por motivos de raça, religião, nacionalidade, grupo social ou opiniões políticas, e que não pode ou não quer retornar por medo de perseguição.

# refugeeInBrazil
source: In Brazil, refugee status is granted by the government, providing legal protection and assistance to restart life in a safe and dignified manner.
es: En Brasil, el gobierno concede el status de refugiado, ofreciendo protección legal y asistencia para reiniciar la vida de forma segura y digna.
pt: No Brasil, o status de refugiado é concedido pelo governo, oferecendo proteção legal e assistência para recomeçar a vida de forma segura e digna.

# selfDeclarationSuccess
source: The self-declaration information has been changed.
es: La información de autodeclaración ha cambiado.
pt: As informações de autodeclaração foram alteradas.

source: Sexual orientation
es: Orientación sexual
pt: Orientação sexual

# yourSexualOrientation
source: What is your sexual and affective orientation?
es: ¿Cuál es su orientación sexual y afectiva?
pt: Qual sua orientação sexual e afetiva?

# asShownInYourCivilRegistry
source: As shown in your civil record.
es: Como consta en su registro civil.
pt: Conforme mostrado em seu registro civil.

source: Professional overview
es: Resumo Profissional
pt: Resumo Profissional

source: Sent by
es: Enviado por
pt: Enviado por

source: Received by
es: Recibido por
pt: Recebido por

source: Dependent
es: Tutelado
pt: Tutelado

source: Father/Mother-in-law
es: Suegro(a)
pt: Sogro(a)

source: Conservatee
es: Custodia
pt: Curatelado

# searchPesquise
source: Search
es: Búsqueda
pt: Pesquise

# searchPeopleHashtagsPublications
source: Search for people, hashtags or publications
es: Buscar personas, hashtags o publicaciones
pt: Procure por pessoas, hashtags ou publicações

# selectEmployee
source: Select the employee
es: Seleccione al empleado
pt: Selecione o colaborador

source: See more people
es: Ver más personas
pt: Ver mais pessoas

source: See more groups
es: Ver más grupos
pt: Ver mais grupos

source: See more posts
es: Ver más publicaciones
pt: Ver mais Publicações

source: See more hashtags
es: Ver más hashtags
pt: Ver mais hashtags

source: All
es: Todos
pt: Todos

source: People
es: Personas
pt: Pessoas

source: Posts
es: Publicaciones
pt: Publicações

source: Groups
es: Grupos
pt: Grupos

source: No publications found
es: Publicaciones no encontradas
pt: Não foram encontrados publicações

source: No people found
es: Personas no encontradas
pt: Não foram encontradas pessoas

source: No hashtags found
es: Hashtags no encontradas
pt: Não foram encontradas hashtags

source: No more publications found
es: No se han encontrado más publicaciones
pt: Não foram encontrados mais publicações

source: No more people found
es: No se han encontrado más personas
pt: Não foram encontradas mais pessoas

source: No more hashtags found
es: No se han encontrado más hashtags
pt: Não foram encontradas mais hashtags

source: Managed by
es: Gestionado por
pt: Administrado por

source: No results found for the entered term.
es: No se encontraron resultados para el término ingresado.
pt: Nenhum resultado encontrado com o termo digitado.

# pleaseCheckTermUsingDifferentKeywordsResults
source: Please check the term or try using different keywords for better results.
es: Por favor, verifique el término o intente usar palabras clave diferentes para obtener mejores resultados.
pt: Verifique o termo ou tente usar palavras-chave diferentes para obter melhores resultados.

# searchPeople
source: Search for people
es: Buscar personas
pt: Procure por pessoas

# searchHashtags
source: Search for hashtags
es: Buscar hashtags
pt: Procure por hashtags

# searchPublications
source: Search for publications
es: Buscar publicaciones
pt: Procure por publicações

# noGroupFoundTerm
source: No group found for the entered term
es: Ningún grupo encontrado con el término ingresado
pt: Nenhum grupo encontrado com o termo digitado

# noPersonFoundTerm
source: No person found for the entered term
es: Ninguna persona encontrada con el término ingresado
pt: Nenhuma pessoa encontrada com o termo digitado

# noHashtagFoundTerm
source: No hashtag found for the entered term
es: Ningún hashtag encontrado con el término ingresado
pt: Nenhuma hashtag encontrada com o termo digitado

# noPublicationFoundTerm
source: No publication found for the entered term
es: Ninguna publicación encontrada con el término ingresado
pt: Nenhuma publicação encontrada com o termo digitado

source: No results found
es: No se encontraron resultados
pt: Nenhum resultado encontrado

source: An error occurred while searching
es: Ocurrió un error al buscar
pt: Ocorreu um erro ao pesquisar

source: Enable logs
es: Habilitar registros
pt: Ativar logs

source: Disable logs
es: Desactivar registros
pt: Desativar logs

source: Send logs
es: Enviar registros
pt: Enviar logs

source: Logs enabled
es: Registros habilitados
pt: Logs ativados

source: Logs disabled
es: Registros deshabilitados
pt: Logs desativados

# successfulSyncLogs
source: Successful synchronizing logs
es: Sincronización exitosa de registros
pt: Sucesso ao sincronizar os logs

# partialSuccessSyncLogs
source: Partial success when synchronizing logs
es: Sincronización parcial de registros
pt: Sucesso parcial ao sincronizar os logs

# failedSyncLogs
source: Failed to synchronize logs
es: No se pudieron sincronizar los registros
pt: Falha ao sincronizar os logs

# unexpectedErrorSyncLogs
source: Unexpected error when synchronizing logs
es: Error inesperado al sincronizar registros
pt: Erro inesperado ao sincronizar os logs

# notLogsToSync
source: There are no logs to synchronize
es: No hay registros para sincronizar
pt: Não existem logs para sincronizar

# theFollowingFileFormatAllowed
source: The following file formats are accepted: {format}.
es: Se permiten los siguientes formatos de archivo: {format}.
pt: São permitidos os seguintes formatos de arquivo: {format}.

# theFileSizeMustMaximumOf
source: The file size must not exceed {fileSize} MB.
es: El tamaño máximo del archivo debe ser de {fileSize} MB.
pt: O tamanho do arquivo deverá ter no máximo {fileSize} MB.

# theAttachedFileLargerThan
source: The attached file is larger than {fileSize} MB. Please try again.
es: El archivo adjunto pesa más de {fileSize} MB. Por favor, inténtelo de nuevo.
pt: O arquivo anexado é maior que {fileSize} MB. Por favor, tente novamente.

source: Expired
es: Expirada
pt: Expirada

# vacationRequestExpiredInfoMessage
source: The vacation request has expired. You will need to cancel it or change it so that it starts on another date. In case of doubt, please contact our support.
es: La solicitud de vacaciones expiró. Será necesario cancelarla o modificarla para que inicie en otra fecha. En caso de dudas, contacte a nuestro equipo de soporte.
pt: A solicitação de férias expirou. Será necessário cancelá-la ou alterá-la para que inicie em outra data. Em caso de dúvida, entre em contato com nosso suporte.

source: Generate feedback suggestion
es: Sugerir retroalimentación
pt: Gerar sugestão de feedback

# feedbackSuggestion
source: IAssist feedback suggestion
es: Sugerencia de retroalimentación con IAssist
pt: Sugestão de feedback com IAssist

source: Feedback type
es: Tipo de retroalimentación
pt: Tipo de feedback

# feedbackBehavior
source: Observed situation or behavior
es: Situación o comportamiento observado
pt: Situação ou comportamento observado

# feedbackBehaviorHelper
source: What behavior do you want to highlight?
es: ¿Qué comportamiento deseas destacar?
pt: Que comportamento quer destacar?

# feedbackImpact
source: Impacts on you or the team
es: Impactos en ti o en el equipo
pt: Impactos para você ou na equipe

# feedbackImpactHelper
source: What changes did this action promote?
es: ¿Qué cambios promovió esta acción?
pt: Quais mudanças essa ação promoveu?

# feedbackImprovement
source: Improvement suggestion (optional)
es: Sugerencia de mejora (opcional)
pt: Sugestão de melhoria (opcional)

# feedbackImprovementHelper
source: How can the person continue evolving?
es: ¿Cómo puede la persona seguir evolucionando?
pt: Como a pessoa pode seguir evoluindo?

# feedbackToneCommunication
source: Tone of communication
es: Tono de comunicación
pt: Tom da comunicação

# feedbackSuggestionIassist
source: Generate a feedback text based on the following criteria:
es: Genera un texto de retroalimentación basado en los siguientes criterios:
pt: Gere um texto de feedback baseado nos seguintes critérios:

# feedbackSuggestionEmployee
source: Employee name:
es: Nombre del empleado:
pt: Nome do colaborador:

# feedbackSuggestionFeedbackType
source: Feedback type:
es: Tipo de retroalimentación:
pt: Tipo de feedback:

# feedbackSuggestionBehavior
source: Observed situation or behavior:
es: Situación o comportamiento observado:
pt: Situação ou comportamento observado:

# feedbackSuggestionImpact
source: Impacts on you or the team:
es: Impactos en ti o en el equipo:
pt: Impactos para você ou na equipe:

# feedbackSuggestionImprovement
source: Improvement suggestion:
es: Sugerencia de mejora:
pt: Sugestão de melhoria:

# feedbackSuggestionTone
source: Tone of communication:
es: Tono de comunicación:
pt: Tom da comunicação:

# feedbackSuggestionWithoutAssign
source: No greetings at the end, start directly with the feedback
es: Sin saludos al final, comienza directamente con la retroalimentación
pt: Sem saudações no final, Comece direto com o feedback

# feedbackSuggestionToneMotivator
source: Motivator (Encourages and engages the person)
es: Motivador (Incentiva y compromete a la persona)
pt: Motivador (Incentiva e engaja a pessoa)

# feedbackSuggestionToneProfessional
source: Professional (Direct and objective)
es: Profesional (Directo y objetivo)
pt: Profissional (Direto e objetivo)

# feedbackSuggestionToneBalanced
source: Balanced (Mixes both tones)
es: Equilibrado (Mezcla ambos tonos)
pt: Equilibrado (Mistura os dois tons)

# feedbackSuggestionFeedbackTypePraise
source: Recognition (Praise a good action or behavior)
es: Reconocimiento (Elogia una buena acción o comportamiento)
pt: Reconhecimento (Elogie uma boa ação ou comportamento)

# feedbackSuggestionFeedbackTypeImprovement
source: Improvement suggestion (Provide constructive feedback)
es: Sugerencia de mejora (Proporciona retroalimentación constructiva)
pt: Sugestão de melhoria (Dê um retorno construtivo)

# feedbackSuggestionIAssistHelper
source: The Artificial Intelligence assistant helps write clear and objective feedback. Fill in the information below:
es: El asistente de Inteligencia Artificial ayuda a redactar comentarios claros y objetivos. Complete la información a continuación:
pt: O assistente de Inteligência Artifical ajuda a escrever feedbacks claros e objetivos. Preencha as informações abaixo:

source: Generate feedback
es: Generar retroalimentación
pt: Gerar feedback

# privateGroupInfoTitle
source: This is a private group
es: Este es un grupo privado
pt: Este é um grupo privado

# privateGroupInfoDescription
source: To view posts, you must join the group and get approval from the administrator.
es: Para ver las publicaciones, debe unirse al grupo y obtener la aprobación del administrador.
pt: Para visualizar as publicações, é necessário participar do grupo e obter a aprovação do administrador.

source: Participants
es: Participantes
pt: Participantes

source: Public group
es: Grupo público
pt: Grupo público

source: Private group
es: Grupo privado
pt: Grupo privado

source: Join
es: Participar
pt: Participar

source: Request to join
es: Solicitar participación
pt: Solicitar participação

source: Stop following
es: Cancelar participación
pt: Cancelar participação

# requesToJoinPending
source: Request to join the group pending approval.
es: Solicitud de entrada en el grupo pendiente de aprobación.
pt: Solicitação para participar do grupo pendente de aprovação.

# deleteRNE
source: Delete RNE information?
es: ¿Eliminar informaciones del RNE?

# clockingEventTitle
source: Ponto
es: Punto
