Repository: felipeduarte26/waapi-flutter-module
Catalog: lib/app/core/localization/l10n/lang_*.arb
Languages: es, pt

source: Today
es: Hoy
pt: Hoje

source: Monday
es: Lunes
pt: Segunda-feira

source: Tuesday
es: Martes
pt: Terça-feira

source: Wednesday
es: Miércoles
pt: Quarta-feira

source: Thursday
es: Jueves
pt: Quinta-feira

source: Friday
es: Viernes
pt: Sexta-feira

source: Saturday
es: Sábado
pt: Sábado

source: Sunday
es: Domingo
pt: Domingo

source: Pending with the manager
es: Pendientes con el gerente
pt: Pendentes com o gestor

# theEmployeeHasRequestedManagerApproval
source: The employee has requested their vacation and is waiting for the manager's approval.
es: El empleado solicitó las vacaciones y está esperando la aprobación del gerente.
pt: O colaborador solicitou as férias e aguarda a aprovação do gestor.

source: Pending with HR
es: Pendientes con el RRHH
pt: Pendentes com o RH

# theEmployeeHasRequestedCompanyHRApproval
source: The employee has requested their vacation and is awaiting approval from the company's HR.
es: El empleado solicitó las vacaciones y está esperando la aprobación de RRHH de la empresa.
pt: O colaborador solicitou as férias e aguarda a aprovação do RH da empresa.

source: Scheduled
es: Programadas
pt: Programadas

# vacationRequestedAndApprovedButCalculationPaymentIsPending
source: Vacation has been requested and approved, but the calculation and payment programming is pending.
es: Las vacaciones fueron solicitadas y aprobadas, pero el cálculo y la programación del pago están pendientes
pt: As férias foram solicitadas e aprovadas, mas o cálculo e a programação do pagamento estão pendentes.

source: Calculated
es: Calculadas
pt: Calculadas

# vacationHasBeenApprovedPaymentScheduledTheReceiptAvailableVerification
source: The vacation has been approved. Payment has been scheduled and the receipt is available for verification.
es: Las vacaciones fueron aprobadas. El pago fue programado y el recibo está disponible para su consulta
pt: As férias foram aprovadas. O pagamento foi programado e o recibo está disponível para consulta.

source: No programming has been found.
es: Ninguna programación fue encontrada
pt: Nenhuma programação foi encontrada.

source: Staff Vacation programming
es: Calendario de vacaciones del equipo
pt: Calendário de férias da equipe

# displaysTheDaysWhenYourStaffProgrammingVacationsItIsDividedIntoFourCategories
source: Displays the days when your staff is programming vacations. It is divided into four categories:
es: Muestra los días que su equipo está programando vacaciones. Se divide en cuatro categorías:
pt: Exibe os dias em que sua equipe está programando as férias. Divide-se em quatro categorias:

# ofCoworkersOnVacation
source: of coworkers on vacation this month
es: de los compañeros de trabajo de vacaciones en este mes
pt: dos colegas de trabalho em férias nesse mês

source: Calendar
es: Calendario
pt: Calendário

# personalDocumentsSubmitted
source: The request to change personal documents has been sent.
es: La solicitud de modificación de documentos personales se envió.
pt: A solicitação para alterar os documentos pessoais foi enviada.

# deleteRic
source: Delete Civil Identity Register information?
es: ¿Eliminar informaciones del Registro de Identidad Civil?
pt: Apagar informações do RIC?

source: No programming was found.
es: No se encontró programación.
pt: Nenhuma programação foi encontrada.

source: Time control management
es: Gestión del punto
pt: Gestão do ponto

# noFunctionalitiesYourUser
source: No features available for your user
es: Sin funcionalidades disponibles para su usuario
pt: Sem funcionalidades disponíveis para seu usuário

# youHaveAccessToTheSeniorPlatform
source: You have access to Senior X Platform, but you don't have Waapi's features enabled. Contact your company's human resources department and check the solutions available from Senior Sistemas.
es: Usted tiene acceso a la Plataforma Senior X, pero no tiene habilitadas las funcionalidades Waapi. Entre en contacto con el departamento de recursos humanos de su empresa y verifique las soluciones disponibles de la Senior Sistemas.
pt: Você possui acesso à Plataforma Senior X, porém não possui as funcionalidades do Waapi habilitadas. Entre em contato com o departamento de recursos humanos da sua empresa e verifique as soluções disponíveis da Senior Sistemas.

# timeControlNotification
source: Time control is working in offline mode!
es: ¡El punto está funcionando en modo offline!
pt: Ponto está funcionando no modo offline!

source: Financial data
es: Datos financieros
pt: Dados financeiros

# offlineModeNotification
source: The app is working in offline mode!
es: ¡La aplicación esta funcionando en modo offline!
pt: O aplicativo está funcionando no modo offline!

# featureIsNotAvailableOffline
source: This feature is not available while offline. Please check your internet connection.
es: Esta función no está disponible sin conexión. Comprueba tu conexión.
pt: Esta funcionalidade não está disponível enquanto estiver offline. Verifique sua conexão.

source: Statement
es: Estado de cuenta
pt: Demonstrativo

source: Earnings report
es: Informe de rendimientos
pt: Informe de rendimentos

source: Payment statement
es: Estado de pago
pt: Demonstrativo de pagamento

# searchStatement
source: Search for the statement
es: Busque el estado
pt: Pesquise o demonstrativo

# payedOn
source: Payed on {date}
es: Pago en {date}
pt: Pago em {date}

# receivableIn
source: Receivable in {date}
es: A recibir el {date}
pt: A receber em {date}

source: Net
es: Neto
pt: Líquido

source: Proceeds
es: Ingreso procedente
pt: Proventos

source: Deductions
es: Descuentos
pt: Descontos

source: View PDF
es: Ver PDF
pt: Ver PDF

source: More details
es: Más detalles
pt: Mais detalhes

source: Monthly calculation
es: Cálculo mensual
pt: Cálculo mensal

source: Complementary payroll
es: Nómina complementaria
pt: Folha complementar

source: Bargaining complement
es: Complemento de convención colectiva
pt: Complementar de dissídio

source: Bargaining payment
es: Pago de convención colectiva
pt: Pagamento de dissídio

source: Rescission complement
es: Complemento de rescisión
pt: Complementar de rescisão

source: First week
es: Primera semana
pt: Primeira semana

source: Intermediate week
es: Semana intermedia
pt: Semana intermediária

source: Last week
es: Última semana
pt: Última semana

source: Bonus
es: Gratificación
pt: Gratificação

source: First fortnight
es: Primera quincena
pt: Primeira quinzena

source: Second fortnight
es: Segunda quincena
pt: Segunda quinzena

source: Salary advance
es: Antecipo de sueldo
pt: Adiantamento salarial

source: Profit sharing
es: Participación en las ganancias
pt: Participação nos lucros

source: Special
es: Especiales
pt: Especiais

source: Labor claim
es: Denuncias laborales
pt: Reclamatória trabalhista

# waitMessageDownloadPDF
source: Soon the statements will be available for download.
es: Las demostraciones pronto estarán disponibles para su descarga.
pt: Em breve os demonstrativos estarão disponíveis para download.

source: January
es: Enero
pt: Janeiro

source: February
es: Febrero
pt: Fevereiro

source: March
es: Marzo
pt: Março

source: April
es: Abril
pt: Abril

source: May
es: Mayo
pt: Maio

source: June
es: Junio
pt: Junho

source: July
es: Julio
pt: Julho

source: August
es: Agosto
pt: Agosto

source: September
es: Septiembre
pt: Setembro

source: October
es: Octubre
pt: Outubro

source: November
es: Noviembre
pt: Novembro

source: December
es: Diciembre
pt: Dezembro

# payrollLoadingMoreError
source: An error occurred while trying to fetch more payment statements. Tap Retry to try again.
es: Se ha producido un error al intentar obtener más estado de pago. Toca Reintentar para volver a intentarlo.
pt: Ocorreu um erro ao tentar buscar mais demonstrativos de pagamento. Toque em Repetir para tentar novamente.

# noStatementsAvailableTitle
source: No payment statements available yet
es: Aún no existen estados de pago disponibles
pt: Ainda não existem demonstrativos de pagamento disponíveis

# noStatementsAvailableSubtitle
source: When statements are available, they will be shown here for consultation.
es: Cuando existieren estados, ellos quedarán disponibles aquí para consulta.
pt: Quando houver demonstrativos, eles ficarão disponíveis aqui para consulta.

# statementsErrorTitle
source: Unable to load your payment statements
es: No fue posible cargar sus estados de pago
pt: Não foi possível carregar seus demonstrativos de pagamento

# financialDataErrorDescription
source: Wait a few moments and try loading again.
es: Aguarde algunos instantes e intente cargar nuevamente.
pt: Aguarde alguns instantes e tente carregar novamente.

# noIncomeReportAvailableTitle
source: No income statements available yet
es: Aún no existen informes de ingresos disponibles
pt: Ainda não existem informes de rendimento disponíveis

# noIncomeReportAvailableSubtitle
source: When income statements are available, they will be shown here for consultation.
es: Cuando existieren informes de ingresos, ellos quedarán disponibles aquí para consulta.
pt: Quando houver informes de rendimento, eles ficarão disponíveis aqui para consulta.

# incomeReportErrorTitle
source: Unable to load your income statement
es: No fue posible cargar su informe de ingreso
pt: Não foi possível carregar seu informe de rendimento

source: Salary payment statement
es: Extracto de pago de Sueldo
pt: Demonstrativo de pagamento de Salário

source: Company
es: Empresa
pt: Empresa

source: Payment date
es: Fecha de pago
pt: Data de pagamento

source: Payment type
es: Tipo de pago
pt: Tipo de pagamento

source: Check
es: Cheque
pt: Cheque

source: Payment order
es: Orde de Pago
pt: Ordem de Pagamento

source: Money
es: Efectivo
pt: Dinheiro

source: Bank deposit
es: Depósito bancario
pt: Depósito bancário

# numberDependentsIncomeTax
source: Dependents for Income Tax
es: Dependientes para el impuesto sobre la renta
pt: Dependentes para Imposto de renda

# numberDependentsFamilySalary
source: Dependents for Family Salary
es: Dependientes para Sueldo Familia
pt: Dependentes para Salário Família

source: Base salary
es: Sueldo base
pt: Salário-base

source: INSS calculation basis
es: Base de cálculo del INSS
pt: Base de cálculo INSS

# incometTaxCalculationBasis
source: Income Tax calculation basis
es: Base de cálculo IR
pt: Base de cálculo IR

source: FGTS calculation basis
es: Base de cálculo FGTS
pt: Base de cálculo FGTS

# fgtsMonth
source: FGTS of the month
es: FGTS del mes
pt: FGTS do mês

# pageTo
source: Page {page1} of {page2}
es: Página {page1} de {page2}
pt: Página {page1} de {page2}

source: Description
es: Descripción
pt: Descrição

source: Reference
es: Referencia
pt: Referência

source: Totals
es: Totales
pt: Totais

source: Net receivable value
es: Valor neto a cobrar
pt: Valor líquido a receber

source: Share PDF
es: Compartir PDF
pt: Compartilhar PDF

# messageErroCreatePdf
source: Could not load the information. Please try again later.
es: No fue posible cargar las informaciones. Vuelva a intentarlo más tarde.
pt: Não foi possível carregar as informações. Tente novamente mais tarde.

# messageInformationBalanceVacation
source: The balance shows the sum of proportional and accrued vacation. This balance does not include double vacation days, which are displayed separately.
es: El saldo muestra la suma de las vacaciones proporcionales y acumuladas. Este saldo no incluye los días dobles de vacaciones, que se muestran por separado.
pt: No saldo apresenta a soma das férias proporcionais e vencidas. Este saldo não inclui os dias de férias dobradas, que são exibidos separadamente

# messageInformationProportionalVacation
source: Vacation time proportional to the time worked, which means that it occurs before the employee completes their twelve-month vesting period, and is proportional to the time they have worked without having a full twelve-month period as of their hire date.
es: Periodo de vacaciones proporcional al tiempo trabajado. Es decir, se produce antes de que el trabajador complete su período de consolidación de doce meses, siendo proporcional al tiempo que trabajó sin tener un período completo de 12 meses desde la fecha de admisión.
pt: Período de férias proporcional ao tempo trabalhado. Ou seja, ela ocorre antes do colaborador completar o seu período aquisitivo de doze meses, sendo proporcional ao tempo em que ele trabalhou sem ter um período completo de 12 meses a contar da sua data de admissão.

# messageInformationPastDueBalanceVacation
source: Accrued vacation is the vacation to which an employee is entitled to 30 days rest when he stays for one year with the company or contractor. Upon completing 12 months of work with the same employer, the employee acquires the right to vacation. The period for taking it is over the next 12 months.
es: Las vacaciones dobles se producen cuando el trabajador trabaja durante 24 meses sin tener la oportunidad de disfrutar de vacaciones retribuidas, es decir, trabaja durante dos periodos de 12 meses sin disfrutar ningún periodo de vacaciones.
pt: Férias vencidas são aquelas às quais um funcionário tem direito a 30 dias de descanso, quando fica por um ano com a empresa ou o contratante. Ao completar 12 meses de trabalho com o mesmo empregador, o trabalhador adquire o direito às férias. O prazo para gozo é ao longo dos próximos 12 meses.

# messageInformationDoubledVacation
source: Double vacation happens when the employee works for 24 months without having the opportunity for paid rest, i.e., works for two 12-month periods without taking any vacation time.
es: Las vacaciones acumuladas son aquellas a las que un trabajador tiene derecho a 30 días de descanso, cuando permanece un año en la empresa o contratista. Al cumplir 12 meses de trabajo con el mismo empresario, el trabajador adquiere el derecho a vacaciones. El periodo para disfrutarlas es durante los 12 meses siguientes.
pt: Férias dobradas acontece quando o empregado trabalha por 24 meses sem ter a oportunidade do descanso remunerado, ou seja, trabalha por dois períodos de 12 meses sem tirar nenhum período de férias.

# messageThankYouInput
source: We appreciate your contribution!
es: ¡Agradecemos su contribución!
pt: Agradecemos a sua contribuição!

# messageInformationHelpful
source: Was this information helpful?
es: ¿Le ha resultado útil esta información?
pt: Esta informação foi útil?

source: Informative
es: Informativas
pt: Informativas

source: No data registered yet
es: Aún no hay datos registrados
pt: Ainda não há dados cadastrados

source: Add dependent
es: Agregar dependiente
pt: Adicionar dependente

source: My dependents
es: Mis dependientes
pt: Meus dependentes

# dependentConsideredInCalculation
source: Dependent considered in the calculation of
es: Dependiente considerado en el cálculo de
pt: Dependente considerado no cálculo de

# requestChangePersonalContacts
source: The request to modify personal contacts has been sent.
es: Se ha enviado la solicitud de cambio de contactos personales.
pt: A solicitação para alterar os contatos pessoais foi enviada.

source: Family salary
es: Sueldo familia
pt: Salário-família

source: Edit status:
es: Editar estado:
pt: Status da edição:

# inclusionStatus
source: Inclusion statuses:
es: Status de la inclusión:
pt: Status da inclusão:

# requestedOn
source: Requested on {date}
es: Solicitado el {date}
pt: Solicitado em {date}

source: Alimony
es: pensión alimenticia
pt: Pensão alimentícia

source: Net value
es: Valor neto
pt: Valor líquido

# awaitingReview
source: Awaiting evaluation
es: Aguardando evaluación
pt: Aguardando avaliação

# waitingIntegration
source: In process
es: En trámite
pt: Em processamento

# integrationError
source: Error in Inclusion
es: Error en la Inclusión
pt: Erro na Inclusão

# returnedToAdjustments
source: Returned for adjustments
es: Devuelto para ajustes
pt: Retornado para ajustes

source: Dependent's personal data
es: Datos personales del dependiente
pt: Dados pessoais do dependente

source: Live birth certificate
es: Declaración de nacido vivo
pt: Declaração de nascido vivo

source: Mother's name
es: Nombre de la madre
pt: Nome da mãe

source: City of birth
es: Ciudad de nacimiento
pt: Cidade de Nascimento

source: Income tax dependent
es: Dependiente en el Impuesto sobre la Renta
pt: Dependente no IR

source: Birth certificate
es: Certificado de nacimiento
pt: Certidão de nascimento

source: death certificate
es: Certificado de fallecimiento
pt: Certidão de Óbito

source: Date of death
es: Fecha de fallecimiento
pt: Data do óbito

source: City of the certificate
es: Ciudad en el certificado
pt: Cidade da certidão

# enterTheDependentCpf
source: Enter the dependent's CPF
es: Introduzca el CPF del dependiente
pt: Digite o CPF do dependente

# defineValidCpf
source: Define a valid CPF
es: Introduzca un CPF válido
pt: Informe um CPF válido

# enterFullName
source: Enter the full name
es: Introduzca el nombre completo
pt: Digite o nome completo

source: Select gender
es: Seleccione el sexo
pt: Selecione sexo

# selectRelationship
source: Select the relationship degree
es: Seleccione el grado de parentesco
pt: Selecione o grau de parentesco

# selectIncomeTaxDependent
source: Select whether the person is income tax dependent or not
es: SSeleccione si es dependiente en el Impuesto sobre la Renta
pt: Selecione se é dependente no Imposto de Renda

# dateCannotFuture
source: The date defined cannot be a future date
es: La fecha introducida no puede ser una fecha futura
pt: A data informada não pode ser uma data futura

# defineDateBirth
source: Define the date of birth
es: Introduzca la fecha de nacimiento
pt: Informe a data de nascimento

# haveFilledCertificateNeedAttach
source: If you have filled out a certificate (birth or death), you must attach the digital certificate.
es: Si ha rellenado un certificado (de nacimiento o fallecimiento), debe adjuntar el certificado escaneado.
pt: Caso você tenha preenchido uma certidão (nascimento ou óbito), você deve anexar a certidão digitalizada.

source: Optional
es: Opcional
pt: Opcional

source: Additional documents
es: Documentos adicionales
pt: Documentos adicionais

# dependentSubmitted
source: The request to change the dependent has been submitted.
es: La solicitud de cambio de dependiente ha sido enviada.
pt: A solicitação para alterar o dependente foi enviada.

# firstTextExplanationHappinessIndex
source: Track your mood by keeping a daily log. You can express your day's mood and explain why you feel that way. This monitoring is a way to pay attention to your mental and emotional health.
es: Monitoree su humor manteniendo un registro diario.Usted puede expresar su sentimiento del día y explicar por qué se siente así. Este monitoreo es una forma de dar atención a su salud mental y emocional.
pt: Acompanhe seu humor mantendo um registro diário. Você pode demonstrar o seu sentimento do dia e explicar porquê se sente assim. Este monitoramento é uma forma de dar atenção à sua saúde mental e emocional.

# secodTextExplanationHappinessIndex
source: It also collaborates by generating team mood reports. Your manager will receive the team information
es: Él también ayuda a generar informes de humor del equipo. ¡Su gestor recibirá las informaciones del time de
pt: Ele também colabora para gerar relatórios de humor da equipe. Seu gestor receberá as informações do time de

source: anonymously!
es: forma anónima!
pt: forma anônima!

# thirdTextExplanationHappinessIndex
source: Learn more in our Documentation Portal.
es: Más información en nuestro Portal de Documentación.
pt: Saiba mais em nosso Portal da Documentação.

# textButtonExplanationHappinessIndex
source: Check documentation
es: Ver documentación
pt: Conferir documentação

source: Mood Diary Documentation
es: Documentación del Diario de Humor
pt: Documentação Diário de Humor

source: Your mood today was:
es: Su humor hoy ha sido:
pt: Seu humor hoje foi:

# whyFeelingHappinessIndex
source: Why are you feeling this way?
es: ¿Por qué se siente así?
pt: Por que está se sentindo assim?

source: Today's note
es: Nota de hoy
pt: Nota de hoje

# anonymouslySharedHappinessIndex
source: This information will be anonymously shared with your manager.
es: Esta información será compartida con su superior de forma anónima.
pt: Esta informação será compartilhada com seu gestor de forma anônima.

source: reason recorded
es: motivo registrado
pt: motivo registrado

source: reasons recorded
es: motivos registrados
pt: motivos registrados

# noRecordsThisDay
source: There were no records this day
es: No hubo inscripción este día
pt: Não houve registro neste dia

# noRecordsToday
source: No records today yet
es: Aún no hay registros hoy
pt: Ainda não há registros hoje

source: Mood of the day
es: Humor del día
pt: Humor do dia

source: Your mood today is:
es: Su humor hoy es:
pt: Seu humor hoje é:

source: On this day your mood was:
es: En este día su humor era:
pt: Neste dia seu humor era:

source: Reasons
es: Motivos
pt: Motivos

# unableViewFutureMarkings
source: Unable to view markings in the future
es: No se puede ver marcaciones en el futuro
pt: Não é possível visualizar marcações no futuro

# humorReportEmptyStateTitle
source: Unable to get your mood calendar
es: No he podido conseguir su calendario de humor
pt: Não foi possível obter seu calendário de humor

# humorReportEmptyStateSubtitle
source: At the moment the information could not be uploaded. Please try again soon.
es: En el momento no he podido cargar la información. Intente nuevamente en breve.
pt: No momento não foi possível carregar as informações. Tente novamente em breve.

source: Mood swings
es: Cambio de humor
pt: Variação de humor

# noRegisterOnWeek
source: There was no register during the week
es: Ningún registro en la semana
pt: Não houve registro na semana

source: Mood count
es: Recuento de humor
pt: Contagem de humor

source: Main reasons
es: Principales motivos
pt: Principais motivos

source: Analysis
es: Análisis
pt: Análise

source: Week analysis
es: Análisis de la semana
pt: Análise da semana

source: Under analysis
es: En análisis
pt: Em análise

# alreadyRequestChangeVacation
source: There is already a request for a change to this vacation schedule.
es: Ya existe una solicitud de cambio para este programa de vacaciones.
pt: Já existe uma solicitação de alteração para essa programação de férias

source: Changes in processing
es: Cambios en el procesamiento
pt: Alterações em processamento

# unregisteredBiometricsCode
source: Unregistered biometrics or code
es: Biometría o código no registrado
pt: Biometria ou código não cadastrados

source: Access with biometrics
es: Acceso por biometría
pt: Acesso por biometria

# unregisteredBiometricsCodeInfo
source: To use this option, please activate the biometrics or code in your device settings. Return to the app and enable this option.
es: Para utilizar esta opción, por favor, active la biometría o el código en la configuración de su dispositivo. Regrese a la aplicación y habilite esta opción.
pt: Para utilizar esta opção, por favor, ative a biometria ou o código nas configurações do seu dispositivo. Retorne ao aplicativo e habilite esta opção

# accessWithBiometricsInfo
source: When this function is activated, you will need to use biometrics or the code to unlock the application.
es: Cuando esta función esté activada, necesitarás usar la biometría o el código para desbloquear la aplicación.
pt: Quando esta função estiver ativada, você precisará usar a biometria ou o código para desbloquear o aplicativo.

# accessWithBiometricsAcessar
source: Access with biometrics or cell phone code.
es: Acessar con biometría o código del celular.
pt: Entrar com biometria ou código do celular.

source: Understand
es: Entiendo
pt: Entendi

source: Quick access
es: Acceso rápido
pt: Acesso rápido

source: Search
es: Buscar
pt: Pesquisar
