Repository: felipeduarte26/waapi-flutter-module
Catalog: lib/app/core/localization/l10n/lang_*.arb
Languages: es, pt

# noResultsForSearch
source: No results were found for this search
es: No se han encontrado resultados para la búsqueda realizada
pt: Nenhum resultado foi encontrado para a busca realizada

# makeSureCorrectlyTerm
source: Make sure the words were written correctly or try a different search term.
es: Asegúrese de que las palabras están escritas correctamente o pruebe con otro término de búsqueda.
pt: Certifique-se de que as palavras foram escritas corretamente ou tente um termo de busca diferente.

# hyperlinksErrorState
source: Could not load the quick accesses at this time
es: No se puede cargar el acceso rápido en este momento
pt: Não foi possível carregar os acessos rápidos no momento

# hyperlinksErrorStateHelp
source: Try again or wait a few moments to try again.
es: Inténtelo de nuevo o espere unos instantes para repetir la acción.
pt: Tente novamente ou aguarde alguns instantes para repetir a ação.

# hyperlinksEmptyState
source: No links registered for quick access
es: No hay enlaces registrados para el acceso rápido
pt: Não há links cadastrados para acesso rápido

# hyperlinksEmptyStateHelp
source: The HR department of your company has not registered any links yet. When any links are available, they will show up here.
es: El departamento de RRHH de su empresa aún no ha registrado ningún enlace. Cuando haya enlaces, aparecerán aquí.
pt: O RH da sua empresa ainda não cadastrou nenhum link. Quando houver links, eles aparecerão aqui.

# hyperlinkOpenError
source: Could not obtain the selected page
es: No ha sido posible recuperar la página seleccionada
pt: Não foi possível obter a página selecionada

# couldNotLoadInformationTryAgain
source: Could not load the information at this time. Try again in a few moments.
es: La información no se ha podido cargar en este momento. Por favor, inténtelo de nuevo pronto.
pt: No momento não foi possível carregar as informações. Tente novamente em breve.

# makeSureWordsCorrectly
source: Make sure the words are spelled correctly or try another search term.
es: Verifique si las palabras han sido escritas correctamente o intente otro término de búsqueda.
pt: Certifique-se de que as palavras foram escritas corretamente ou tente outro termo de busca.

# raceColorSearchHelpDescription
source: Use the field above to search for your race or ethnicity.
es: Utiliza el campo de arriba para buscar tu raza o etnia.
pt: Utilize o campo acima para pesquisar sua raça ou etnia.

source: Receipt
es: Recibo
pt: Recibo

source: Vacation Notice
es: Aviso
pt: Aviso

source: View receipt
es: Ver recibo
pt: Ver recibo

source: View vacation notice
es: Ver aviso
pt: Ver aviso

source: Current Statement
es: Estado de cuenta actual
pt: Demonstrativo atual

source: Previous statements
es: Estados de cuenta anteriores
pt: Demonstrativos anteriores

source: View documents
es: Ver documentos
pt: Ver documentos

# pedingDocumentsSignature
source: There are documents pending signature
es: Hay documentos pendientes de firma
pt: Existem documentos pendentes de assinatura

# pedingDocumentsSignatureDescription
source: Tap view documents and sign.
es: Toca ver documentos y firmar.
pt: Toque em visualizar documentos e assine.

# em
source: in
es: en
pt: em

source: ago
es: hace
pt: há

# hours
source: hour
es: horas
pt: horas

source: hour
es: hora
pt: hora

source: months
es: meses
pt: meses

source: month
es: mes
pt: mês

source: You
es: Usted
pt: Você

source: See more
es: Ver más
pt: Ver mais

source: See less
es: Ver menos
pt: Ver menos

source: comments
es: comentários
pt: comentários

source: Comment
es: Comentar
pt: Comentar

source: shares
es: comparticiones
pt: compartilhamentos

source: Share
es: Compartir
pt: Compartilhar

source: Like
es: Me gusta
pt: Curtir

source: Liked
es: Me gustó
pt: Curtido

source: minute
es: minuto
pt: minuto

source: minutes
es: Minutos
pt: Minutos

# socialPostEmptyTitle
source: No publications yet
es: Aún no hay publicaciones
pt: Ainda não há publicações

# socialPostEmptyMessage
source: When there are publications from the company or your coworkers, they will appear here. Be the first to publish.
es: Cuando haya publicaciones de la empresa o de sus colegas, aparecerán aquí. Sea el primero en publicar.
pt: Quando houver publicações da empresa ou dos seus colegas, elas aparecerão aqui. Seja o primeiro a publicar.

# socialProfilePostsEmptyMessage
source: When there are publications from the company or your coworkers, they will appear here.
es: Cuando haya publicaciones de la empresa o de sus colegas, aparecerán aquí.
pt: Quando houver publicações da empresa ou dos seus colegas, elas aparecerão aqui

# socialPostErrorTitle
source: Unable to upload information at the moment
es: La información no se ha podido cargar en este momento
pt: No momento não foi possível carregar as informações

source: Publish
es: Publicar
pt: Publicar

# socialPostEmpty
source: You have reached the end of the posts.
es: Has llegado al final de las publicaciones.
pt: Você chegou ao final das postagens.

# socialPostErro
source: Unable to load new posts.
es: No se pudieron cargar nuevas publicaciones.
pt: Não foi possível carregar novas postagens.

source: Error loading video
es: Error al cargar vídeo
pt: Erro ao carregar o vídeo

source: Error loading image
es: Error al cargar la imagen
pt: Erro ao carregar imagem

source: Facial recognition registration
es: Registro de reconocimiento facial
pt: Cadastro de reconhecimento facial

# commentsTitle
source: Comments
es: Comentários
pt: Comentários

# socialNoComments
source: No comments on this post yet
es: Aún no hay comentarios en esta publicación
pt: Ainda não há comentários nesta publicação

# socialNoCommentsSuggestion
source: Be the first to comment.
es: Sea el primer a añdir un comentário.
pt: Seja o primeiro a adicionar um comentário.

# socialCommentReplies
source: Comment replies
es: Respuesta(s) del comentario
pt: Resposta(s) do comentário

# socialCommentReply
source: Reply
es: Responder
pt: Responder

# socialAnswers
source: answers
es: respuestas
pt: respostas

# socialShowMoreAnswers
source: Show more answers
es: Mostrar más respuestas
pt: Exibir mais respostas

source: Edited
es: Editado
pt: Editado

source: Author
es: Autor
pt: Autor

# socialComment
source: comment
es: comentário
pt: comentário

# socialAnswer
source: answer
es: respuesta
pt: resposta

# homeNavigation
source: Home
es: Inicio
pt: Início

# socialLikeError
source: An error occurred while registering the like action. Tap Repeat to try again.
es: Ha ocurrido un error al registrar la acción "Me gusta". Pulse Repetir para volver a intentarlo.
pt: Ocorreu um erro ao registrar a ação de curtir. Toque em Repetir para tentar novamente.

# errorRootTitle
source: Device with root access detected
es: Dispositivo con acceso root identificado
pt: Dispositivo com acesso root identificado

# errorRootSubTitle
source: Waapi cannot be accessed on devices with root access (superuser or su) for security reasons.
es: Por motivos de seguridad, Waapi no puede ser accesado en dispositivos con acceso root (superusuario o su).
pt: O Waapi não pode ser acessado em dispositivos com acesso root (superusuário ou su) por motivos de segurança.

# exitApp
source: Exit application
es: Salir de la aplicación
pt: Sair do aplicativo

# peopleLikedPost
source: People who liked the post
es: Personas a las que les gustó la publicación
pt: Pessoas que curtiram a publicação

# peopleLikedComment
source: People who liked the comment
es: Personas a las que les gustó el comentario
pt: Pessoas que curtiram o comentário

# unableLoadPostLikes
source: Unable to load the likes.
es: No se han podido cargar los me gusta.
pt: Não foi possível carregar as curtidas.

# unableLoadNewPostLikes
source: Unable to load new likes.
es: No se han podido cargar los nuevos me gusta.
pt: Não foi possível carregar novas curtidas.

source: Try again soon
es: Vuelva a intentarlo pronto
pt: Tente novamente em breve

source: Try again
es: Intentar nuevamente
pt: Tente novamente

source: Share post
es: Compartir publicación
pt: Compartilhar publicação

# selectMaxEmployees
source: Select a maximum of 5 employees
es: Seleccione al máximo 5 empleados
pt: Selecione no máximo 5 colaboradores

source: Send post
es: Enviar publicación
pt: Enviar publicação

source: Share link
es: Compartir enlace
pt: Compartilhar link

source: Copy link
es: Copiar enlace
pt: Copiar link

# linkCopied
source: Link copied successfully.
es: Enlace copiado con éxito.
pt: O link foi copiado com sucesso.

# postShared
source: Post shared successfully.
es: Publicación compartida con éxito.
pt: Publicação compartilhada com sucesso.

# sharedPostError
source: An error occurred while sharing the post. Tap Repeat to try again.
es: Ha ocurrido un error al compartir la publicación. Pulse Repetir para intentar de nuevo.
pt: Ocorreu um erro ao compartilhar publicação. Toque em Repetir para tentar novamente.

# writeComment
source: Write your comment
es: Escriba su comentario
pt: Escreva seu comentário

# replyComment
source: Reply to the comment
es: Conteste al comentario
pt: Responda ao comentário

# commentPosted
source: Comment posted successfully.
es: Comentario realizado con éxito.
pt: Comentário realizado com sucesso.

source: Camera
es: Cámara
pt: Câmera

# unableAccessFilePleaseAgain
source: Unable to load file or photo. Please try again.
es: No ha sido posible cargar el archivo o la foto. Inténtelo de nuevo.
pt: Não foi possível carregar o arquivo ou foto. Por favor, tente novamente.

# commentPostError
source: An error occurred while posting the comment. Tap Retry to try again.
es: Ha ocurrido un error al comentar. Pulse Repetir para intentar de nuevo.
pt: Ocorreu um erro ao comentar. Toque em Repetir para tentar novamente.

# informYourRaceEthnicity
source: Inform your race or ethnicity
es: Introducir su raza o etnia
pt: Informar sua raça ou etnia

# noRaceEthnicityFoundWithTerm
source: No race or ethnicity found with the entered term
es: Ninguna raza o etnia fue encontrada con el término digitado
pt: Nenhuma raça ou etnia foi encontrada com o termo digitado

# searchYourRaceEthnicity
source: Search for your race or ethnicity
es: Busca su raza o etnia
pt: Busque sua raça ou etnia

source: Race/Ethnicity
es: Raza/Etnia
pt: Raça/Etnia

# provideYourCPFtheDependent
source: Enter your own CPF (Natural Person Register) number for the dependent?
es: ¿Introducir su proprio CPF (Registro Nacional de Persona) para el dependiente?
pt: Informar o seu próprio CPF para o dependente?

# provideYourCPFtheDependentDescription
source: The entered CPF (Natural Person Register) number is the same as {nameHolder}. Are you sure you want to enter this CPF (Natural Person Register) for the Family File?
es: El número del CPF (Registro Nacional de Persona) introducido es el mismo que el de {nameHolder}. ¿Está seguro que desea introducir este CPF (Registro Nacional de Persona) para el registro de la Ficha Familiar?
pt: O número do CPF informado é o mesmo que o da {nameHolder}. Tem certeza que deseja informar este CPF para o cadastro da Ficha Familiar?

# timeControlReceivedNotificationTitle
source: Clocking event request received
es: Solicitud de punto recibida
pt: Solicitação de ponto recebida

# timeControlReceivedNotificationDescription
source: You may receive a push notification informing you of your clocking event.
es: Usted podrá recibir una notificación push informándole de su punto.
pt: Você poderá receber uma notificação por push informando sobre o seu ponto.

# moodsEmptyStateTitle
source: You have already answered this survey
es: Usted ya ha respondido a esta encuesta
pt: Você já respondeu esta pesquisa

# moodsEmptyStateSubTitle
source: Your answers have already been computed by our system. Please note that this survey does not use or save respondents' personal data.
es: Sus respuestas ya se han introducido en nuestro sistema. Recuerde que esta encuesta no utiliza ni graba los datos personales de los encuestados.
pt: Suas respostas já foram computadas pelo nosso sistema. Lembrando que esta pesquisa não utiliza e nem salva dados pessoais dos respondentes.

source: Moods pulse
es: Pulso del Moods
pt: Pulso do Moods

# alertExpiredPulse
source: The time for this survey has expired. Please wait for the next pulse.
es: El tiempo para esta encuesta ha expirado. Espere al próximo pulso.
pt: O tempo desta pesquisa expirou. Aguarde o próximo pulso.

# moodsNotificationDescription
source: You may receive a notification informing you that you have received a new Moods pulse to respond to.
es: Es posible que reciba una notificación informándole de que ha recibido un nuevo pulso de Moods para responder.
pt: Você poderá receber uma notificação informando que recebeu um novo pulso do Moods para responder.

# checkOut
source: View
es: Ver
pt: Conferir

# waapiLiteNotification
source: This is a simplified version of the application. Discover the full version!
es: Esta es una versión simplificada de la aplicación. ¡Conozca la versión completa!
pt: Esta é uma versão simplificada do aplicativo. Conheça a versão completa!

# waapiLiteVersion
source: Lite Version
es: Versión Lite
pt: Versão Lite

# waapiLiteCheckOutDescription
source: Waapi's Lite version is a simplified trial of our main platform, which aims to provide a strategic vision of human capital, facilitating employee autonomy. It has been designed as an affordable way for customers to get to know and try out our product. Learn more in our Documentation Portal.
es: La versión Lite de Waapi es una versión simplificada de nuestra plataforma principal, cuyo objetivo es proporcionar una visión estratégica del capital humano, facilitando la autonomía de los empleados. Diseñada como una entrada accesible para que los clientes conozcan y prueben nuestro producto. Más información en nuestro Portal de Documentación.
pt: A versão Lite do Waapi é uma oferta simplificada de degustação da nossa plataforma principal, que tem o objetivo de fornecer uma visão estratégica do capital humano, facilitando a autonomia dos colaboradores. Ela foi projetada como uma entrada acessível para os clientes conhecerem e experimentarem o nosso produto. Saiba mais em nosso Portal da Documentação.

source: Waapi Lite Documentation
es: Documentación del Versión Lite
pt: Documentação Waapi Lite

source: No group defined
es: Sin grupo definido
pt: Sem grupo definido

# writeAboutWhatyoupublish
source: Write about what you want to publish
es: Escriba sobre lo que desea publicar
pt: Escreva sobre o que quer publicar

source: Media
pt: Mídias

source: File
es: Archivo
pt: Arquivo

source: Shortener
es: Acortador
pt: Encurtador

source: Schedule
es: Programar
pt: Agendar

source: Shorten publication links?
es: ¿Acortar los enlaces de la publicación?
pt: Encurtar links da publicação?

# allLinksPublicationAutomaticallyShortened
source: All links written in the publication will be automatically shortened.
es: Todos sus enlaces escritos en la publicación se acortarán automáticamente.
pt: Todos os seus links escritos na publicação serão encurtados automaticamente.

source: Publication settings
es: Configuración de la publicación
pt: Configurações da publicação

source: Choose profile
es: Elegir perfil
pt: Escolher perfil

source: Group
es: Grupo
pt: Grupo

source: Add group
es: Añadir grupo
pt: Adicionar grupo

source: Schedule publication (optional)
es: Programar publicación (opcional)
pt: Agendar publicação (opcional)

source: Add date and time
es: Añadir fecha y hora
pt: Adicionar data e hora

source: Limit comments
es: Restringir comentarios
pt: Restringir comentários

source: Enabled
es: Activado
pt: Ativado

source: Schedule publication
es: Programar publicación
pt: Agendar publicação

source: Select date
es: Seleccione la fecha
pt: Selecione a data

source: Time
es: Horario
pt: Horário

source: Date
es: Fecha
pt: Data

# hourH
source: Time
es: Hora
pt: Hora

source: Clear selection
es: Borrar selección
pt: Limpar seleção

source: Clear scheduling data?
es: ¿Desea borrar los datos de programación?
pt: Deseja limpar dados de agendamento?

# confirmingInformationFilledAboutPublicationScheduleWillUndone
source: By confirming this, the information you filled in about the publication's schedule will be undone.
es: Si confirma, se cancelará la información rellenada sobre la programación de la publicación.
pt: Caso você confirme, as informações preenchidas de agendamento da publicação serão desfeitas.

source: Publication location
es: Lugar de publicación
pt: Local da publicação

source: Public
es: Público
pt: Público

# selectGroup
source: Select a group
es: Seleccionar un grupo
pt: Selecione um grupo

source: Personal profile
es: Perfil personal
pt: Perfil pessoal

source: Corporate profiles
es: Perfiles corporativos
pt: Perfis corporativos

source: Corporate profile
es: Perfil corporativo
pt: Perfil corporativo

# inPlace
source: in {inPlace}
es: en {inPlace}
pt: em {inPlace}

source: Done
es: Terminado
pt: Concluído

source: Disabled
es: Desactivado
pt: Desativado

# publicationCompletedMessage
source: Successful publication completed!
es: ¡Publicación exitosa completada!
pt: Publicação realizada com sucesso!

# publicationErroMessage
source: An error occurred while publishing. Tap Retry to try again.
es: Se produjo un error al publicar. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao publicar. Toque em Repetir para tentar novamente

# tryAgainSubtitleDescription
source: Wait a few moments and to retry this action, tap Try Again.
es: Aguarde un rato y para repetir esta acción, pulse sobre Reintentar.
pt: Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# errorStateSearchSocialGroup
source: Error when trying to search for groups for publishing.
es: Ha ocurrido un error al intentar buscar grupos para publicar.
pt: Ocorreu um erro ao tentar buscar grupos para publicação.

# emptyStateSearchSocialGroup
source: No groups were found for publishing.
es: No se han encontrado grupos para publicar.
pt: Não foram encontrados grupos para publicação.

# errorStateSearchSocialProfile
source: Error when trying to search for profiles to publishing.
es: Ha ocurrido un error al intentar buscar perfiles para publicar.
pt: Ocorreu um erro ao tentar buscar perfis para publicação.

# emptyStateSearchSocialProfile
source: No profiles were found for publishing.
es: No se han encontrado perfiles para publicar.
pt: Não foram encontrados perfis para publicação.

# selfDeclaration
source: Self-declaration data
es: Datos de autodeclaración
pt: Dados de autodeclaração

# selfDeclarationExplanationTitle
source: Why is it important to provide this information?
es: ¿Por qué es importante facilitar estos datos?
pt: Por que é importante informar estes dados?

# selfDeclarationExplanation
source: As a company, we want to get to know our audience and the people who make up our organization better.
es: Como empresa, queremos conocer mejor a nuestro público y a las personas que forman parte de nuestra organización.
pt: Como empresa, queremos conhecer melhor nosso público e as pessoas que compõem nossa organização.

# selfDeclarationExplanationDataSafety
source: We guarantee that this data will only be accessed by HR and will not be shared with other employees.
es: Garantizamos que estos datos serán de acceso exclusivo para RH y no se compartirán con otros empleados.
pt: Garantimos que estes dados serão acessados exclusivamente pelo RH e não serão compartilhados com outros colaboradores.

# genderOrientation
source: Gender and sexual orientation
es: Género y orientación sexual
pt: Gênero e orientação sexual

# optionalQuestions
source: All questions are optional.
es: Todas las preguntas son opcionales.
pt: Todas as perguntas são opcionais.

# yourGenderIdentity
source: What is your gender identity?
es: ¿Cuál es su identidad de género?
pt: Qual a sua identidade de gênero?

# cisgender
source: Cisgender: identify with their birth gender.
es: Cisgénero: se identifica con su sexo de nacimiento.
pt: Cisgênero: identificam com o gênero de nascimento.

# transgender
source: Transgender: do not identify with their birth gender.
es: Transgénero: no se identifica con su sexo de nacimiento.
pt: Transgênero: não se identificam com o sexo de nascimento.

source: Learn more
es: Más información
pt: Saiba mais

source: Social Name
es: Nombre Social
pt: Nome Social

# notAnswer
source: I prefer not to answer
es: Prefiero no responder
pt: Prefiro não responder

# adoptedSocialName
source: Have you adopted a social name that is different from your civil registration name?
es: ¿Ha adoptado un nombre social diferente de su nombre de registro civil?
pt: Você adotou nome social que é diferente do seu nome do registro civil?

source: Self-description
es: Autodescripción
pt: Autodescrição

source: Self-describe
es: Autodescribir
pt: Autodescrever

# selfDeclarationError
source: We were unable to obtain the self-declaration data.
es: No fue posible obtener los datos de autodeclaración.
pt: Não foi possível obter os dados de autodeclaração.

# selfDeclarationErrorDescription
source: Wait a few moments and tap Try again to repeat this action.
es: Espere unos instantes y, para repetir esta acción, pulse Inténtelo de nuevo.
pt: Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# refugeBrazil
source: Refuge in Brazil
es: Refugio en Brasil
pt: Refúgio no Brasil

# youRefugeBrazil
source: Have you received refuge in Brazil?
es: ¿Recibió refugio en Brasil?
pt: Você recebeu refúgio no Brasil?

# yesRefugee
source: Yes. I am an asylum seeker or a refugee.
es: Sí. Soy solicitante de refugio o refugiado.
pt: Sim. Sou solicitante de refúgio ou sou refugiado

# sexualOrientationDescription
source: Sexual orientation refers to a person's patterns of emotional, romantic, and sexual attraction to others.
es: La orientación sexual se refiere a los patrones de atracción emocional, romántica y sexual de una persona hacia otras.
pt: A orientação sexual se refere aos padrões de atração emocional, romântica e sexual de uma pessoa em relação aos outros.

# asexualTitle
source: Asexual
pt: Assexual

# asexualDescription
source: Individuals who do not experience sexual attraction to others or have minimal sexual interest.
es: Individuo que no se siente atraído sexualmente por otras personas o que tiene un interés sexual mínimo.
pt: Indivíduos que não sentem atração sexual por outras pessoas ou têm um interesse sexual mínimo.

# bisexualTitle
source: Bisexual
pt: Bissexual

# bisexualDescription
source: People who are attracted to more than one gender.
es: Personas que se sienten atraídas por más de un género.
pt: Pessoas que sentem atração por mais de um gênero.

# heterosexualTitle
source: Heterosexual
pt: Heterossexual

# heterosexualDescription
source: People who are sexually attracted to a different gender from their own.
es: Personas que se sienten atraídas sexualmente por un género distinto al suyo.
pt: Pessoas que sentem atração sexual por um gênero diferente do seu próprio.

# pansexualDescription
source: People who are attracted to others regardless of their sex or gender identity, including all genders.
es: Personas que se sienten atraídas por otras independientemente de su sexo o identidad de género, incluidos todos los géneros.
pt: Pessoas que sentem atração por outras, independentemente de seu sexo ou identidade de gênero, incluindo todos os gêneros.
