Repository: felipeduarte26/waapi-flutter-module
Catalog: lib/app/core/localization/l10n/lang_*.arb
Languages: es, pt

# errorMarkNotificationAsRead
source: An error occurred while marking your notification as read. Tap Repeat to try again.
es: Ocurrió un error al marcar su notificación como leída. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao marcar sua notificação como lida. Toque em Repetir para tentar novamente.

# confirmClearNotificationsTitle
source: Do you really want to clear your notifications?
es: ¿Desea realmente limpiar?
pt: Deseja realmente limpar?

# confirmClearNotificationsDescription
source: By performing this operation, all your notifications will be deleted. This action cannot be undone.
es: Al realizar esta operación, todas sus notificaciones serán eliminadas. Esta acción no podrá ser deshecha.
pt: Ao realizar esta operação, todas as suas notificações serão apagadas. Esta ação não poderá ser desfeita.

source: Clear
es: Limpiar
pt: Limpar

source: Clear notifications
es: Limpiar notificaciones
pt: Limpar notificações

source: Latest notifications
es: Últimas notificaciones
pt: Últimas notificações

source: Rate this feedback:
es: Clasifique esta retroalimentación:
pt: Classifique este feedback:

# alertActivateNotificationsTitle
source: Enable app notifications
es: Active las notificaciones de la aplicación
pt: Ative as notificações do aplicativo

# alertActivateNotificationsDescription
source: With notifications enabled, you will always be notified of your daily actions.
es: Con las notificaciones activadas, usted será siempre avisado sobre sus acciones diárias.
pt: Com as notificações ativadas, você será sempre avisado sobre suas ações diárias.

# stepOneEnableNotificationsAndroid
source: 1. Access your phone's settings.
es: 1. Acceda a las configuraciones de su teléfono móvil.
pt: 1. Acesse as configurações do seu celular.

# stepTwoEnableNotificationsAndroid
source: 2. Go to the settings tab.
es: 2. Vá para la guía de configuraciones.
pt: 2. Vá para a aba de configurações.

# stepThreeEnableNotificationsAndroid
source: 3. Turn on app notifications.
es: 3. Active las notificaciones de la aplicación.
pt: 3. Ative as notificações do aplicativo.

# stepOneEnableNotificationsIOS
source: 1. Access the Settings app.
es: 1. Acceda a la aplicación Configuraciones.
pt: 1. Acesse o aplicativo Ajustes.

# stepTwoEnableNotificationsIOS
source: 2. Tap Notifications.
es: 2. Toque en notificaciones.
pt: 2. Toque em notificações.

# stepThreeEnableNotificationsIOS
source: 3. Enable the Allow Notifications option.
es: 3. Active la opción Permitir Notificaciones.
pt: 3. Ative a opção Permitir Notificações.

# openSettingsAndroid
source: Open Settings
es: Abrir las Configuraciones
pt: Abrir as Configurações

# openSettingsIOS
source: Open Settings
es: Abrir os Ajustes
pt: Abrir os Ajustes

source: Not now
es: Ahora no
pt: Agora não

# descriptionEnableNotifications
source: Push notifications are disabled on your device's operating system. To enable them, open System Settings.
es: Las notificaciones por push están desactivadas en el Sistema Operacional de su aparato, para activarlas, abra las Configuraciones del sistema.
pt: As notificações por push estão desativadas no Sistema Operacional do seu dispositivo, para ativá-las, abra as Configurações do Sistema.

# errorOpenSettings
source: An error occurred while opening System Settings. Please try again later.
es: Ocurrió un error al abrir las Configuraciones del sistema. Por favor, intente nuevamente más tarde.
pt: Ocorreu um erro ao abrir as Configurações do Sistema. Por favor, tente novamente mais tarde.

# errorGetProfile
source: An error occurred while obtaining your employment contract information. Tap Repeat to try again.
es: Ocurrió un error al obtener las informaciones de su perfil. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao obter as informações do seu perfil. Toque em Repetir para tentar novamente.

# errorGetContractEmployee
source: Could not find your employment contract information
es: No ha sido posible obtener informaciones sobre su contrato
pt: Não foi possível obter as informações do seu contrato de trabalho

# errorGetContractEmployeeDescription
source: Unable to obtain your employment contract information because the system presented an internal error. Tap Try Again. If you want to sign off the application, tap Exit.
es: El sistema presentó un error interno y, por eso, no ha sido posible obtener informaciones de su contrato. Pulse Reintentar. Si desea desconectarse de la aplicación, pulse Cerrar Sesión.
pt: O sistema apresentou um erro interno e, por isso, não foi possível obter as informações do seu contrato de trabalho. Toque em Tentar novamente. Se quiser se desconectar do aplicativo, toque em Sair.

# profilePersonal
source: Personal
pt: Pessoal

# profileContractual
source: Contractual
pt: Contratual

# phones
source: Phone numbers
es: Teléfonos
pt: Telefones

# phone
source: Phone number
es: Teléfono
pt: Telefone

# emails
source: Email addresses
es: E-mails
pt: E-mails

source: Social networks
es: Redes sociales
pt: Redes sociais

source: Emergency contacts
es: Contactos de emergencia
pt: Contatos de emergência

source: Personal address
es: Dirección personal
pt: Endereço pessoal

source: Personal documents
es: Documentos personales
pt: Documentos pessoais

# profileEmploymentContract
source: Employment contract
es: Contracto de trabajo
pt: Contrato de trabalho

# profileEmployerInformation
source: Employer information
es: Informaciones de la empleadora
pt: Informações da empregadora

# profileSalaryInformation
source: Salary information
es: Informaciones salariales
pt: Informações salariais

# profileBankInformation
source: Bank account information
es: Informaciones bancarias
pt: Informações bancárias

# shortcutMyProfile
source: Profile
es: Perfil
pt: Perfil

# infoTypeOfPersonal
source: Personal
pt: Pessoal

# infoTypeOfProfessional
source: Professional
es: Profesional
pt: Profissional

# errorOnUpdateProfile
source: An error occurred while updating your profile information and some data may be out of date. Tap Repeat to try again.
es: Ocurrió un error al actualizar las informaciones de su perfil y algunos datos pueden estar desactualizados. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao atualizar as informações do seu perfil e alguns dados podem estar desatualizados. Toque em Repetir para tentar novamente.

source: Female
es: Femenino
pt: Feminino

source: Male
es: Masculino
pt: Masculino

source: Adopted child
es: Hija(o) adotiva(o)
pt: Filho(a) adotivo(a)

source: Children
es: Hija(o)
pt: Filho(a)

source: Concubine
es: Concubina(o)
pt: Concubino(a)

source: Ex-Spouse
es: Ex-Cónyuge
pt: Ex-Cônjuge

# exPartner
source: Former partner
es: Ex-Pareja
pt: Ex-Companheiro(a)

source: Grandparent
es: Abuela(o)
pt: Avô/Avó

source: Grandchild
es: Nieta(o)
pt: Neto(a)

source: Great-grandparent
es: Bisabuela(o)
pt: Bisavô/Bisavó

source: Great-grandchild
es: Bisnieta(o)
pt: Bisneto(a)

# guardianship
source: Minor under custody
es: Menor bajo Guardia
pt: Menor sob Guarda

source: Nephew/Niece
es: Sobrina(o)
pt: Sobrinho(a)

source: Father/Mother
es: Madre/Padre
pt: Pai/Mãe

source: Partner
es: Compañera(o)
pt: Companheiro(a)

source: Pensioner
es: Pensionista
pt: Pensionista

source: Brother/Sister
es: Irmã(o)
pt: Irmão(ã)

# sonDaughterInLaw
source: Son-in-law/Daughter-in-law
es: Yerno/Nuera
pt: Genro/Nora

source: Spouse
es: Cónyuge
pt: Cônjuge

source: Stepfather
es: Padrastro
pt: Padrasto

source: Stepmother
es: Madrastra
pt: Madrasta

source: Step-children
es: Hijastra(o)
pt: Enteado(a)

source: Guardian
es: Confiada(o)
pt: Confiado(a)

source: Uncle/Aunt
es: Tío/Tía
pt: Tio/Tia

source: Others
es: Otra(o)
pt: Outro(a)

source: Other
es: Otro
pt: Outro

# errorGetTokenFirebase
source: An error occurred while getting your device identifiers when registering push notifications. Please contact the Senior Sistemas support for further information.
es: Ocorrió un error al obtener los identificadores de su aparato al realizar el registro de las notificaciones por push. Contacte el suporte de Senior Sistemas para más informaciones.
pt: Ocorreu um erro ao obter os identificadores do seu dispositivo ao efetuar o registro das notificações por push. Entre em contato com o suporte da Senior Sistemas para maiores informações.

# typePhonePersonal
source: Personal/Residential
es: Personal/Residencial
pt: Pessoal/Residencial

# typePhoneProfessional
source: Office/Professional
es: Comercial/Profesional
pt: Comercial/Profissional

# typePhoneCell
source: Cell phone
es: Teléfono móvil
pt: Celular

# typePhoneProfessionalFaxNumber
source: Office/Professional fax number
es: Fax Comercial/Profesional
pt: Fax Comercial/Profissional

# operator
source: Carrier
es: Operadora
pt: Operadora

source: Extension
es: Extensión
pt: Ramal

source: Contract situation
es: Situación del contrato
pt: Situação do contrato

source: Contract type
es: Tipo de contrato
pt: Tipo de contrato

source: Reason
es: Razón
pt: Razão

source: Expected end date
es: Previsión de término
pt: Previsão de término

source: Admission date
es: Fecha de admisión
pt: Data de admissão

source: Register
es: Registro
pt: Cadastro

source: Register form
es: Ficha de registro
pt: Ficha de registro

source: Temporary stability
es: Estabilidad provisional
pt: Estabilidade provisória

source: Stability end date
es: Fecha del fin de la estabilidad
pt: Data do fim da estabilidade

source: Job
es: Cargo
pt: Cargo

# cboJobCode
source: CBO (Brazilian Classification of Occupations) job code
es: Código del CBO del cargo
pt: Código do CBO do cargo

source: Department
es: Departamento
pt: Departamento

source: Cost center
es: Centro de costo
pt: Centro de custo

source: Work schedule
es: Turno de trabajo
pt: Escala de trabalho

source: Employment relationship
es: Relación de trabajo
pt: Vínculo empregatício

source: Job position
es: Puesto de trabajo
pt: Posto de trabalho

source: Address
es: Dirección
pt: Endereço

source: Urban worker related to a legal entity employer by work contract governed by CLT with undetermined term
es: Trabajador urbano vinculado a empleador persona jurídica por contrato de trabajo regido por la CLT* (Consolidación de Leyes de Trabajo) por plazo indeterminado
pt: Trabalhador urbano vinculado a empregador pessoa jurídica por contrato de trabalho regido pela CLT por prazo indeterminado

source: Urban worker related to a natural person employer by work contract governed by CLT with undetermined term
es: Trabajador urbano vinculado a empleador persona física por contrato de trabajo regido por la CLT* por plazo indeterminado
pt: Trabalhador urbano vinculado a empregador pessoa física por contrato de trabalho regido pela CLT por prazo indeterminado

source: Rural worker related to a legal entity employer by work contract governed by Brazilian Law 5,889 from 1973 for an undetermined term
es: Trabajador rural vinculado a empleador persona jurídica por contrato de trabajo regido por la ley nº 5889 de 1973 por plazo indeterminado
pt: Trabalhador rural vinculado a empregador pessoa jurídica por contrato de trabalho regido pela lei nº 5889 de 1973 por prazo indeterminado

source: Rural worker related to a natural person employer by work contract governed by Brazilian Law 5,889 from 1973 for an undetermined term
es: Trabajador rural vinculado a empleador persona física por contrato de trabajo regido por la ley nº 5889 de 1973 por plazo indeterminado
pt: Trabalhador rural vinculado a empregador pessoa física por contrato de trabalho regido pela lei nº 5889 de 1973 por prazo indeterminado

source: Servant governed by unique legal regime and military related to self-owned regime of social security
es: Servidor regido por el régimen jurídico único y militar vinculado a régimen propio de previsión
pt: Servidor regido pelo regime jurídico único e militar vinculado a regime próprio de previdência

source: Servant governed by unique legal regime and military related to the general regime of social security
es: Servidor regido por el régimen jurídico único y militar vinculado al régimen general de previsión social
pt: Servidor regido pelo regime jurídico único e militar vinculado ao regime geral de previdência social

source: Public servant not effective that can be fired ad nutum or hired via special legislation not governed by CLT
es: Servidor público no efectivo que puede ser echado ad nutum o admitido por medio de legislación especial no regido por la CLT (Consolidación de leyes de Trabajo)
pt: Servidor público não efetivo demissível ad nutum ou admitido por meio de legislação especial não regido pela CLT

source: Temporary worker with work managed by the category union or by the management body of work to whom the FGTS collection must be made for
es: Trabajador independiente trabajo administrado por el sindicato de la categoría o por el órgano gestor de mano de obra para el cual y debido deposito de FP
pt: Trabalhador avulso trabalho administrado pelo sindicato da categoria ou pelo órgão gestor de mão de obra para o qual e devido deposito de FGTS

source: Domestic worker
es: Trabajador doméstico
pt: Trabalhador doméstico

source: Temporary worker governed by Brazilian Law 6,019 from January 3rd, 1974
es: Trabajador temporal regido por la ley nº 6019 de 3 de enero de 1974
pt: Trabalhador temporario regido pela lei nº 6019 de 3 de janeiro de 1974

source: Apprentice hired under the terms of article 428 of CLT regularized by decree 5,598 from December 1st, 2005
es: Aprendiz contratado en los términos del art 428 de la CLT* regulado por el decreto nº 5598 de 1 de diciembre de 2005
pt: Aprendiz contratado nos termos do art 428 da CLT regulamentado pelo decreto nº 5598 de 1 de dezembro de 2005

source: Urban worker related to legal entity employer by work contract governed by CLT with fixed-term contract or work
es: Trabajador urbano vinculado a empleador persona jurídica por contrato de trabajo regido por la CLT* por tiempo determinado o obra correcta
pt: Trabalhador urbano vinculado a empregador pessoa jurídica por contrato de trabalho regido pela CLT por tempo determinado ou obra certa

source: Urban worker related to a natural person employer by an employment contract governed by the CLT with fixed duration contract or work
es: Trabajador urbano vinculado a empleador persona física por contrato de trabajo regido por la CLT* por plazo determinado o obra correcta
pt: Trabalhador urbano vinculado a empregador pessoa física por contrato de trabalho regido pela CLT por prazo determinado ou obra certa

source: Rural worker related to a legal entity employer by an employment contract governed by Brazilian Law 5,889/73 for a fixed term
es: Trabajador rural vinculado a empleador persona jurídica por contrato de trabajo regido por la ley nº 5889 de 1973 por plazo determinado
pt: Trabalhador rural vinculado a empregador pessoa jurídica por contrato de trabalho regido pela lei nº 5889 de 1973 por prazo determinado

source: Rural worker related to a natural person employer by an employment contract governed by Brazilian Law 5.889/73 with undetermined term
es: Trabajador rural vinculado a empleador persona física por contrato de trabajo regido por la ley nº 5889 de 1973 por plazo determinado
pt: Trabalhador rural vinculado a empregador pessoa física por contrato de trabalho regido pela lei nº 5889 de 1973 por prazo determinado

source: Director without employment relationship for whom the company or entity opted for the collection of FGTS or union leader
es: Director sin vínculo laboral para el cual la empresa o entidad tenga optado por recaudación al FP o dirigente sindical
pt: Diretor sem vínculo empregatício para o qual a empresa ou entidade tenha optado por recolhimento ao FGTS ou dirigente sindical

source: Employment contract with fixed duration governed by Brazilian Law number 9,601 from January 21st, 1998
es: Contrato de trabajo por plazo determinado regido por la ley nº 9601 de 21 de enero de 1998
pt: Contrato de trabalho por prazo determinado regido pela lei nº 9601 de 21 de janeiro de 1998

source: Fixed-term employment contract governed by Brazilian Law 8,745 from Dec. 9th, 1993 with wording given by Br. Law 9,849 from Oct. 26th, 1999
es: Contrato de trabajo por tiempo determinado regido por ley n° 8745 de 9 de diciembre 1993 con la redacción dada por la ley nº 9849 de 26 de octubre de 1999
pt: Contrato de trabalho por tempo determinado regido pela lei n 8745 de 9 de dezembro 1993 com a redação dada pela lei nº 9849 de 26 de outubro de 1999

source: Fixed-term employment contract governed by state law
es: Contrato de trabajo por plazo determinado regido por ley estatal
pt: Contrato de trabalho por prazo determinado regido por lei estadual

source: Fixed-term employment contract governed by municipal law
es: Contrato de trabajo por plazo determinado regido por ley municipal
pt: Contrato de trabalho por prazo determinado regido por lei municipal

source: Company corporate name
es: Razón social de la empresa
pt: Razão social da empresa

source: Company trade name
es: Nombre fantasía de la empresa
pt: Nome fantasia da empresa

source: Establishment type
es: Tipo de establecimiento
pt: Tipo de estabelecimento

source: National Register of Legal Entities
es: CNPJ (Registro de Persona Jurídica de Brasil)
pt: CNPJ

source: National Classification of Economic Activities
es: CNAE (Clasificación Nacional de Actividades Económicas)
pt: CNAE

source: Headquarters
es: Matriz
pt: Matriz

source: Branch
es: Sucursal
pt: Filial

# addressPatioType
source: Address type
es: Tipo de área
pt: Tipo de logradouro

# addressPatio
source: Address
es: Área
pt: Logradouro

source: Number
es: Número
pt: Número

# addressComplement
source: Complement
es: Complemento
pt: Complemento

# addressNeighborhood
source: Neighborhood
es: Barrio
pt: Bairro

# addressCity
source: City
es: Ciudad
pt: Cidade

# addressState
source: State
es: Estado
pt: Estado

# addressCountry
source: Country
es: País
pt: País

# addressZipCode
source: ZIP Code
es: Código Postal
pt: CEP

source: Airport
es: Aeropuerto
pt: Aeroporto

source: Promenade
es: Alameda
pt: Alameda

source: Area
es: Área
pt: Área

source: Avenue
es: Avenida
pt: Avenida

source: Resort
es: Balneario
pt: Balneário

source: Block
es: Bloque
pt: Bloco

source: Field
es: Campo
pt: Campo

source: Farmstead
es: Chacra
pt: Chácara

source: Colony
es: Colonia
pt: Colônia

source: Condominium
es: Condominio
pt: Condomínio

source: Set
es: Conjunto
pt: Conjunto

source: District
es: Distrito
pt: Distrito

source: Terrace
es: Explanada
pt: Esplanada

source: Station
es: Estación
pt: Estação

source: Road
es: Carretera
pt: Estrada

source: Slum
es: Suburbio
pt: Favela

source: Farm
es: Hacienda
pt: Fazenda

source: Market
es: Fiera
pt: Feira

source: Gallery
es: Galería
pt: Galeria

source: Grange
es: Granja
pt: Granja

source: Garden
es: Jardín
pt: Jardim

source: Slope
es: Ladera
pt: Ladeira

source: Lake
es: Lago
pt: Lago

source: Lagoon
es: Laguna
pt: Lagoa

source: Plaza
es: Largo
pt: Largo

source: Allotment
es: Loteo
pt: Loteamento

source: Hill
es: Morro
pt: Morro

source: Nucleus
es: Núcleo
pt: Núcleo

source: Park
es: Parque
pt: Parque

source: Footbridge
es: Pasarela
pt: Passarela

source: Courtyard
es: Patio
pt: Pátio

source: Square
es: Plaza
pt: Praça

source: Beach
es: Playa
pt: Praia

source: Quarter
es: Cuadra
pt: Quadra

source: Corner
es: Rincón
pt: Recanto

source: Residential Area
es: Residencial
pt: Residencial

source: Highway
es: Rodovía
pt: Rodovia

source: Street
es: Calle
pt: Rua

source: Sector
pt: Setor

source: Ranch
es: Lugar
pt: Sítio

source: Bystreet
es: Callejón
pt: Travessa

source: Passage
es: Trecho
pt: Trecho

source: Crossing
es: Rotonda
pt: Trevo

source: Valley
es: Valle
pt: Vale

source: Path
es: Vereda
pt: Vereda

source: Route
es: Vía
pt: Via

source: Viaduct
es: Viaducto
pt: Viaduto

source: Alleyway
es: Callejón
pt: Viela

source: Village
es: Villa
pt: Vila

source: Active
es: Activo
pt: Ativo

source: Absent
es: Alejado
pt: Afastado

source: Terminated
es: Encerrado
pt: Encerrado

# personalDataUpdateNotificationTitle
source: Personal information update
es: Actualización de datos personales
pt: Atualização de dados pessoais

# personalDataUpdateNotificationDescription
source: You may receive a push notification informing you that a change has occurred in the personal information of your register. This change may have been made by you or your company's human resources department.
es: Usted podrá recibir una notificación por push informando que ocurrió alguna alteración en los datos personales de su registro. Esta alteración puede haber sido realizada por usted o por el departamento de Recursos Humanos de su empresa.
pt: Você poderá receber uma notificação por push informando que ocorreu alguma alteração nos dados pessoais do seu cadastro. Esta alteração pode ter sido realizada por você ou pelo departamento de recursos humanos da sua empresa.

# contactsUpdateNotificationTitle
source: Contacts update
es: Actualización de contactos
pt: Atualização de contatos

# contactsUpdateNotificationDescription
source: You may receive a push notification informing you that a change has occurred in the contact data of your register, such as telephone numbers, emails and/or social networks. This change may have been made by you or your company's human resources department.
es: Usted podrá recibir una notificación por push informando que ocurrió alguna alteración en los datos personales de su registro, como teléfonos, e-mails y/o redes sociales. Esta alteración puede haber sido realizada por usted o por el departamento de Recursos Humanos de su empresa.
pt: Você poderá receber uma notificação por push informando que ocorreu alguma alteração nos dados de contato do seu cadastro, como telefones, e-mails e/ou redes sociais. Esta alteração pode ter sido realizada por você ou pelo departamento de recursos humanos da sua empresa.

# addressUpdateNotificationTitle
source: Addresses update
es: Actualización de dirección
pt: Atualização de endereço

# addressUpdateNotificationDescription
source: You may receive a push notification informing you that a change has occurred in the personal address of your register. This change may have been made by you or your company's human resources department.
es: Usted podrá recibir una notificación por push informando que ocurrió alguna alteración en los datos personales de su registro. Esta alteración puede haber sido realizada por usted o por el departamento de Recursos Humanos de su empresa.
pt: Você poderá receber uma notificação por push informando que ocorreu alguma alteração no endereço pessoal do seu cadastro. Esta alteração pode ter sido realizada por você ou pelo departamento de recursos humanos da sua empresa.

# documentsUpdateNotificationTitle
source: Documents update
es: Actualización de documentos
pt: Atualização de documentos

# documentsUpdateNotificationDescription
source: You may receive a push notification informing you that a change has occurred in any of the documents of your register. This change may have been made by you or your company's human resources department.
es: Usted podrá recibir una notificación por push informando que ocurrió alguna alteración en algún de los datos personales de su registro. Esta alteración puede haber sido realizada por usted o por el departamento de Recursos Humanos de su empresa.
pt: Você poderá receber uma notificação por push informando que ocorreu alguma alteração em algum dos documentos do seu cadastro. Esta alteração pode ter sido realizada por você ou pelo departamento de recursos humanos da sua empresa.

# vacationRequestApprovedNotificationTitle
source: Approved vacation request
es: Pedido de vacaciones aprobado
pt: Solicitação de férias aprovada
