Repository: felipeduarte26/waapi-flutter-module
Catalog: lib/app/core/localization/l10n/lang_*.arb
Languages: es, pt

# feedbackTitle
source: Feedback
es: Retroalimentación
pt: Feedbacks

# feedbackReceivedTab
source: Received
es: Recibidos
pt: Recebidos

# feedbackSentTab
source: Sent
es: Enviados
pt: Enviados

# feedbackRequestsTab
source: Requests
es: Solicitaciones
pt: Solicitações

source: Write feedback
es: Escribir retroalimentación
pt: Escrever feedback

source: Request feedback
es: Solicitar retroalimentación
pt: Solicitar feedback

# requestedFeedback
source: Feedback request
es: Solicitación de retroalimentación
pt: Solicitação de feedback

# employee
source: Worker
es: Colaborador(a)
pt: Colaborador

# welcomeMessage
source: Hello, {firstName}
es: ¡Hola!, {firstName}
pt: Olá, {firstName}

# descriptionRecentFeedback
source: View your most recent feedback
es: Confira sus últimas retroalimentaciones
pt: Confira seus feedbacks mais recentes

# textButtonCardFeedbackEmpty
source: Request feedback
es: Solicitar retroalimentación
pt: Solicitar feedback

# titleNotAllowToViewMyFeedbacks
source: You do not have access permission.
es: Usted no tiene permiso de acceso.
pt: Você não possui permissão de acesso.

# titleUnderDevelopment
source: Feature in development.
es: Recurso en desarrollo.
pt: Recurso em desenvolvimento.

# titleSettings
source: Settings
es: Configuraciones
pt: Configurações

# descriptionTileExitSettings
source: Sign Out
es: Salir
pt: Sair

# titleSettingsDialogExit
source: Are you sure you want to sign out?
es: ¿Desea realmente salir?
pt: Deseja realmente sair?

# descriptionSettingsDialogExit
source: Upon executing this action, you will be disconnected from the application.
es: Al realizar esta acción, usted será desconectado de la aplicación.
pt: Ao realizar esta ação você será desconectado do aplicativo.

# optionCancel
source: Cancel
es: Cancelar
pt: Cancelar

# optionExitDialogExit
source: Sign Out
es: Salir
pt: Sair

# managementPanelRecentFeedbackTextError
source: An error occurred while searching for your most recent feedback.
es: Ocurrió un error al buscar sus retroalimentaciones más recientes.
pt: Ocorreu um erro ao buscar seus feedbacks mais recentes.

# settingsLogoutErrorMessage
source: An error occurred while you were disconnecting from the application. Please try again.
es: Ocurrió un error al realizar su desconexión de la aplicación. Por favor, intente nuevamente.
pt: Ocorreu um erro ao realizar a sua desconexão do aplicativo. Por favor tente novamente.

# feedbackReceivedEmptyState
source: You have not received feedback yet.
es: Usted aún no recibió retroalimentaciones.
pt: Você ainda não recebeu feedbacks

# feedbackRequestsEmptyState
source: You have neither received any feedback nor sent feedback requests yet
es: Usted aún no ha recibido o enviado solicitudes de retroalimentación
pt: Você ainda não recebeu e nem enviou solicitações de feedback

# feedbackRequestsErrorState
source: Could not obtain your feedback requests
es: No ha sido posible obtener sus solicitudes de retroalimentación
pt: Não foi possível obter suas solicitações de feedback

# feedbackRequestsErrorStateDescription
source: Unable to recover your feedback requests because an internal system error has occurred. Wait a few moments and to retry this action, tap Try Again.
es: El sistema presentó un error interno y, por eso, no fue posible recuperar sus solicitudes de retroalimentación. Aguarde un rato y para repetir esta acción, pulse sobre Reintentar.
pt: O sistema apresentou um erro interno e, por isso, não foi possível recuperar suas solicitações de feedback. Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# feedbackSentErrorState
source: Could not obtain your sent feedbackindo
es: No ha sido posible obtener sus retroalimentaciones enviadas
pt: Não foi possível obter seus feedbacks enviados

# feedbackSentErrorStateDescription
source: Unable to recover your sent feedback because an internal system error has occurred. Wait a few moments and to retry this action, tap Try Again.
es: El sistema presentó un error interno y, por eso, no fue posible recuperar sus retroalimentaciónes enviadas. Aguarde un rato y para repetir esta acción, pulse sobre Reintentar.
pt: O sistema apresentou um erro interno e, por isso, não foi possível recuperar seus feedbacks enviados. Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# feedbackReceivedErrorState
source: Could not obtain your received feedback
es: No ha sido posible obtener sus retroalimentaciones recibidas
pt: Não foi possível obter seus feedbacks recebidos

# feedbackReceivedErrorStateDescription
source: Unable to recover your received feedback because an internal system error has occurred. Wait a few moments and to retry this action, tap Try Again.
es: El sistema presentó un error interno y, por eso, no ha sido posible recuperar sus retroalimentaciónes recibidas. Aguarde un rato y para repetir esta acción, pulse sobre Reintentar.
pt: O sistema apresentou um erro interno e, por isso, não foi possível recuperar seus feedbacks recebidos. Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# errorDetailsRequestFeedbackState
source: An error occurred while obtaining the feedback request information. Tap Repeat to try again.
es: Ocurrió un error al recibir las informaciones de solicitación de retroalimentación. Toque en Repetir para intentar nuevamente.
pt: O sistema apresentou um erro interno e, por isso, não foi possível recuperar suas solicitações de feedback. Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# feedbackInvitationToSendFeedback
source: Don't miss the opportunity and take the first step yourself!
es: ¡No pierda la oportunidad y dé usted el primero paso!
pt: Não perca a oportunidade e dê você o primeiro passo!

# feedbackInvitationToRequestFeedback
source: Would you like to request feedback from someone?
es: ¿Te gustaria solicitar para alguien?
pt: Gostaria de solicitar para alguém?

# genericErrorAndTryAgain
source: Oops, something went wrong. Please try again.
es: ¡Oops! Algo está mal. Por favor, intente nuevamente.
pt: Oops, algo deu errado. Por favor tente novamente.

# feedbackLoadingMoreReceivedFeedbacksError
source: An error occurred while trying to find more received feedback. Tap Repeat to try again.
es: Ocurrió un error al intentar buscar más retroalimentaciones recibidas. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar buscar mais feedbacks recebidos. Toque em Repetir para tentar novamente.

# feedbackLoadingMoreSentFeedbacksError
source: An error occurred while trying to find more sent feedback. Tap Repeat to try again.
es: Ocorrió un error al intentar buscar más retroalimentaciones enviadas. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar buscar mais feedbacks enviados. Toque em Repetir para tentar novamente.

# feedbackSentEmptyState
source: You have not sent any feedback yet.
es: Usted aún no envió retroalimentaciones.
pt: Você ainda não enviou feedbacks.

# feedbackInvitationToSendFeedbackNow
source: How about giving some feedback now?
es: ¿Quieres escribir una retroalimentación ahora?
pt: Que tal escrever um feedback agora?

source: Sent
es: Enviada
pt: Enviada

source: Handled
es: Atendida
pt: Atendida

source: Waiting
es: Aguardando
pt: Aguardando

source: Sent to
es: Enviada para
pt: Enviada para

source: Received from
es: Recibida de
pt: Recebida de

source: Feedback submitted
es: Retroalimentación enviada
pt: Feedback enviado

# errorDeleteFeedback
source: An error occurred while deleting feedback.
es: Ocurrió un error al eliminar la retroalimentación.
pt: Ocorreu um erro ao excluir feedback.

# feedbackDeleted
source: Feedback deleted successfully.
es: ¡Retroalimentación eliminada con éxito!
pt: Feedback excluído com sucesso.

source: Delete
es: Eliminar
pt: Excluir

source: View attachments
es: Ver anexos
pt: Ver anexos

# feedbackVisibilityEvaluator
source: This feedback is only visible to you
es: Esta retroalimentación está visible solamente para usted
pt: Esse feedback está visível somente para você

# feedbackVisibilityLeader
source: Sent to manager only
es: Enviada solamente para la persona gestora
pt: Enviado somente para o gestor

# feedbackVisibilityEmployee
source: Sent to both worker and manager
es: Enviada para colaborador(a) y gestor(a)
pt: Enviado para o colaborador e o gestor

# feedbackVisibilityOnlyEmployee
source: Sent to worker only
es: Enviada solamente para la persona colaboradora
pt: Enviado somente para o colaborador

source: Feedback attachments
es: Anexos de la retroalimentación
pt: Anexos do feedback

# errorDownloadAttachment
source: An error occurred while downloading the file. Please try again later.
es: Ocurrió un error al descargar el archivo. Por favor, intente nuevamente después.
pt: Ocorreu um erro ao baixar o arquivo. Por favor, tente novamente mais tarde.

# skills
source: Competences
es: Competencias
pt: Competências

source: Select skills
es: Seleccionar competencias
pt: Selecionar competências

# selectSkillsToFeedback
source: Select one or more skills to associate with the feedback.
es: Seleccione una o más competencias para asociar a la retroalimentación.
pt: Selecione uma ou mais competências para associar ao feedback.

# searchAndSelectSkillsToFeedback
source: Competence search and selection
es: Búsqueda y selección de competencias
pt: Busca e seleção de competências

# clearSearchToSeeAllItems
source: Clear the search to view all items.
es: Limpie la búsqueda para ver todos los ítems.
pt: Limpe a busca para ver todos os itens.

# writeFeedbackSearchEmployeeIntro
source: Coworker search
es: Búsqueda de empleados
pt: Busca de colegas de trabalho

# writeFeedbackSearchEmployee
source: Search for coworkers for whom you want to send the feedback
es: Busque a los compañeros de trabajo a los que desea enviar una retroalimentación
pt: Busque colegas de trabalho para quem deseja enviar o feedback

# writeFeedbackSearchEmployeeDescription
source: Find coworkers by typing the name or surname
es: Encuentre a sus compañeros de trabajo introduciendo el nombre o apellido.
pt: Encontre colegas de trabalho digitando o nome ou sobrenome.

# writeSelectEmployeeDescription
source: Select the coworker who you want to send feedback to
es: Seleccione la persona para quién desea enviar la retroalimentación.
pt: Selecione o colega para quem deseja enviar o feedback.

# searchEmployeeTextFieldHint
source: Type at least three letters.
es: Introduzca al menos tres letras.
pt: Digite pelo menos três letras.

# searchEmployeeErrorText
source: An error occurred while trying to find the coworker defined in the search. Tap Repeat to try again.
es: Ocurrió un error al intentar buscar a la persona informada en la búsqueda. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar buscar o colega informado na busca. Toque em Repetir para tentar novamente.

# writeFeedbackSelectEmployeeErrorText
source: An error occurred while trying to find the coworker to write the feedback. Tap Repeat to try again.
es: Ocurrió un error al intentar seleccionar a la persona para escribir una retroalimentación. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar selecionar o colega para escrever o feedback. Toque em Repetir para tentar novamente.

source: Coworker
es: Colega
pt: Colega

source: Feedback request
es: Solicitación de retroalimentación
pt: Solicitação de feedback

# feedbackShare
source: Share
es: Compartir
pt: Compartilhar

# feedbackReopen
source: Retribute
es: Retribuir
pt: Retribuir

# feedbackPublic
source: Public
es: Público
pt: Público

# feedbackPrivate
source: Private
es: Privado
pt: Privado

source: Feedback Received
es: Retroalimentación recebida
pt: Feedback recebido

# titleNotifications
source: Notifications
es: Notificaciones
pt: Notificações

# notificationErrorState
source: Could not obtain your notifications
es: No ha sido posible obtener sus notificaciones
pt: Não foi possível obter suas notificações

# notificationErrorStateDescription
source: Unable to recover your notifications because an internal system error has occurred. Wait a few moments and to retry this action, tap Try Again.
es: El sistema presentó un error interno y, por eso, no ha sido posible recuperar sus notificaciones. Aguarde un rato y para repetir esta acción, pulse sobre Reintentar.
pt: O sistema apresentou um erro interno e, por isso, não foi possível recuperar suas notificações. Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# errorPermissionStorage
source: The permissions to save files on your device must be accepted in order to perform this action.
es: Para realizar esta acción, es necesario aceptar los permisos de grabar archivos en su aparato.
pt: Para realizar essa ação, é necessário aceitar as permissões de salvar arquivos em seu dispositivo.

# confirmDeleteFeedback
source: Do you want to delete the feedback?
es: ¿Desea eliminar la retroalimentación?
pt: Deseja excluir o feedback?

# deleteFeedbackAlert
source: By performing this action, the submitted feedback will be deleted. This action cannot be undone.
es: Al realizar esta acción, la retroalimentación enviada será eliminada y esta acción no podrá ser deshecha.
pt: Ao realizar esta ação, o feedback enviado será excluído e esta ação não poderá ser desfeita.

source: Send
es: Enviar
pt: Enviar

# errorSearchingSkills
source: An error occurred while trying to find the competences. Tap Repeat to try again.
es: Ocurrió un error al intentar buscar las competencias. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar buscar as competências. Toque em Repetir para tentar novamente.

# errorShareFeedback
source: An error occurred while sharing the feedback.
es: Ocurrió un error al compartir la retroalimentación.
pt: Ocorreu um erro ao compartilhar o feedback.

# findCoworker
source: Select coworker
es: Seleccionar colega
pt: Selecionar colega

# requestMessageLabel
source: Request message
es: Mensaje de la solicitación
pt: Mensagem da solicitação

# requestMessageHint
source: Example: Hi João! I would like your insights into my last week presentation.
es: Ejemplo: ¡Hola, João! Me gustaria saber de su percepción sobre mi presentación de la semana pasada.
pt: Exemplo: Olá João, gostaria da sua percepção sobre a minha apresentação da semana passada.

source: Send request
es: Enviar solicitación
pt: Enviar solicitação

source: Requesting feedback from
es: Solicitando retroalimentación de
pt: Solicitando feedback de

source: Sending feedback to
es: Enviando retroalimentación para
pt: Enviando feedback para

# genericError
source: Something went wrong...
es: Algo está mal...
pt: Algo deu errado...

# errorRequestFeedbackDescription
source: Something went wrong while sending the request, check your internet connection and try again.
es: Algo está mal en el envío de la solicitación, confiera la conexión con la Internet y intente nuevamente.
pt: Algo deu errado no envio da solicitação, confira a conexão com a internet e tente novamente.

# errorSendFeedbackDescription
source: Something went wrong while sending the feedback, check your internet connection and try again.
es: Algo está mal en el envío de la retroalimentación, confiera la conexión con la Internet y intente nuevamente.
pt: Algo deu errado no envio do feedback, confira a conexão com a internet e tente novamente.

# successRequest
source: Request sent
es: Solicitación enviada
pt: Solicitação enviada

# withSuccess
source: successfully
es: con éxito
pt: com sucesso

# selectEmployeeDescription
source: Select the coworker who you want to send the request to.
es: Seleccione la persona para quién desea enviar la solicitación.
pt: Selecione o colega para quem deseja enviar a solicitação.

# requestFeedbackSearchEmployee
source: Search for coworkers for whom you want to send the feedback request
es: Busque a los compañeros de trabajo a los que desea enviar la solicitud de retroalimentación
pt: Busque colegas de trabalho para quem deseja enviar a solicitação de feedback

# requestFeedbackSearchEmployeeDescription
source: Find coworkers by typing the name or surname
es: Encuentre a sus compañeros de trabajo introduciendo el nombre o apellido.
pt: Encontre colegas de trabalho digitando o nome ou sobrenome.

# whatDoYouHaveToSayTitle
source: What do you have to say?
es: ¿Qué tienes a decir?
pt: O que você tem a dizer?

# feedBackMessageLabel
source: Feedback message
es: Mensaje de la retroalimentación
pt: Mensagem do feedback

# feedBackMessageExample
source: Example: James Wilson has shown good communication
es: Ejemplo: Thiago Andrade tiene mostrado buena comunicación
pt: Exemplo: Thiago Andrade tem demonstrado boa comunicação

# selectSharingLabel
source: Sharing
es: Intercambibo
pt: Compartilhamento

# selectSharingSubtitle
source: Select the people with whom the feedback will be shared.
es: Seleccione con quién la retroalimentación será compartida.
pt: Selecione com quem o feedback será compartilhado.

# sendFeedBackTextButton
source: Send feedback
es: Enviar retroalimentación
pt: Enviar feedback

# characters
source: characters remaining
es: caracteres restantes
pt: caracteres restantes

# feedbackVisibilityDropDownEvaluator
source: Only to you
es: Solamente para usted
pt: Somente para você

# feedbackVisibilityDropDownLeader
source: Manager only
es: Solamente el(la) gestor(a)
pt: Somente gestor

# feedbackVisibilityDropDownEmployee
source: Worker and manager
es: Colaborador(a) y gestor(a)
pt: Colaborador e gestor

# feedbackVisibilityDropDownOnlyEmployee
source: Worker only
es: Solamente colaborador(a)
pt: Somente colaborador

source: Version
es: Versión
pt: Versão

# errorToOpenFormWriteFeedback
source: An error occurred while opening the feedback writing form. Please try again later.
es: Ocurrió un error al abrir el formulario de escritura de la retroalimentación. Intente nuevamente más tarde.
pt: Ocorreu um erro ao abrir o formulário de escrita de feedback. Tente novamente mais tarde.

source: Help
es: Ayuda
pt: Ajuda

# helpErrorMessage
source: An error occurred while loading the application help. Please try again later.
es: Ocurrió un error al cargar la ayuda de la aplicación. Intente nuevamente más tarde.
pt: Ocorreu um erro ao carregar a ajuda do aplicativo. Tente novamente mais tarde.

# feedbackConsentMessage
source: Upon sending this feedback, you agree that your full name, profile photo and feedback text may be shared by the coworker who will receive it.
es: Al enviar esta retroalimentación, usted concorda que su nombre completo, foto de perfil y el texto de la retroalimentación pueden ser compartidos por la persona colega que o recibirá.
pt: Ao enviar este feedback, você concorda que seu nome completo, foto de perfil e o texto do feedback podem ser compartilhados pelo(a) colega que o receberá.

source: Select
es: Seleccionar
pt: Selecionar

source: Repeat
es: Repetir
pt: Repetir

# errorRegisterNotification
source: An error occurred while registering notifications. Tap Repeat to try again.
es: Ocurrió un error al registrar las notificaciones. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao registrar as notificações. Toque em Repetir para tentar novamente.

# errorToGetReceivedFeedback
source: An error occurred while getting the feedback information received. Tap Repeat to try again.
es: Ocurrió un error al obtener las informaciones de la retroalimentación recebida. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao obter as informações do feedback recebido. Toque em Repetir para tentar novamente.

# errorToGetSentFeedback
source: An error occurred while getting the submitted feedback information received. Tap Repeat to try again.
es: Ocurrió un error al obtener las informaciones de la retroalimentación enviada. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao obter as informações do feedback enviado. Toque em Repetir para tentar novamente.

# requestNotification
source: Do you want to receive notifications?
es: ¿Desea recibir notificaciones?
pt: Deseja receber notificações?

# requestNotificationDescription
source: Notifications can include alerts, sounds and warnings on the icons, which can be configured in the settings.
es: Las notificaciones pueden incluir alertas, sonidos y avisos en los íconos, los cuales pueden ser configurados en los ajustes.
pt: As notificações podem incluir alertas, sons e avisos nos ícones, os quais podem ser configurados nos ajustes.

source: Allow
es: Permitir
pt: Permitir

# notAllow
source: Do not allow
es: No permitir
pt: Não permitir

source: View
es: Ver
pt: Ver

# configNotifications
source: Set up push notifications
es: Configurar notificaciones por push
pt: Configurar notificações por push

# errorOnTogglingSettingNotification
source: An error occurred while configuring this notification type. Tap Repeat to try again.
es: Ocurrió un error en la configuración de este tipo de notificación. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro na configuração deste tipo de notificação, toque em Repetir para tentar novamente.

# feedbackReceivedDescription
source: You may receive a push notification that you have received feedback from a particular person.
es: Usted podrá recibir una notificación por push informando que recibió una retroalimentación de una determinada persona.
pt: Você poderá receber uma notificação por push informando que recebeu um feedback de uma determinada pessoa.

# feedbackRequestedDescription
source: You may receive a push notification that there is a new feedback request.
es: Usted podrá recibir una notificación por push informando que hay una nueva solicitación de retroalimentación.
pt: Você poderá receber uma notificação por push informando que há uma nova solicitação de feedback.

# disableNotificationMessage
source: Configuration changed successfully. From now on, you will no longer receive push notifications of the type "{notificationType}".
es: ¡Configuración alterada con éxito! A partir de ahora usted no recibirá más notificaciones por push del tipo "{notificationType}".
pt: Configuração alterada com sucesso. A partir de agora você não receberá mais notificações por push do tipo "{notificationType}".

# enableNotificationMessage
source: Configuration changed successfully. From now on, you will receive push notifications of the type "{notificationType}".
es: ¡Configuración alterada con éxito! A partir de ahora usted recibirá notificaciones por push del tipo "{notificationType}".
pt: Configuração alterada com sucesso. A partir de agora você receberá notificações por push do tipo "{notificationType}".

# notificationNotReceivedTitle
source: You did not receive any notifications yet.
es: Usted aún no recibió notificaciones.
pt: Você ainda não recebeu notificações.

# notificationNotReceivedDescription
source: When you receive a notification, it will be available here for consultation.
es: Cuando recibes una notificación, estará disponible aquí para su consulta.
pt: Quando você receber uma notificação, ela ficará disponível aqui para consulta.

# notificationErrorNextPage
source: An error occurred while loading upcoming notifications. Tap Repeat and try again.
es: Ocurrió un error al cargar las próximas notificaciones. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao carregar as próximas notificações. Toque em Repetir para tentar novamente.

# notificationErrorClearNotifications
source: An error occurred while clearing your notifications. Tap Repeat and try again.
es: Ocurrió un error al limpiar sus notificaciones. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao limpar as suas notificações. Toque em Repetir para tentar novamente.
