Repository: felipeduarte26/waapi-flutter-module
Catalog: lib/app/core/localization/l10n/lang_*.arb
Languages: es, pt

# cancelRequestDialogTitle
source: Do you wish to cancel this request?
es: ¿Desea cancelar esta solicitud?
pt: Deseja cancelar esta solicitação?

# cancelRequestDialogSubtitle
source: After canceling the request, this action cannot be undone.
es: Al cancelar la solicitud, esta acción no se puede deshacer.
pt: Ao cancelar a solicitação, esta ação não poderá ser desfeita.

# wishToCancelThisRequest
source: Do you wish to cancel this request?
es: Desea caancelar esta solicitud?
pt: Deseja cancelar esta solicitação?

# cancelingTheRequestThisActionCannotBeUndone
source: After canceling the request, this action cannot be undone.
es: Al cancelar la solicitud, esta acción no se puede deshacer.
pt: Ao cancelar a solicitação, esta ação não poderá ser desfeita.

# approverMessage
source: Approver's message
es: Mensaje del aprobador
pt: Mensagem do aprovador

source: Send adjustments
es: Enviar ajustes
pt: Enviar ajustes

source: Cancel adjustment
es: Cancelar ajuste
pt: Cancelar ajustes

source: Adjust request
es: Ajustar requisición
pt: Ajustar solicitação

source: Fix request
es: Corregir requisición
pt: Corrigir solicitação

# maritalStatusSingle
source: Single
es: Soltero(a)
pt: Solteiro(a)

# maritalStatusMarried
source: Married
es: Casado(a)
pt: Casado(a)

# maritalStatusDivorced
source: Divorced
es: Divorciado(a)
pt: Divorciado(a)

# maritalStatusWidower
source: Widower/Widow
es: Viudo(a)
pt: Viúvo(a)

# maritalStatusSeparated
source: Separated
es: Separado(a)
pt: Separado(a)

# maritalStatusStableUnion
source: Stable union
es: Unión estable
pt: União estável

# raceBlack
source: Black
es: Negro
pt: Preta/Negra

# raceBrown
source: Brown
es: Pardo
pt: Parda

# raceIndian
source: Indigenous
es: Indígena
pt: Indígena

# raceYellow
source: Yellow (of Japanese, Chinese, Korean or similar origin)
es: Amarillo (de origen japonés, chino, etc.)
pt: Amarela (De origem Japonesa, Chinesa etc.)

# raceWhite
source: White
es: Blanca
pt: Branca

# raceNotInformed
source: Not defined
es: No informada
pt: Não informada

source: Date of Birth
es: Fecha de nacimiento
pt: Data de nascimento

source: Gender
es: Sexo
pt: Sexo

source: Nationality
es: Nacionalidad
pt: Nacionalidade

source: Place of birth
es: Lugar de nacimiento
pt: Naturalidade

source: Marital status
es: Estado civil
pt: Estado civil

source: Education Level
es: Educación
pt: Escolaridade

source: Disability
es: Discapacidad
pt: Deficiência

source: Personal data
es: Datos personales
pt: Dados pessoais

source: Edit
es: Editar
pt: Editar

source: No personal data registered yet
es: No hay datos personales registrados todavía
pt: Ainda não há dados pessoais cadastrados

# noPersonalAddressRegisteredYet
source: No addresses registered yet
es: Aún no hay direcciones registradas
pt: Ainda não há endereços cadastrados

source: Add personal data
es: Agregar datos personales
pt: Adicionar dado pessoal

# addPersonalAddress
source: Add address
es: Agregar dirección
pt: Adicionar endereço

# nationalityTitle
source: Enter the nationality
es: Informar la nacionalidad
pt: Informar a nacionalidade

# nationalitySearchHelp
source: Search for your nationality
es: Encuentre su nacionalidad
pt: Busque sua nacionalidade

# nationalitySearchHelpDescription
source: Use the field above to search for your nationality.
es: Utilice el campo de arriba para buscar su nacionalidad.
pt: Utilize o campo acima para pesquisar sua nacionalidade.

source: Edit personal data
es: Editar los datos personales
pt: Editar dados pessoais

# nationalityNoDataFound
source: No nationality was found with this entered term
es: Ninguna nacionalidad fue encontrada con el término
pt: Nenhuma nacionalidade foi encontrada com o termo digitado

source: Relationship degree
es: Grado de parentesco
pt: Grau de parentesco

# nationalityNoDataFoundDescription
source: Enter your nationality, that is, referring to the country you were born in
es: Introduzca su nacionalidad, es decir, el país en el que ha nacido
pt: Digite sua nacionalidade, ou seja, referente ao país que você nasceu

# theInformationPresentedIsUnderAnalysis
source: The information presented is under analysis. You will soon receive a notification about the progress of your request.
es: La información presentada está siendo analizada. En breve recibirá una notificación sobre el progreso de su pedido.
pt: As informações apresentadas estão em análise. Em breve você receberá uma notificação sobre o andamento da solicitação.

# theInformationPresentedIsUnderProcessing
source: The information presented is being processed. You will soon receive a notification about the progress of your request
es: La información presentada está en proceso. En breve recibirá una notificación sobre el progreso de su pedido.
pt: As informações apresentadas estão em processamento. Em breve você receberá uma notificação sobre o andamento da solicitação.

# naturalityTitle
source: Enter the place of birth
es: Informar el lugar de nacimiento
pt: Informar a naturalidade

# naturalitySubtitle
source: Enter the city you were born in.
es: Introduzca su ciudad de nacimiento.
pt: Informe a cidade que você nasceu.

# naturality
source: Place of birth
es: Lugar de nacimiento
pt: Naturalidade

# naturalitySearchHelp
source: Search for your place of birth
es: Busca tu lugar de nacimiento
pt: Busque sua naturalidade

# naturalitySearchHelpDescription
source: Use the field above to search for your place of birth.
es: Utilice el campo anterior para buscar su lugar de nacimiento.
pt: Utilize o campo acima para pesquisar sua naturalidade.

# naturalityNoDataFound
source: No place of birth was found with this entered term
es: Ningún lugar de nacimiento fue encontrado con el término escrito
pt: Nenhuma naturalidade foi encontrada com o termo digitado

# naturalityNoDataFoundDescription
source: Enter your place of birth, that is, referring to the city you were born in
es: Introduzca su lugar de nacimiento, es decir, la ciudad en la que nació
pt: Digite sua naturalidade, ou seja, referente à cidade em que você nasceu

# returnedAdjustment
source: Returned for adjustments
es: Devuelto para ajustes
pt: Retornado para ajustes

source: Phone number copied successfully.
es: El número de teléfono se ha copiado correctamente.
pt: O número de telefone foi copiado com sucesso.

source: Phone number
es: Teléfono
pt: Telefone

source: There are no emergency contacts registered yet
es: Todavía no hay contactos de emergencia registrados
pt: Ainda não há contatos de emergência cadastrados

source: Add Contact
es: Agregar contacto
pt: Adicionar contato

source: Make adjustments
es: Realización de ajustes
pt: Realizar ajustes

source: Edit emergency contact
es: Editar contacto de emergencia
pt: Editar contato de emergência

source: Add emergency contact
es: Agregar contacto de emergencia
pt: Adicionar contato de emergência

source: Emergency contact
es: Contacto de emergencia
pt: Contato de emergência

source: Full name
es: Nombre completo
pt: Nome completo

# degreeOfKinship
source: Relationship degree
es: Grado de parentesco
pt: Grau de parentesco

# ddi
source: CC
es: DDI
pt: DDI

# ddd
source: AC
es: DDD
pt: DDD

source: Enter the full name of the emergency contact.
es: Introduzca el nombre completo del contacto de emergencia.
pt: Informe o nome completo do contato de emergência.

# anErrorOccurredWhenSubmittingTheFormTapRetryToTryAgain
source: An error occurred while submitting the form. Tap Retry to try again.
es: Se ha producido un error al enviar el formulario. Pulse repetir para volver a intentarlo.
pt: Ocorreu um erro ao enviar o formulário. toque em repetir para tentar novamente.

source: Could not insert the individual programmed vacation
es: No es posible introducir las vacaciones programadas individuales
pt: Não foi possível inserir as férias programadas individuais

# doYouWantToCancelFillingInThisForm
source: Do you want to cancel the filling of this form?
es: ¿Desea cancelar este formulario?
pt: Deseja cancelar o preenchimento deste formulário?

# ifYouConfirmYouWillLoseTheInformationFilledInThisForm
source: If you confirm, you will lose the information entered in this form.
es: Si confirma, perderá la información rellenada en este formulario.
pt: Caso você confirme, perderá as informações preenchidas neste formulário

source: Save and submit
es: Grabar y enviar
pt: Salvar e enviar

# trueInformation
source: I declare that the information provided is true
es: Afirmo que los datos son verídicos
pt: Afirmo que os dados são verídicos

# personalDataSubmitted
source: The request to change the personal data has been submitted.
es: El pedido de modificación de los datos personales fue enviado.
pt: A solicitação para alterar os dados pessoais foi enviada.

# alertErrorSubmit
source: An error occurred while submitting the form. Tap Repeat to try again.
es: Ocurrió un error al enviar el formulario. Pulse repetir para volver a intentarlo.
pt: Ocorreu um erro ao enviar o formulário. Toque em repetir para tentar novamente.

# receiptTips
source: Select a receipt to help with the approval of the request.
es: Introduzca un comprobante para ayudar a la aprobación de la solicitud.
pt: Informe um comprovante para auxiliar na aprovação da solicitação.

# removeDisability
source: Remove disability registration?
es: ¿Eliminar el registro de la discapacidad?
pt: Remover cadastro de deficiência?

# removeRegister
source: Are you sure you want to remove this information from your registered data?
es: ¿Estás seguro de que quieres eliminar esta información de tus datos registrados?
pt: Tem certeza que deseja remover esta informação dos seus dados cadastrados?

source: Rehabilitated/Readapted
es: Rehabilitado/Readaptado
pt: Reabilitado/Readaptado

source: Add disability
es: Agregar discapacidad
pt: Adicionar deficiência

source: Disabilities
es: Deficiencias
pt: Deficiências

source: Define Disability
es: Informar Discapacidad
pt: Informar deficiência

# alertCancelForm
source: Do you want to cancel the filling of this form?
es: ¿Desea cancelar este formulario?
pt: Deseja cancelar o preenchimento deste formulário?

# alertCancelFormDescription
source: In case you confirm, you will lose the information filled in this form
es: Si confirma, perderá la información rellenada en este formulario
pt: Caso você confirme, perderá as informações preenchidas neste formulário

# emergencyContactSuccessfullyAdded
source: Emergency contact added successfully
es: Contacto de emergencia agregado con éxito
pt: Contato de emergência adicionado com sucesso

source: Confirm
es: Confirmar
pt: Confirmar

source: Close
es: Cerrar
pt: Fechar

source: Save
es: Grabar
pt: Salvar

source: Delete Emergency Contact?
es: ¿Eliminar el Contacto de Emergencia?
pt: Excluir Contato de Emergência?

# ifYouConfirmOuWillLoseTheInformationFilledInThisForm
source: If you confirm, the information entered in this form will be lost.
es: Si confirma, perderá la información rellenada en este formulario.
pt: Case você confirme, perderá as informações preenchidas neste formulário.

# couldNotDeleteContactTryAgainLater
source: Could not delete the contact, please try again later.
es: No se ha podido eliminar el contacto, inténtelo de nuevo más tarde.
pt: Não foi possível excluir o contato, tente novamente mais tarde.

# emergencyContactHasBeenDeleted
source: The emergency contact has been deleted
es: El Contacto de Emergencia fue eliminado
pt: O contato de emergência foi excluído

source: Delete contact
es: Eliminar el contacto
pt: Excluir contato

# defineData
source: Define the data
es: Introduzca los datos
pt: Informe os dados

source: Administrative region
es: Región administrativa
pt: Região administrativa

source: Edit personal address
es: Editar dirección personal
pt: Editar endereço pessoal

source: Do you want to cancel the filling of this form?
es: ¿Desea cancelar este formulario?
pt: Deseja cancelar o preenchimento deste formulário?

source: If you confirm, you will lose the information entered in this form.
es: Si confirma, perderá la información que ha rellenado en este formulario.
pt: Caso você confirme, perderá as informações preenchidas neste formulário.

# findCity
source: Find the city
es: Buscar la ciudad
pt: Busque a cidade

# findCityHelper
source: Use the field above to find your city.
es: Utilice el campo anterior para buscar su ciudad.
pt: Utilize o campo acima para pesquisar sua cidade.

# defineCity
source: Define the city
es: Informar la ciudad
pt: Informar a cidade

source: No city found
es: No se encontró ninguna ciudad
pt: Nenhuma cidade foi encontrada

# checkTermTryAgain
source: Check the entered term and try again.
es: Verifique el término que introdujo e inténtelo de nuevo.
pt: Verifique o termo digitado e tente novamente.

# administrativeRegionError
source: Error while loading regions.
es: Error al cargar las regiones.
pt: Erro ao carregar as regiões.

# administrativeRegionErrorDescription
source: An error occurred while obtaining the administrative regions. Tap Repeat to try loading again.
es: Ocurrió un error al buscar las regiones administrativas. Pulse Repetir para intentar cargar de nuevo.
pt: Ocorreu um erro ao buscar as regiões administrativas. Toque em repetir para tentar carregar novamente.

# proofResidence
source: Proof of residence
es: Comprobante de domicilio
pt: Comprovante de residência

# searchNaturalityError
source: An error occurred while searching for locations. Tap repeat to try loading again.
es: Ocurrió un error al buscar las ubicaciones. Pulse reintentar para intentar cargar de nuevo.
pt: Ocorreu um erro ao buscar os locais. Toque em repetir para tentar carregar novamente.

# personalAddressSubmitted
source: The request to change the personal address has been sent.
es: La solicitud para modificar la dirección personal fue enviada.
pt: A solicitação para alterar o endereço pessoal foi enviada.

source: Social Network
es: Redes sociales
pt: Rede social

source: Edit contacts
es: Editar contactos
pt: Editar contatos

# noPhoneRegistered
source: No phone numbers registered.
es: No hay teléfonos registrados.
pt: Não há telefones registrados.

# addPhone
source: Add phone number
es: Agregar teléfono
pt: Adicionar telefone

# deletePhone
source: Delete phone number?
es: ¿Eliminar el teléfono?
pt: Excluir telefone?

# noEmailRegistered
source: No email addresses registered.
es: No hay correos electrónicos registrados.
pt: Não há e-mails registrados.

# addEmail
source: Add email address
es: Agregar correo electrónico
pt: Adicionar e-mail

# userOrAddress
source: Username or address
es: Nombre de usuario o dirección
pt: Nome de usuário ou endereço

# noDefinedTypeEmail
source: An email address must be defined if a type is defined.
es: Debe introducir una dirección de correo electrónico si introduce un tipo.
pt: É necessário informar um e-mail caso informe um tipo.

# deleteEmail
source: Delete email address?
es: ¿Eliminar el correo electrónico?
pt: Excluir E-mail?

source: No social networks registered.
es: No hay redes sociales registradas.
pt: Não há redes sociais registradas.

source: Add social network
es: Agregar red social
pt: Adicionar rede social

source: Delete social network?
es: ¿Eliminar la red social?
pt: Excluir Rede Social?

source: Contacts
es: Contactos
pt: Contatos

source: type
es: Tipo
pt: Tipo

source: There are no contacts registered yet.
es: Aún no hay contactos registrados.
pt: Ainda não há contatos cadastrados.

source: There are no social networks registered yet.
es: Aún no hay redes sociales registradas
pt: Ainda não há redes sociais cadastradas.

source: There are no email addresses registered yet.
es: Aún no hay correos electrónicos registrados.
pt: Ainda não há e-mails cadastrados.

source: There are no phone numbers registered yet.
es: Aún no hay teléfonos registrados.
pt: Ainda não há telefones cadastrados.

source: Email address copied successfully
es: La dirección de correo electrónico fue copiada con éxito
pt: O endereço email foi copiado com sucesso

source: User copied successfully
es: El usuario fue copiado con éxito
pt: O usuário foi copiado com sucesso

# personalContactsSubmitted
source: The request to change the contacts has been submitted.
es: La solicitud de modificación de contactos ha sido enviada.
pt: A solicitação para alterar os contatos foi enviada.

source: CPF number
es: Número del CPF
pt: Número do CPF

# cpfNumberInvalid
source: Invalid CPF number
es: Número del CPF no válido
pt: Número do CPF Inválido

source: Civil Certificates
es: Certificados Civiles
pt: Certidões Civis

source: Edit documents
es: Editar documentos
pt: Editar documentos

# whichDocuments
source: Which documents would you like to edit/add?
es: ¿Cuáles documentos desea editar/agregar?
pt: Quais documentos deseja editar/adicionar?

source: CPF number copied successfully.
es: El número de CPF fue copiado con éxito.
pt: O número de CPF foi copiado com sucesso.

source: CTPS number copied successfully.
es: El número del CTPS fue copiado con éxito.
pt: O número do CTPS foi copiado com sucesso.

source: RIC number copied successfully.
es: El número del RIC fue copiado con éxito.
pt: O número do RIC foi copiado com sucesso.

source: NIS number copied successfully.
es: El número del NIS fue copiado con éxito.
pt: O número do NIS foi copiado com sucesso.

source: CNS number copied successfully.
es: El número del CNS fue copiado con éxito.
pt: O número do CNS foi copiado com sucesso.

# rgNumberCopiedSuccessfully
source: Identity Card number copied successfully.
es: El número de la Cédula de Ciudadanía fue copiado con éxito.
pt: O número do RG foi copiado com sucesso.

# voterRegistrationNumberCopiedSuccessfully
source: Voter Registration Card number copied successfully.
es: El número del Titulo de Elector fue copiado con éxito.
pt: O número do Título Eleitoral foi copiado com sucesso.

# cnhNumberCopiedSuccessfully
source: Driver's License number copied successfully.
es: El número de la Licencia de Conducción fue copiado con éxito.
pt: O número da CNH foi copiado com sucesso.

source: Passport number copied successfully.
es: El número del pasaporte fue copiado con éxito.
pt: O número do passaporte foi copiado com sucesso.

# cdiCopiedSuccessfully
source: CDI number copied successfully.
es: El número del CDI fue copiado con éxito..
pt: O número do CDI foi copiado com sucesso.

# visaCopiedSuccessfully
source: Visa number copied successfully.
es: El número de Visa fue copiado con éxito
pt: O número do Visto foi copiado com sucesso.

# rneCopiedSuccessfully
source: RNE number copied successfully.
es: El número del RNE fue copiado con éxito.
pt: O número do RNE foi copiado com sucesso.

# thereAreNoDocumentYet
source: No documents registered yet.
es: Todavía no hay documentos registrados.
pt: Ainda não há documentos cadastrados.

# document
source: Documents
es: Documentos.
pt: Documentos

# civilCertificate
source: Certificates
es: Certificados.
pt: Certidões

# thereAreNoCivilCertificateRegisteredYet
source: No certificates registered.
es: No hay certificados registrados.
pt: Não há certidões registradas.

# thereAreNoDocumentRegisteredYet
source: No documents registered.
es: No hay documentos registrados.
pt: Não há documentos registrados.

source: Could not copy the text
es: No fue posible copiar el texto.
pt: Não foi possível copiar o texto.

source: Add Documents
es: Agregar Documentos
pt: Adicionar Documentos

source: Change Documents
es: Cambiar Documentos
pt: Alterar Documentos

source: Invalid CPF number
es: Número del CPF no válido
pt: Número do CPF Inválido

# deleteDocument
source: Delete information
es: Eliminar información
pt: Apagar informações

# deleteRg
source: Delete Identity Card information?
es: ¿Eliminar informaciones de la Cédula de Ciudadanía?
pt: Apagar informações do RG?

# deleteMessageDocument
source: Upon deleting, you will lose any information filled in. However, it will only be deleted after submitting the form.
es: Al eliminar perderás las informaciones que hayas rellenado. Sin embargo, solo se eliminará después de enviar el formulario.
pt: Ao apagar você perderá as informações preenchidas. Porém, somente será excluído após o envio do formulário.

# erase
source: Eliminar
pt: Apagar

source: Issuance Body Fed. Unit
es: UF de la entidad emisora
pt: UF do órgão emissor

# deleteVoterRegistration
source: Delete Voter Registration Card information?
es: ¿Eliminar informaciones del titulo electoral?
pt: Apagar informações do Título Eleitoral?

source: Invalid date.
es: Fecha no válida.
pt: Data inválida

source: Date of the first Driver's License
es: Fecha de la primera Licencia de Conducción
pt: Data da primeira CNH

source: Delete the Driver's License information?
es: ¿Eliminar las informaciones de la Licencia de Conducción?
pt: Apagar informações da CNH?

# theDateReportedMustBeEarlierthanToday
source: The defined date must be earlier than today.
es: La fecha informada debe ser anterior a hoy.
pt: A data informada precisa ser anterior a hoje.

source: Register date
es: Fecha de registro
pt: Data de registro

# nisNumberInvalid
source: Invalid NIS number
es: Número del NIS no válido
pt: Número do NIS Inválido

source: Delete passport information?
es: ¿Eliminar informaciones del pasaporte?
pt: Apagar informações do passaporte?

# defineIssuingCountry
source: Define the issuing country
es: Informar al país emisor
pt: Informar o país emissor

# countrySearchHelp
source: Search for the issuing country
es: Buscar el país emisor
pt: Busque o país emissor

# countrySearchHelpDescription
source: Use the field above to search for the country that issued your passport.
es: Utilice el campo de arriba para buscar el país emisor de su pasaporte.
pt: Utilize o campo acima para pesquisar o país emissor do seu passaporte.

# countryNoDataFound
source: No countries found with the entered term
es: No se encontró ningún país con el término ingresado
pt: Nenhum país foi encontrado com o termo digitado

# countryNoDataFoundDescription
source: Enter the issuing country - the country that issued your passport
es: Escriba el país emisor, es decir, haciendo referencia al país que emitió su pasaporte
pt: Digite o país emissor, ou seja, referente ao país que emitiu o seu passaporte

source: Issuing city
es: Ciudad emisora
pt: Cidade de emissão

source: Add certificate
es: Agregar certificado
pt: Adicionar certidão

# typeCivilCertificate
source: Civil certificate type
es: Tipo de certificado civil
pt: Tipo de certidão civil

# cityCivilCertificate
source: Civil certificate city
es: Ciudad del certificado civil
pt: Cidade da certidão civil

# defineCivilCertificate
source: Define certificate
es: Informar certificado
pt: Informar certidão

# removeCertificate
source: Remove certificate registration?
es: ¿Eliminar el registro del certificado?
pt: Remover cadastro de certidão?

# deleteCNS
source: Delete National Health Card information?
es: ¿Eliminar informaciones de la Tarjeta Nacional de Salud?
pt: Apagar informações do CNS?

# deleteCDI
source: Delete Incorporation Waiver Certificate information?
es: ¿Eliminar informaciones de la Tarjeta Militar?
pt: Apagar informações do certificado de reservista?

# saveForm
source: Save the form?
es: ¿Grabar formulario?
pt: Salvar formulário?

# noShowAgainAction
source: Don't show this message again.
es: No volver a mostrar este mensaje.
pt: Não mostrar essa mensagem novamente.

# noShowAgainMessage
source: Upon saving, any changes made, including edits and deletions will be confirmed and this action cannot be undone.
es: Al grabar, los cambios realizados, incluidas las ediciones y eliminaciones, se confirmarán y esta acción no se puede deshacer.
pt: Ao salvar, as alterações feitas, incluindo edições e exclusões serão confirmadas e esta ação não poderá ser desfeita.

# deleteVisa
source: Delete Visa information?
es: ¿Eliminar informaciones del Visa?
pt: Apagar informações do Visto?
