Repository: felipeduarte26/waapi-flutter-module
Catalog: lib/app/core/localization/l10n/lang_*.arb
Languages: es, pt

# vacationRequestApprovedNotificationDescription
source: You may receive a push notification informing you that your vacation request has been approved.
es: Es posible que reciba una notificación push de que su pedido de programación de vacaciones ha sido aprobado.
pt: Você poderá receber uma notificação por push informando que sua solicitação de programação de férias foi aprovada.

# vacationRequestReturnedNotificationTitle
source: Returned vacation request
es: Pedido de vacaciones regresado
pt: Solicitação de férias retornada para ajustes

# vacationRequestReturnedNotificationDescription
source: You may receive a push notification informing you that your vacation request has been returned for adjustments
es: Es posible que reciba una notificación push de que su pedido de programación de vacaciones ha vuelto para ser ajustada.
pt: Você poderá receber uma notificação por push informando que sua solicitação de programação de férias retornou para ajustes.

# vacationRequestRejectedNotificationTitle
source: Rejected vacation request
es: Pedido de vacaciones rechazado
pt: Solicitação de férias reprovada

# vacationRequestExpiredNotificationDescription
source: You may receive a push notification informing you that your vacation request has been expired
es: Es posible que reciba una notificación push de que su pedido de programación de vacaciones ha sido expirada.
pt: Você poderá receber uma notificação por push informando que sua solicitação de programação de férias foi expirada.

# vacationRequestExpiredNotificationTitle
source: Expired vacation request
es: Pedido de vacaciones expirada
pt: Solicitação de férias expirada

# vacationRequestRejectedNotificationDescription
source: You may receive a push notification informing you that your vacation request has been rejected
es: Es posible que reciba una notificación push de que su pedido de programación de vacaciones ha sido rechazado.
pt: Você poderá receber uma notificação por push informando que sua solicitação de programação de férias foi reprovada.

# profileBankName
source: Bank
es: Banco
pt: Banco

# profileBranch
source: Branch
es: Agencia
pt: Agência

# profileAccountNumber
source: Account number
es: Número de la cuenta
pt: Número da conta

# notStable
source: Non-stable
es: No estable
pt: Não estável

# electedCipa
source: CIPA (Accident Prevention Commitee) Elected Holder
es: Electo Titular CPA (Comité de Prevención de Accidentes)
pt: Eleito Titular CIPA

# maternityAssistance
source: Maternity Benefit
es: Auxilio Maternidad
pt: Auxílio Maternidade

source: Union Mandate
es: Mandato Sindical
pt: Mandato Sindical

# governmentEmployee
source: Public Servant
es: Servidor Público
pt: Servidor Público

# returnHolidays
source: Vacation Return
es: Regreso Vacaciones
pt: Retorno Férias

# sickPay
source: Illness aid return
es: Regreso Auxilio Enfermedad
pt: Retorno Auxílio Doença

# nearRetirement
source: Time Next to Retirement
es: Tiempo Próximo de Jubilación
pt: Tempo Próximo Aposentadoria

# collectiveAgreement
source: Collective bargaining agreement (Bargaining)
es: Convención Colectiva (Discusión)
pt: Convenção Coletiva (Dissídio)

# previousTimeFgtsOption
source: Time Previous to FGTS (Guarantee Fund for Length of Service) option
es: Tiempo Anterior Opción FP
pt: Tempo Anterior Opção FGTS

# notOptionFgts
source: Non-opting FGTS (Guarantee Fund for Length of Service)
es: No Optante FP
pt: Não Optante FGTS

# cipaEmployer
source: CIPA (Accident Prevention Commitee) employer
es: CPA Empleador
pt: CIPA Empregador

# memberOfComissionForPriorConciliation
source: Member of the Prior Conciliation Commission
es: Miembro de la Comisión de Conciliación Previa
pt: Membro da Comissão de Conciliação Prévia

# memberOfFgtsCuratorCouncil
source: Member of the Board of Trustees of FGTS (Guarantee Fund for Length of Service)
es: Miembro del Consejo Curador del FP
pt: Membro do Conselho Curador do FGTS

# memberOfNationalCouncilOfSocialSecurity
source: Member of the National Social Welfare Council
es: Miembro del Consejo Nacional de Previsión Social
pt: Membro do Conselho Nacional da Previdência Social

# educationAid
source: Education Allowance
es: Auxilio Educación
pt: Auxílio Educação

source: Consumer Cooperative
es: Cooperativa de Consumo
pt: Cooperativa de Consumo

source: Credit Union
es: Cooperativa de Crédito
pt: Cooperativa de Crédito

# personWithDisability
source: People with Disabilities (PwD)
es: Persona con Deficiencia
pt: Pessoa com Deficiência (PcD)

# cooperativeOfSyndicate
source: Union Cooperative
es: Cooperativa del Sindicato
pt: Cooperativa do Sindicato

# cipatr
source: CIPATR (Internal Commission for the Prevention of Rural Labor Accidents)
es: CIPATR (Comisión Interna de Prevención de Accidentes en el Trabajo Rural)
pt: CIPATR

source: Paternity Leave
es: Licencia Paternidad
pt: Licença Paternidade

source: Electoral mandate
es: Mandato Electoral
pt: Mandato Eleitoral

# cipaCandidate
source: CIPA (Accident Prevention Commitee) candidate
es: Candidato de la CPA
pt: Candidato da CIPA

# electAlternateCipa
source: CIPA (Accident Prevention Commitee) elected alternate
es: Electo Suplente CPA
pt: Eleito Suplente CIPA

# salaryCurrent
source: Current salary
es: Salario actual
pt: Salário atual

# salaryComplement
source: Complement
es: Complemento
pt: Complemento

source: Salary type
es: Tipo del salario
pt: Tipo do salário

# salaryLastAdjustmentDate
source: Last adjustment date
es: Fecha del último ajuste
pt: Data do último ajuste

# salaryInsalubrityPercentage
source: Insalubrity percentage
es: Porcentaje de insalubridad
pt: Percentual de insalubridade

# salaryHazardPercent
source: Hazard percentage
es: Porcentaje de insalubridad
pt: Percentual de periculosidade

# salaryTypeHourly
source: Hourly
es: Empleado por hora
pt: Horista

# salaryTypeDaily
source: Daily
es: Empleado por día
pt: Diarista

# salaryTypeWeekly
source: Weekly
es: Semanal
pt: Semanal

# salaryTypeBiweekly
source: Every two weeks
es: Quincenal
pt: Quinzenal

# salaryTypeMonthly
source: Monthly paid worker
es: Mensual
pt: Mensalista

# salaryTypeSkilled
source: Skilled worker
es: Trabajador
pt: Tarefeiro

# salaryTypeVariable
source: Variable
pt: Variável

source: Passport
es: Pasaporte
pt: Passaporte

source: Issuing country
es: País emisor
pt: País emissor

source: Issuing body
es: Órgano emisor
pt: Órgão emissor

source: Issuance date
es: Fecha de emisión
pt: Data de emissão

source: Expiration date
es: Fecha de caducidad
pt: Data de validade

# cns
source: CNS (National Health Card)
es: Tarjeta Nacional de Salud
pt: CNS - Cartão Nacional de Saúde

# cpf
source: CPF (Natural Person Register)
es: Registro de Persona Física
pt: CPF - Cadastro de Pessoa Física

# rg
source: RG (Identity Card)
es: Cédula de Ciudadanía
pt: RG - Registro Geral

source: Voter registration card
es: Certificado Electoral
pt: Título Eleitoral

source: Section
es: Sección
pt: Seção

source: Zone
es: Zona
pt: Zona

# ctps
source: CTPS (Work and Social Security Card)
es: CTPS* - Documentación de Trabajo y Previsión Social
pt: CTPS - Carteira de Trabalho e Previdência Social

source: Series
es: Serie
pt: Série

source: Digit
es: Dígito
pt: Digito

# cnh
source: Driver's License
es: CNH - Licencia de conducción
pt: CNH - Carteira Nacional de Habilitação

source: Category
es: Categoría
pt: Categoria

# firstCNH
source: First driver's license Issuance date
es: Fecha 1ª Licencia
pt: Data 1ª habilitação

source: Visa
pt: Visto

# typeVacations
source: Vacation type
es: Tipo de vacaciones
pt: Tipo das férias

# rne
source: RNE (National Registry of Foreigners)
es: RNE - Registro Nacional de Extranjeros
pt: RNE - Registro Nacional de Estrangeiros

# ric
source: RIC (Civil Identity Register)
es: RIC - Registro de Identidad Civil
pt: RIC - Registro de Identidade Civil

# nis
source: NIS (Social Identification Number)
es: NIS - Numero de Identificación Social
pt: NIS - Número de Identificação Social

# cdi
source: Incorporation Waiver Certificate
es: Tarjeta Militar
pt: Certificado de reservista

source: Registration number
es: Matrícula
pt: Matrícula

source: Book number
es: Nº del libro
pt: Nº do livro

source: Sheet number
es: Nº de la nómina de pago
pt: Nº da folha

# notaryOfficeName
source: Notary's office name
es: Nombre de la notaría
pt: Nome do cartório

source: Term number
es: Nº del término
pt: Nº do termo

# certificateOf
source: Certificate of {certificateName}
es: Certificado de {certificateName}
pt: Certidão de {certificateName}

# permanentVisa
source: Permanent
es: Permanente
pt: Permanente

# temporaryVisa
source: Temporary
es: Temporal
pt: Temporário

# exiledVisa
source: Exile
es: Exilio
pt: Exílio

# refugeeVisa
source: Refuge
es: Refugio
pt: Refúgio

# boundaryCountryResidentVisa
source: Resident in border country to Brazil
es: Residente en país fronterizo a Brasil
pt: Residente em país fronteiriço ao Brasil

# disabledPersonVisa
source: Person with a disability and over 51 years old
es: Deficiente físico y major que 51 años
pt: Deficiente físico e com mais de 51 anos

# temporaryResidentIrregularVisa
source: With temporary residence and granted amnesty, under irregular situation
es: Con modaria provisoria y amnistiado, en situación irregular
pt: Com residência provisória e anistiado, em situação irregular

# permanentResidentChildrenVisa
source: Permanence in Brazil by reason of Brazilian children or spouse
es: Permanencia en Brasil en razón de hijos o parejas brasileños
pt: Permanência no Brasil em razão de filhos ou cônjuge brasileiros

# mercosulBenefitVisa
source: Benefited by agreement among Mercosul countries
es: Beneficiado por el Mercosur
pt: Beneficiado pelo acordo entre países do Mercosul

# diplomacyVisa
source: Dependent on diplomatic and/or consular agent from countries which keep reciprocity agreement to exert remunerated activity in Brazil
es: Dependiente de agente diplomático y/o consular de países que mantienen convenio de reciprocidad para el ejercicio de actividad remunerada en Brasil
pt: Dependente de agente diplomático e/ou consular de países que mantém convênio de reciprocidade para o exercício de atividade remunerada no Brasil

# friendshipTreatyPortugalVisa
source: Benefited by Treaty of Friendship, Cooperation and Consultation between the Federal Republic of Brazil and the Portuguese Republic
es: Beneficiado por el Tratado de Amistad, Cooperación y Consulta entre Brasil y Portuguesa
pt: Beneficiado pelo Tratado de Amizade, Cooperação e Consulta entre a República Federativa do Brasil e a República Portuguesa

# otherConditionVisa
source: Other condition
es: Otra condición
pt: Outra condição

source: Birth
es: Nacimiento
pt: Nascimento

# marriageCertificate
source: Marriage
es: Matrimonio
pt: Casamento

# religiousMarriageCertificate
source: Religious Marriage with civil effect
es: Matrimonio Religioso con efecto civil
pt: Casamento Religioso com efeito civil

source: Death
es: Óbito
pt: Óbito

# stillbirthCertificate
source: Stillborn
es: Mortinato
pt: Natimorto

# registrationBannsCertificate
source: Registration banns
es: Registro de Proclamas
pt: Registro de Proclamas

# othersCertificate
source: Other acts related to the civil register or unique book
es: Demás actos relativos al registro civil o libro y único
pt: Demais atos relativos ao registro civil ou livro e único

# emancipatingCertificate
source: Divided for specific register of Emancipations
es: Desdoblado para registro específico de las Emancipaciones
pt: Desdobrado para registro específico das Emancipações

# interdictionsCertificate
source: Divided for specific register of Interdictions
es: Desdoblado para registro específico de las Interdiciones
pt: Desdobrado para registro específico das Interdições

source: Indigenous person's birth certificate
es: Certificado Ad. de Nacimiento Indígena.
pt: Certidão Ad. de Nascimento Indígena

# requestingRefugee
source: Refuge seeker
es: Solicitador(a) de refugio
pt: Solicitante de refúgio

source: Employee - General
es: Empleado - General
pt: Empregado - Geral

source: Employee - Short-term Rural Worker of Brazilian Law 11,718/2008
es: Empleado - Trabajador Rural por Pequeño Plazo de la Ley 11.718/2008
pt: Empregado - Trabalhador Rural por Pequeno Prazo da Lei 11.718/2008

source: Employee - Apprentice
es: Empleado - Aprendiz
pt: Empregado - Aprendiz

source: Employee - Domestic Worker
es: Empleado - Doméstico
pt: Empregado - Doméstico

source: Employee - fixed-term in accordance to Brazilian Law 9,601/98
es: Empleado - contrato a término firmado en los términos de la Ley 9601/98
pt: Empregado - contrato a termo firmado nos termos da Lei 9601/98

source: Employee - fixed-term contract in accordance to Brazilian Law 6,019/74
es: Empleado - contrato por plazo determinado en los términos de la Ley 6019/74
pt: Empregado - contrato por prazo determinado nos termos da Lei 6019/74

source: Employee not related to RGPS (General Social Welfare Policy) but entitled to FGTS (Guarantee Fund for Length of Service)
es: Trabajador no vinculado al RGSS con derecho al FP
pt: Trabalhador não vinculado ao RGPS com direito ao FGTS

source: Temporary Worker - Port worker
es: Trabajador Independiente - Portuario
pt: Trabalhador Avulso - Portuário

source: Temporary Worker - Non-Port (Union Information)
es: Trabajador Independiente - No Portuario (Información del Sindicato)
pt: Trabalhador Avulso - Não Portuário (Informação do Sindicato)

source: Temporary Worker - Non-Port (Contractor Information)
es: Trabajador Independiente - No Portuario (Información del Contratante)
pt: Trabalhador Avulso - Não Portuário (Informação do Contratante)

source: Public Servant - Titular of Effective Job
es: Servidor Público - Titular de Cargo Efectivo
pt: Servidor Público - Titular de Cargo Efetivo

source: Public Servant - Occupying a commissioned exclusive job
es: Servidor Público - Ocupante de Cargo exclusivo en comisión
pt: Servidor Público - Ocupante de Cargo exclusivo em comissão

source: Public Servant - Elective Mandate Exercise
es: Servidor Público - Que ejerce el Mandato Electivo
pt: Servidor Público - Exercente de Mandato Eletivo

source: Public Servant - Public Agent
es: Servidor Público - Agente Público
pt: Servidor Público - Agente Público

source: Does not apply
es: No se aplica
pt: Não se aplica

source: Public Server related to RPPS indicated for council or representative body, in the condition of representative of the government, body or public administration entity.
es: Servidor Público vinculado a RPPS* indicado para consejo o órgano representativo, en la condición de representante del gobierno, órgano o entidad de la administración pública.
pt: Servidor Público vinculado a RPPS indicado para conselho ou órgão representativo, na condição de representante do governo, órgão ou entidade da administração pública.

source: Public Servant - Temporary Contract
es: Servidor Público - Contrato Temporal
pt: Servidor Público - Contrato Temporário

source: Union leader - In relation to the remuneration received in the Union.
es: Dirigente Sindical - En relación a Remuneración Recibida en el Sindicato.
pt: Dirigente Sindical - Em relação a Remuneração Recebida no Sindicato.

source: Individual contributor - Self-employed worker hired by companies in general
es: Contrib. Individual - Autónomo contratado por Empresas en general
pt: Contrib. Individual - Autônomo contratado por Empresas em geral

source: Individual contributor - Self-employed hired by Individual contributor, by natural person in general, or by diplomatic mission and consular office of foreign careers
es: Contrib. Individual - Autónomo contratado por Contrib. Individual, por persona física en general, o por misión diplomática y repartición consular de carrera extranjeras
pt: Contrib. Individual - Autônomo contratado por Contrib. Individual, por pessoa física em geral, ou por missão diplomática e repartição consular de carreira estrangeiras

source: Individual contributor - Self-employed hired by Beneficent Entity of Social Assistance exempt from employer's quota
es: Contrib. Individual - Autónomo contratado por Entidad Benéfica de Asistencia Social exenta de la cuota patronal
pt: Contrib. Individual - Autônomo contratado por Entidade Beneficente de Assistência Social isenta da cota patronal

source: Individual contributor - Self-employed carrier hired by companies in general
es: Contrib. Individual - Transportador autónomo contratado por Empresas en general
pt: Contrib. Individual - Transportador autônomo contratado por Empresas em geral

source: Individual contributor - Self-employed carrier hired by Individual contributor, by natural person in general, or by diplomatic mission and consular office of foreign careers
es: Contrib. Individual - Transportador autónomo contratado por Contrib. Individual, por persona física en general, o por misión diplomática y repartición consular de carrera extranjeras
pt: Contrib. Individual - Transportador autônomo contratado por Contrib. Individual, por pessoa física em geral, ou por missão diplomática e repartição consular de carreira estrangeiras

source: Individual contributor - Self-employed carrier hired by Beneficent Entity of Social Assistance exempt from employer's quota
es: Contrib. Individual - Transportador autónomo contratado por Entidad Benéfica de Asistencia Social exenta de la cuota patronal
pt: Contrib. Individual - Transportador autônomo contratado por Entidade Beneficente de Assistência Social isenta da cota patronal

source: Individual contributor - Non-employed director with FGTS
es: Contrib. Individual - Director no empleado con FP
pt: Contrib. Individual - Diretor não empregado com FGTS

source: Individual contributor - Non-employed director without FGTS
es: Contrib. Individual - Director no empleado sin FP
pt: Contrib. Individual - Diretor não empregado sem FGTS

source: Individual contributor - Cooperative member who provides services to company through work cooperative
es: Contrib. Individual - Cooperado que presta servicios a la empresa por intermedio de cooperativa de trabajo
pt: Contrib. Individual - Cooperado que presta serviços a empresa por intermédio de cooperativa de trabalho

source: Individual contributor - Cooperative member elected for the management of the Cooperative
es: Contrib. Individual - Cooperado electo para dirección de la Cooperativa
pt: Contrib. Individual - Cooperado eleito para direção da Cooperativa

source: Individual contributor - Cooperative carrier who provides services to the company through work cooperative
es: Contrib. Individual - Transportador Cooperado que presta servicios a la empresa por intermedio de cooperativa de trabajo
pt: Contrib. Individual - Transportador Cooperado que presta serviços a empresa por intermédio de cooperativa de trabalho

source: Individual contributor - Cooperative carrier who provides services to Beneficent Entity of Social Assistance exempt from employer's quota or for natural person
es: Contrib. Individual - Transportador Cooperado que presta servicios a la Entidad Benéfica de Asistencia Social exenta de la cuota patronal o para persona física
pt: Contrib. Individual - Transportador Cooperado que presta serviços a Entidade Beneficente de Assistência Social isenta da cota patronal ou para pessoa física

source: Individual contributor - Cooperative carrier elected for the management of the Cooperative.
es: Contrib. Individual - Transportador Cooperado electo para dirección de la Cooperativa.
pt: Contrib. Individual - Transportador Cooperado eleito para direção da Cooperativa.

source: Individual contributor - Cooperative member affiliated to production cooperative.
es: Contrib. Individual - Cooperado filiado a cooperativa de producción.
pt: Contrib. Individual - Cooperado filiado a cooperativa de produção.

source: Individual contributor - Micro Individual Entrepreneur, when hired by legal person
es: Contrib. Individual - Micro Emprendedor Individual, cuando contratado por PJ*
pt: Contrib. Individual - Micro Empreendedor Individual, quando contratado por PJ

source: Intern
es: Aprendiz
pt: Estagiário

# errorPermissionGallery
source: To perform this action, you need to accept permission to read your device's photo gallery. Go to privacy settings to grant permission.
es: Para realizar esta acción, es necesario aceptar los permisos para leer la galería de fotos de su aparato. Acceda a las configuraciones de privacidad para liberar el permiso.
pt: Para realizar essa ação, é necessário aceitar a permissão para ler a galeria de fotos do seu dispositivo. Acesse as configurações de privacidade para liberar a permissão.

# errorPermissionPhoto
source: To perform this action, you need to accept permission to use your device's camera. Go to privacy settings to grant permission.
es: Para realizar esta acción, es necesario aceptar los permisos para uso de cámara de su aparato. Acceda a las configuraciones de privacidad para liberar el permiso.
pt: Para realizar essa ação, é necessário aceitar a permissão para uso da câmera do seu dispositivo. Acesse as configurações de privacidade para liberar a permissão.

# errorUpdatePhoto
source: An error occurred while uploading your new profile picture. Tap Repeat to try again.
es: Ocurrió un error al cargar su nueva foto de perfil. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao carregar sua nova foto de perfil. Toque em Repetir para tentar novamente.

# takePicture
source: Take a picture
es: Hacer una foto
pt: Tirar uma foto

# photoGallery
source: Gallery picture
es: Foto de la galería
pt: Foto da galeria

source: Save profile picture
es: Grabar foto de perfil
pt: Salvar foto de perfil

source: Change profile picture
es: Cambiar foto de perfil
pt: Alterar foto de perfil

# vacations
source: Vacation
es: Vacaciones
pt: Férias

source: Open
es: Pendientes
pt: Abertos

source: Paid
es: Pagados
pt: Quitados

source: Periods Paid
es: Períodos pagados
pt: Períodos quitados

# openPeriodsEmpty
source: No open vacation periods were found.
es: No fueron encontrados períodos de vacaciones pendientes.
pt: Não foram encontrados períodos de férias em aberto.

# paidPeriodsEmpty
source: No paid vacation periods were found.
es: No fueron encontrados períodos de vacaciones pagados.
pt: Não foram encontrados períodos de férias quitados.

# openPeriodsEmptyDescription
source: When there is information on open periods, it will appear here.
es: Cuando existieren informaciones de los períodos pendientes, ellas estarán aquí.
pt: Quando houver informações dos períodos em aberto, elas irão aparecer aqui.

# paidPeriodsEmptyDescription
source: When there is information on paid periods, it will appear here.
es: Cuando existieren informaciones de los períodos pagados, ellas estarán aquí.
pt: Quando houver informações dos períodos quitados, elas irão aparecer aqui.

# openPeriodsError
source: Could not obtain your open periods
es: No ha sido posible obtener sus períodos a tomar
pt: Não foi possível obter seus períodos em aberto

# openPeriodsErrorDescription
source: Unable to recover your open vacation periods because an internal system error has occurred. Wait a few moments and to retry this action, tap Try Again.
es: El sistema presentó un error interno y, por eso, no fue posible recuperar sus períodos de vacaciones pendientes. Aguarde un rato para repetir esta acción y haga clic en Intentar nuevamente.
pt: O sistema apresentou um erro interno e, por isso, não foi possível recuperar seus períodos de férias em aberto. Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# paidPeriodsError
source: Could not obtain your paid periods
es: No ha sido posible obtener los períodos quitados
pt: Não foi possível obter seus períodos quitados
