Repository: felipeduarte26/waapi-flutter-module
Catalog: lib/app/core/localization/l10n/lang_*.arb
Languages: es, pt

# paidPeriodsErrorDescription
source: Unable to recover your paid vacation periods because an internal system error has occurred. Wait a few moments and to retry this action, tap Try Again.
es: El sistema presentó un error interno, y por eso no fue posible recuperar sus períodos de vacaciones disfrutados. Aguarde un rato y para repetir esta acción, pulse sobre Reintentar.
pt: O sistema apresentou um erro interno e, por isso, não foi possível recuperar seus períodos de férias quitados. Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# vacationsWithAllowance
source: {days} days of vacation with allowance
es: {days} días de vacaciones con abono
pt: {days} dias de férias com abono

# vacationsWithoutAllowance
source: {days} days of vacation without allowance
es: {days} días de vacaciones sin abono
pt: {days} dias de férias sem abono

# rangeDate
source: {fromDate} to {toDate}
es: {fromDate} hasta {toDate}
pt: {fromDate} até {toDate}

source: Open period details
es: Detalles del período pendiente
pt: Detalhes do período em aberto

# vacationPeriod
source: Vacation days
es: Días de vacaciones
pt: Dias de férias

source: days
es: días
pt: dias

source: day
es: días
pt: dia

source: Start date
es: Fecha de inicio
pt: Data de início

# allowance
source: Vacation bonus days
es: Días de bonificación
pt: Dias de abono

source: Collective
es: Colectiva
pt: Coletiva

# errorGetVacationReceipt
source: Unable to obtain the vacation receipt for the selected vesting period.
es: No fue posible obtener el recibo de vacaciones relativo al período adquisitivo seleccionado.
pt: Não foi possível obter o recibo de férias relativo ao período aquisitivo selecionado.

# errorGetVacationReceiptDescription
source: Please contact your company's human resources or information technology department to report this issue.
es: Póngase en contacto con el departamento de recursos humanos o de tecnología de la información de su empresa para comunicar este problema.
pt: Entre em contato com o departamento de recursos humanos ou tecnologia da informação da sua empresa para comunicar este problema.

source: Full Christmas Bonus
es: Prima de Servicios sueldo completo
pt: 13º sal. integral

source: Christmas Bonus Advance
es: Anticipo 13 salario
pt: Adto 13º sal.

source: Paid period details
es: Detalles del período pagado
pt: Detalhes do período quitado

# errorUpdatingVacations
source: Oops! An error occurred while updating vacation data. Tap Repeat to try again.
es: ¡Ops! Ocurrió un error al actualizar los datos de vacaciones. Toque en Repetir para intentar nuevamente.
pt: Ops! Ocorreu um erro ao atualizar os dados de férias. Toque em Repetir para tentar novamente.

source: Yes
es: Sí
pt: Sim

source: No
pt: Não

source: None
es: Ningún
pt: Nenhum

# balanceVacationNone
source: Balance: None
es: Sueldo: ningún
pt: Saldo: Nenhum

source: Approved
es: Aprobada
pt: Aprovada

# vacationPaid
source: Paid
es: Pagada
pt: Quitada

# balanceDescription
source: Balance
es: Sueldo
pt: Saldo

source: People search
es: Búsqueda de personas
pt: Busca de pessoas

# descriptionPeopleSearch
source: Find a person by typing their name, job or department.
es: Busque a una persona escribiendo nombre, cargo o área.
pt: Busque uma pessoa digitando nome, cargo ou área.

# noPersonFound
source: No person was found with this entered term
es: No se identificaron personas con el término
pt: Nenhuma pessoa foi encontrada com o termo digitado.

# descriptionNoPersonFound
source: Remember to search by name, job or department.
es: Recuerde buscar por nombre, cargo o área.
pt: Lembre-se de procurar por nome, cargo ou área.

# noPersonFoundToFeedbackDescription
source: Remember to find coworkers by typing the name or surname.
es: Recuerda encontrar a tus compañeros de trabajo escribiendo el nombre o apellido.
pt: Lembre-se de encontrar colegas de trabalho digitando o nome ou sobrenome.

# errorLoadingMorePeople
source: An error occurred while trying to load more people. Tap Repeat to try again.
es: Ocurrió un error al intentar cargar más personas. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar carregar mais pessoas. Toque em Repetir para tentar novamente.

# errorLoadingPeople
source: An error occurred while finding people with the entered terms. Tap Repeat to try again.
es: Ocurrió un error al intentar buscar a las personas con los términos escritos. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar buscar as pessoas com os termos digitados. Toque em Repetir para tentar novamente.

# noActiveContractHR
source: No employment contract
es: No hay contrato de trabajo
pt: Sem contrato de trabalho

# noActiveContractHRMessageRequest
source: The features are not available for use because you do not have an active employment contract. Please contact your company's human resources department to report this issue.
es: Usted no tiene un contrato activo y por eso las funcionalidades no están liberadas para su uso. Póngase en contacto con el departamento de recursos humanos de su empresa para comunicar este problema.
pt: Você não possui um contrato de trabalho ativo e por este motivo as funcionalidades não estão liberadas para uso. Entre em contato com o departamento de recursos humanos da sua empresa para comunicar este problema.

source: Public profile
es: Perfil Público
pt: Perfil público

# errorOnGetPublicProfile
source: An error occurred while obtaining information from the person's public profile. Tap Repeat to try again.
es: Ocurrió un error al obtener las informaciones del perfil público de la persona. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao obter as informações do perfil público da pessoa. Toque em Repetir para tentar novamente.

# bornOnMale
source: Born on
es: Nacido en
pt: Nascido em

# bornOnFemale
source: Born on
es: Nacida en
pt: Nascida em

# bornOnGeneric
source: Born on
es: Nacida(o) en
pt: Nascido(a) em

source: autonomy
es: Autonomía
pt: autonomia

source: and interaction
es: y interacción
pt: e interação

source: in the palm
es: en la palma
pt: na palma

source: of your hand
es: de su mano
pt: da sua mão

# nextBirthdays
source: Upcoming birthdays
es: Próximas(os) cumpleañeras(os)
pt: Próximos aniversariantes

# errorOnLoadBirthdayEmployees
source: An error occurred while searching for birthdays in the next 15 days.
es: Ocurrió un error al buscar a las(los) cumpleañeras(os) de los próximos 15 días.
pt: Ocorreu um erro ao buscar os aniversariantes dos próximos 15 dias.

# noBirthdayEmployeesFoundMessage
source: No birthdays were found in the next 15 days.
es: No fueron encontradas(os) cumpleañeras(os) en los próximos 15 días.
pt: Não foram encontrados aniversariantes nos próximos 15 dias.

# errorOnLoadMoreBirthdayEmployeesMessage
source: An error occurred while trying to load more birthdays. Tap Repeat to try again.
es: Ocurrió un error al intentar cargar más cumpleañeras(os). Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar carregar mais aniversariantes. Toque em Repetir para tentar novamente.

# nextCompanyBirthdays
source: Upcoming company anniversaries
es: Próximas(os) Cumpleañeras(os) de empresa
pt: Próximos aniversariantes de empresa

# errorWhenSearchingCompanyBirthdays
source: No company anniversaries were found in the next 15 days.
es: Ocurrió un error al buscar a las cumpleañeras(os) de empresa en los próximos 15 días.
pt: Ocorreu um erro ao buscar os aniversariantes de empresa nos próximos 15 dias.

# errorOnLoadMoreBirthdayCompanyMessage
source: An error occurred while trying to load more company anniversaries. Tap Repeat to try again.
es: Ocurrió un error al intentar cargar más cumpleañeras(os). Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao tentar carregar mais aniversariantes. Toque em Repetir para tentar novamente.

# noCompanyEmployeesFoundMessage
source: An error occurred while searching for company anniversaries in the next 15 days.
es: No fueron encontradas(os) cumpleañeras(os) de empresa en los próximos 15 días.
pt: Não foram encontrados aniversariantes de empresa nos próximos 15 dias.

source: year
es: año
pt: ano

source: years
es: años
pt: anos

source: How's your mood today?
es: ¿Cómo está su humor hoy?
pt: Como está seu humor hoje?

# happinessIndexConfirmationTitle
source: Do you want to confirm?
es: ¿Desea confirmar?
pt: Deseja confirmar?

# happinessIndexConfirmationMessage
source: By performing this action, you will set your mood today as "{moodDescription}". This setting can no longer be changed today.
es: Al realizar esta acción, usted irá definir su sentimiento de hoy como "{moodDescription}". Essa configuração não poderá mais ser alterada na data de hoje.
pt: Ao realizar esta ação, você irá definir o seu sentimento de hoje como "{moodDescription}". Essa configuração não poderá mais ser alterada na data de hoje.

# happinessIndexCancelButton
source: No, I want to change
es: No, yo deseo cambiar
pt: Não, eu desejo mudar

# happinessIndexConfirmButton
source: Yes, I feel like that
es: Sí, yo me siento así
pt: Sim, eu me sinto assim

# happinessIndexIncredible
source: Amazing
es: Increíble
pt: Incrível

# happinessIndexFine
source: Good
es: Bien
pt: Bem

# happinessIndexUpset
source: Bad
es: Mal
pt: Mal

# happinessIndexAngry
source: Awful
es: Horrible
pt: Horrível

# happinessIndexSuccessMessage
source: Your today's mood was successfully defined. Come back tomorrow to define your mood again.
es: ¡Su sentimiento de hoy fue definido con éxito! Vuelva mañana para informar su sentimiento nuevamente.
pt: O seu sentimento de hoje foi definido com sucesso. Volte amanhã para informar o seu sentimento novamente.

# happinessIndexErrorMessage
source: An error occurred while defining your today's mood.
es: Ocurrió un error al definir su sentimiento de hoy.
pt: Ocorreu um erro ao definir o seu sentimento de hoje.

source: Privacy policy
es: Política de privacidad
pt: Política de privacidade

# privacyPolicyErrorMessage
source: An error occurred while loading the privacy policy. Please try again later.
es: Ocurrió un error al cargar la política de privacidad. Por favor intente nuevamente más tarde.
pt: Ocorreu um erro ao carregar a política de privacidade. Por favor, tente novamente mais tarde.

source: Next
es: Avanzar
pt: Avançar

# jump
source: Skip
es: Saltar
pt: Pular

# onboardingMainTextFirstPresentation
source: Welcome to Waapi, the app for companies that
es: Bienvenidas(os) a Waapi, la aplicación de empresas que
pt: Boas vindas ao Waapi, o aplicativo de empresas que

# onboardingUseSenior
source: use Senior
es: utilizan Senior
pt: usam a Senior

# onboardingTo
source: to
es: para
pt: para se

# onboardingConnect
source: connect
es: conectarse
pt: conectar

# onboardingWithYourCollaborators
source: with their workers.
es: con sus colaboradores(as).
pt: com seus colaboradores.

# onboardingMainTextSecondPresentation
source: In order to use
es: Para utilizarla,
pt: Para utilizar o

# onboardingMainTextSecondAdditional
source: , your company must be a Senior client.
es: es necesario que su empresa sea socia de Senior.
pt: , é necessário que sua empresa seja cliente da Senior.

# onboardingQuestionCompany
source: Is your company a client?
es: ¿Su empresa no es cliente?
pt: Sua empresa não é cliente?

# onboardingSecondMeet
source: Get to know
es: Conozca
pt: Conheça a

# onboardingSecondMeetIos
source: Contact the HR department of your company and recommend
es: Póngase en contacto con el departamento de RRHH de su empresa e indique a Senior Sistemas
pt: Entre contato com o RH da sua empresa e indique a

# onboardingMainTextThirdPresentation
source: If you are already a client, you also need access to the
es: Si ya es cliente, tambiém es necesario tener acceso a la plataforma
pt: Se já é cliente, também é necessário ter acesso à plataforma

# onboardingSeniorX
source: Senior X platform.
es: Senior X
pt: Senior X.

# onboardingGetAccess
source: Learn how to get access:
es: Saiba como ter acesso:
pt: Saiba como ter acesso:

source: Finish
es: Concluir
pt: Concluir

# configPushNotifications
source: Push notifications
es: Notificaciones por push
pt: Notificações por push

# pushNotificationDisabled
source: Push notifications are disabled
es: Notificaciones por push desactivada
pt: Notificações por push desabilitadas

# tourHomeDescription
source: On the home screen, you can find your main shortcuts at the top, your latest feedback, company anniversaries, birthdays, and you can also express how you are feeling.
es: En la pantalla Home, usted tiene los principales atajos en la parte superior, sus últimas retroalimentaciones recibidas, cumpleañeras(os) de empresa, cumpleañeras(os) de vida, y puede expresar como está se sintiendo.
pt: Na tela de início, você tem seus principais atalhos no topo, seus últimos feedbacks recebidos, aniversariantes de empresa, aniversários de vida, e pode expressar como está se sentindo.

# tourFeedbackDescription
source: Request, send and return positive or constructive feedback, to give recognition to co-workers and celebrate the important moments lived in the company.
es: Solicite, envie y retribuya retroalimentaciones positivas o constructivas, para reconocer colegas de trabaljo y celebrar los momentos importantes vividos en la empresa.
pt: Solicite, envie e retribua feedbacks positivos ou construtivos, para reconhecer colegas de trabalho e celebrar os momentos importantes vividos na empresa.

# anniversaries
source: Birthdays
es: Cumpleañeras(os)
pt: Aniversariantes

# tourAnniversariesDescription
source: Find out the upcoming birthdays and company anniversaries, and take the opportunity to send feedback.
es: Sepas quién está cumpliendo años de casa o de vida y aproveche para enviar una retroalimentación.
pt: Saiba quem está prestes a completar anos de casa e de vida e aproveite para enviar um feedback.

source: Mood diary
es: Diario de humor
pt: Diário de humor

# tourHappinessIndexDescription
source: Many things can change our mood on a daily basis and it is good to be able to show the company how we are feeling. Feel free to express yourself at any time of the day.
es: Muchas coias pueden cambiar nuestro humor en el día y es bueno poder mostrar para la empresa como estamos nos sintiendo. Es libre para se expresar cuando quiera durante el día.
pt: Muitas coisas podem mudar nosso humor no dia a dia e é bom poder mostrar para a empresa como estamos nos sentindo. Sinta-se livre para se expressar a qualquer hora do dia.

# tourVacationsDescription
source: Now you can check your open periods and your vacation record. Do you already have your plans in mind?
es: Ahora usted puede conferir sus períodos pendientes y sus historiales de vacaciones.
pt: Agora você pode conferir seus períodos em aberto e seu histórico de férias. Já tem em mente seus planos?

# tourVacationsTitle
source: Check your vacation
es: Confiera sus vacaciones
pt: Confira suas férias

# reviewTour
source: View tour again
es: Visualizar el tour nuevamente
pt: Visualizar o tour novamente

# errorOnReceivedFeedbackNotFound
source: The feedback you want to view is no longer available. It might have been deleted by the person who sent it and therefore we cannot access it.
es: La retroalimentación que usted desea visualizar ya no está disponible. Puede haber sido eliminada por la persona que la envió y por eso no tenemos como accesarla.
pt: O feedback que você deseja visualizar não está mais disponível. Ele pode ter sido excluído pela pessoa que o enviou e por isso não temos como acessá-lo.

# errorNetwork
source: No internet connection
es: Sin conexión con la Internet
pt: Sem conexão com a internet

# errorNetworkDescription
source: Please check your internet connection and try again.
es: Verifique su conexión con la Internet y intente nuevamente
pt: Verifique sua conexão com a internet e tente novamente.

# errorOnGetHappinessIndex
source: An error occurred while obtaining your mood for today.
es: Ocurrió un error al recibir su sentimiento de hoy.
pt: Ocorreu um erro ao obter seu sentimento de hoje.

# vacationReceiptPeriod
source: Vesting period
es: Período de adquisición
pt: Período aquisitivo

# noCompetenceFound
source: No competence was found with this entered term
es: No se encontró ninguna competencia con el término introducido
pt: Nenhuma competência foi encontrada com o termo digitado

# noCompetenceFoundDescription
source: Clear the search to view all competences.
es: Elimine la búsqueda para ver todas las competencias.
pt: Limpe a busca para visualizar todas as competências.

# recentsFeedbackReceivedEmptyState
source: You have not received any feedback recently.
es: No has recibido ninguna retroalimentación recientemente.
pt: Você não recebeu nenhum feedback recentemente.

# periodsCurrent
source: Current period
es: Período corriente
pt: Período atual

# periodsFuture
source: Future periods
es: Períodos futuros
pt: Períodos futuros

# vacationsAnalyticsHeader
source: Vacation summary
es: Libro de vacaciones
pt: Resumo das férias

# vacationsAnalyticsBalance
source: Balance
es: Días disponibles
pt: Saldo

# vacationsAnalyticsProportional
source: Proportional
es: Días causados
pt: Proporcional

# vacationsAnalyticspastDueBalance
source: Expired
es: Periodos vencidos
pt: Vencidas

# vacationsAnalyticspastDoubled
source: Double
es: Dobradas*
pt: Dobradas

# vacationsAnalyticsErrorState
source: An error occurred while loading the vacation summary.
es: Ocurrió un error al cargar el libro de vacaciones.
pt: Ocorreu um erro ao carregar o resumo das férias.

# waitingApproval
source: Awaiting approval
es: En espera de aprobación
pt: Aguardando aprovação

source: Attach file
es: Adjuntar archivo
pt: Anexar arquivo

source: Loading
es: Cargando
pt: Carregando

# errorLoadingAttachment
source: Error while loading attachment. To proceed, try again or delete the attachment.
es: Error al cargar anexo. Para continuar, inténtelo de nuevo o elimine el archivo adjunto.
pt: Erro ao carregar o anexo. Para prosseguir, tente novamente ou exclua o anexo.

# noReceiptsRequest
source: There are no receipts in the request.
es: No hay comprobantes en la solicitación.
pt: Não há comprovantes na solicitação.

# deleteAttachment
source: Do you want to delete the attachment?
es: ¿Desea eliminar el anexo?
pt: Deseja excluir o anexo?

# uploadAgain
source: After executing this action, it is necessary to upload the attachment again.
es: Después de realizar esta acción será necesario volver a subir el archivo adjunto.
pt: Após realizar essa ação será necessário fazer o upload do anexo novamente.

# deleteError
source: An error occurred while deleting the attachment. Tap Repeat to try again.
es: Ocurrió un error al eliminar el anexo. Pulse repetir para volver a intentarlo
pt: Ocorreu um erro ao excluir o anexo. Toque em repetir para tentar novamente

# deletedAttachment
source: Attachment deleted successfully
es: Anexo eliminado con éxito
pt: Anexo excluído com sucesso

source: Attach
es: Anexar
pt: Anexar

source: Receipt photo
es: Foto del comprobante
pt: Foto do comprovante

source: Request
es: Solicitud
pt: Solicitar

source: Request vacation
es: Solicitud de vacaciones
pt: Solicitar férias

# selectPeriod
source: Select the period
es: Seleccione el período
pt: Selecione o período

source: Vacation days
es: Días Disfrutados
pt: Dias das férias

# mandatoryItem
source: Indicates a mandatory item
es: Indica un elemento obligatorio
pt: Indica item obrigatório

# vacationPeriodBegin
source: Define how many days and when to begin
es: Cuántos días y cuándo va a empezar
pt: Informe quantos dias e quando iniciará

# vacationDaysHelper
source: Define the number of days during which you will be on vacation.
es: Introduzca el número de días que disfrutará
pt: Informe a quantidade de dias nos quais você ficará de férias.

# startDateVacation
source: I would like to start my vacation on
es: Me gustaría empezar mis vacaciones en
pt: Gostaria de iniciar as férias em

# startDateVacationHelper
source: Define the start date of your vacation.
es: Introduzca la fecha de inicio del disfrute.
pt: Informe a data de início das suas férias.

# additionalInfo
source: Additional information
es: Informaciones adicionales
pt: Informações adicionais

# christmasBonus
source: I want to receive a Christmas Bonus advance.
es: Deseo recibir un anticipo de mi prima de servicios.
pt: Desejo receber adiantamento de décimo terceiro salário.

# vacationBonus
source: I want an allowance of up to 1/3 of my vacation.
es: Deseo recibir en diñero hasta 1/3 de mis vacaciones.
pt: Desejo abonar até 1/3 do meu direito de férias.

# vacationBonusHelper
source: Define the number of days that you want to receive as vacation bonus.
es: Informe la cantidad de días de vacaciones en dinero.
pt: Informe a quantidade de dias que deseja abonar de suas férias.

# invalidVacationBonusDays
source: Enter a valid number of vacation bonus days.
es: Ingrese un número válido de días de abono de vacaciones.
pt: Informe um número válido de dias de abono de férias.

# maxVacationBonusDays
source: You can request up to {maxBonusDays} vacation bonus days.
es: Puede solicitar hasta {maxBonusDays} días de abono de vacaciones.
pt: Você pode solicitar no máximo {maxBonusDays} dias de abono de férias.

# maxVacationDays
source: You can request up to {maxDays} vacation days.
es: Puede solicitar hasta {maxDays} días de vacaciones.
pt: Você pode solicitar no máximo {maxDays} dias de férias.

source: Notes
es: Observaciones
pt: Observações

source: Note
es: Observación
pt: Observação

# receiptTipsOptional
source: You may select a receipt to help with the approval of the request (optional).
es: Puede introducir un comprobante para ayudar a la aprobación de la solicitud (opcional).
pt: Você pode informar um comprovante para auxiliar na aprovação da solicitação (opcional).

source: Receipts
es: Comprobantes
pt: Comprovantes

# receiptTipsImage
source: Place the receipt at the center of the image.
es: Deje el comprobante en el centro de la imagen.
pt: Deixe o comprovante no centro da imagem.

# receiptTipsLegible
source: Make sure the information can be read.
es: Asegúrese de que la información es legible.
pt: Certifique-se de que as informações estão legíveis.

# wrongAlert
source: Looks like something is wrong
es: Algo parece estar mal
pt: Parece que algo está errado

source: Review form
es: Revisar el formulario
pt: Revisar formulário

source: Back
es: Volver
pt: Voltar

# requestVacationSubmitted
source: The vacation programming request has been submitted. You will receive an answer soon.
es: La solicitud de programación de vacaciones fue enviada. En breve recibirá una respuesta.
pt: A solicitação de programação de férias foi enviada. Você receberá um retorno em breve.

# formCorrectionAlert
source: Form correction points
es: Puntos de corrección del formulario
pt: Pontos de correção do formulário

source: Cancel request
es: Cancelar solicitud
pt: Cancelar solicitação

# cancelRequestAlert
source: Are you sure you want to cancel this vacation request?
es: ¿Está seguro de que quiere cancelar esta solicitud de vacaciones?
pt: Você tem certeza que deseja cancelar essa solicitação de férias?

source: View calendar
es: Ver calendario
pt: Ver calendário

source: Vacation Details
es: Detalles de Vacaciones
pt: Detalhes das férias

# adjustmentPeriod
source: There are adjustments to be made in this period.
es: Hay que realizar ajustes en este periodo.
pt: Existem ajustes a serem feitos neste período.

# successCancelRequest
source: The vacation scheduling request has been canceled.
es: La solicitud de programación de vacaciones ha sido cancelada.
pt: A solicitação de programação de férias foi cancelada.
