Repository: felipeduarte26/waapi-flutter-module
Catalog: packages/ponto-mobile-collector/lib/l10n/app_*.arb
Languages: es, pt

source: Hello World!
es: ¡Hola Mundo!
pt: Olá Mundo!

# dateFormatClock
source: MMM d, yyyy
es: d 'de' MMMM 'de' y
pt: d 'de' MMMM 'de' y

source: Share
es: Compartir
pt: Compartilhar

source: Close
es: Cerrar
pt: Fechar

# appointmentReceipt
source: Clocking event receipt
es: Comprobante de Marcación
pt: Comprovante de marcação

# cardReceiptData
source: Date
es: Fecha
pt: Data

# cardReceiptTime
source: Time
es: Hora
pt: Horário

# cardReceiptZone
source: Time Zone
es: Zona
pt: Fuso

# cardReceiptEmployeeName
source: Employee
es: Empleado
pt: Colaborador

# cardReceiptCompanyName
source: Company
es: Empresa
pt: Empresa

# cardReceiptIdentification
source: Clocking event identifier
es: Identificador de marcación
pt: Identificação da Marcação

# hoursWorked
source: Hours worked today
es: Horas trabajadas hoy
pt: Horas trabalhadas hoje

source: Breaks
es: Intervalos
pt: Intervalos

source: Last clocking event
es: Última marcación
pt: Última marcação

source: Last clocking events
es: Últimas marcaciones
pt: Últimas marcações

# breakTime
source: %t break
es: Intervalo de %t
pt: Intervalo de %t

# whenRegistered
source: When registered, they will appear here
es: Cuando se registren, aparecerán aquí
pt: Quando registrar, elas aparecerão aqui

# todaysClockinEvents
source: Today's clocking events
es: Marcaciones de hoy
pt: Marcações de hoje

# noClockingEvents
source: No clocking events registered today.
es: No hay marcaciones registradas hoy.
pt: Não há marcações registradas hoje

source: Loading...
es: Cargando...
pt: Carregando...

source: Device situation
es: Novedad del dispositivo
pt: Situação do dispositivo

# goToLogin
source: Exit
es: Salir
pt: Sair

# deviceAuthorizationIsPending
source: The Time Control function is not activated for this device due to pending HR authorization.
es: La función Punto no está activada para este dispositivo debido a una autorización pendiente de RH.
pt: A função de Ponto não está ativada para este dispositivo devido à autorização pendente do RH.

# deviceAuthorizationWasRejected
source: The Time Control function is not activated for this device due to authorization rejected by HR.
es: La función Punto no está activada para este dispositivo debido a autorización rechazada por RH.
pt: A função de Ponto não está ativada para este dispositivo devido à autorização rejeitada pelo RH.

# deviceActivationIsPending
source: The Time Control function is not activated for this device due to pending HR authorization.
es: La función Punto no está activada para este dispositivo debido a una activación pendiente por parte de RH.
pt: A função de Ponto não está ativada para este dispositivo devido à ativação pendente do RH.

# deviceActivationWasRejected
source: The Time Control function is not activated for this device due to authorization rejected by HR.
es: La función Punto no está activada para este dispositivo debido a una activación rechazada por RH.
pt: A função de Ponto não está ativada para este dispositivo devido à ativação rejeitada pelo RH.

# clockingEventSingleNotAvailable
source: Clocking event is not available in individual mode for your user
es: La marcación del punto no está disponible para el modo individual para su usuario
pt: A Marcação de ponto não está disponível para o modo individual para o seu usuário

# contactRh
source: Please contact HR or go to a collective device to clock in.
es: Por favor, contacte con el RRHH y/o diríjase a un dispositivo colectivo para registrar el punto.
pt: Por favor, contate o RH ou se dirija a um dispositivo coletivo para registrar o ponto.

source: Clocking events
es: Marcaciones
pt: Marcações

# rangeDate
source: {fromDate} to {toDate}
es: {fromDate} hasta {toDate}
pt: {fromDate} até {toDate}

# menuItemHome
source: Home
es: Inicio
pt: Início

# menuItemAppointment
source: Clocking events
es: Marcaciones
pt: Marcações

# menuItemTime
source: Hours
es: Horas
pt: Horas

# menuItemProfile
source: Profile
es: Perfil
pt: Perfil

# clockingEventTitle
source: Clocking Event
es: Punto
pt: Ponto

# clockingEventGoodMorning
source: Good morning
es: Buenos días
pt: Bom dia

# clockingEventGoodAfternoon
source: Good afternoon
es: Buenas tardes
pt: Boa tarde

# clockingEventGoodEvening
source: Good evening
es: Buenas noches
pt: Boa noite

# clockingEventCaptureTime
source: Register clocking event
es: Registrar punto
pt: Registrar ponto

# clockingEventCapturingTime
source: Clocking event in progress
es: Realizando marcación
pt: Realizando marcação

# clockingEventKeepButtonPressedToRegister
source: Keep the button pressed to register
es: Mantenga pulsado el botón para registrar
pt: Mantenha o botão pressionado para registrar

# clockingEventAppointmentMade
source: Clocking event successful
es: Marcación hecha
pt: Marcação Realizada

# clockingEventSeeReceipt
source: View statement
es: Ver comprobante
pt: Ver comprovante

# withoutClockingEvents
source: No clocking events
es: Sin marcaciones
pt: Sem marcações

# dateFormatter
source: MM/dd/yyyy
es: dd/MM/yyyy
pt: dd/MM/yyyy

source: Period
es: Período
pt: Período

# oddClockingEvent
source: Odd clocking events
es: Marcaciones impares
pt: Marcações ímpares

# periodClockingEvent
source: Clocking events of the period
es: Marcaciones del período
pt: Marcações do período

# lastUpdate
source: Last updated on {date} at {hour}
es: Última actualización {date} a la(s) {hour}
pt: Última atualização {date} às {hour}

# clockInfoTitle1
source: Unsynchronized clocking event
es: Marcación no sincronizada
pt: Marcação não sincronizada

# clockInfoDescription1
source: These are clocking events that were registered and will be synchronized as soon as an internet connection is available.
es: Son marcaciones que fueron registradas y se sincronizarán tan pronto como haya una conexión a Internet.
pt: São marcações que foram registradas e serão sincronizadas assim que houver conexão com a internet.

# clockInfoTitle2
source: Platform and cell phone origin
es: Origen vía móvil y plataforma
pt: Origem via celular e plataforma

# clockInfoDescription2
source: These are clocking events registered via application and the platform. They are categorized as cross events.
es: Son marcaciones que fueron registradas vía aplicación y plataforma. Se clasifican como marcación cross.
pt: São marcações que foram registradas via aplicativo e plataforma. São categorizadas como marcação cross.

# clockInfoTitle3
source: Cell phone origin
es: Origen vía móvil
pt: Origem via celular

# clockInfoDescription3
source: These are clocking events registered via application, be it the Clocking Event app or Waapi.
es: Son marcaciones que fueron registradas vía aplicación, tanto Punto como Waapi.
pt: São marcações que foram registradas via aplicativo tanto Ponto quanto Waapi.

# clockInfoTitle4
source: Platform origin
es: Origen vía plataforma
pt: Origem via plataforma

# clockInfoDescription4
source: These are clocking events registered via the platform.
es: Son marcaciones que fueron registradas vía plataforma
pt: São marcações que foram registradas via plataforma.

# clockInfoTitle5
source: Manual clocking event
es: Marcación Manual
pt: Marcação manual

# clockInfoDescription5
source: A clocking event registered manually by the manager or employee through the app or platform.
es: Marcación registrada manualmente por el gestor o empleado a través del app o plataforma.
pt: Marcações registradas manualmente pelo gestor ou colaborador através do app ou plataforma.

# clockInfoTitle6
source: Odd clocking events
es: Marcaciones impares
pt: Marcações ímpares

# clockInfoDescription6
source: It means there is one clocking event missing to complete your workday, but it may have been taken at another clocking event controller.
es: Significa que falta una marcación para que su jornada laboral esté completa, pero puede haberse realizado en otro registrador de punto.
pt: Significa que falta uma marcação para sua jornada ficar completa, porém ela pode ter sido realizada em outro registrador de ponto.

# clockInfoTitle7
source: Leave clocking events
es: Marcación con ausentismo
pt: Marcações com afastamento

# clockInfoDescription7
source: These are clocking events that have a leave registered in the workday.
es: Son marcaciones que tienen algún ausentismo registrado en la jornada laboral.
pt: São marcações que possuem algum afastamento lançado na jornada.

# infoUnderstoodButton
source: Understood
es: Entendí
pt: Entendi

# registerCameraButton
source: Register
es: Registrar
pt: Registrar

# clockingsOfTheDay
source: Clocking events of the day
es: Marcaciones del día
pt: Marcações do dia

# addClocking
source: Add clocking event
es: Agregar marcación
pt: Adicionar marcação

source: Time Control Management
es: Gestión del Punto
pt: Gestão do Ponto

# centralizingJourney
source: Centralizing the employee's journey
es: Centralizando la jornada del empleado
pt: Centralizando a jornada do colaborador

# haveControl
source: Have control of your time control journey
es: Tenga el control de su jornada del punto.
pt: Tenha o controle da sua jornada do ponto.

# shortcutsTimeControl
source: Shortcuts for Time Control Management
es: Acceso directo al Gestión del Punto
pt: Atalhos para o Gestão do Ponto

# recentClockingEventMessage
source: You clocked in/out less than 2 minutes ago. Do you want to clock in/out again?
es: Usted ha marcado el punto hace menos de 2 minutos. ¿Desea realizar otra marcación?
pt: Você marcou o ponto há menos de 2 minutos. Deseja realizar outra marcação?

# outsideTheFenceMessage
source: The current location is outside the perimeter defined by your employer. Do you wish to continue?
es: La ubicación actual está fuera del perímetro definido por su empleador. ¿Desea continuar?
pt: A localização atual está fora do perímetro definido pelo seu empregador. Deseja continuar?

# alert
source: Warning
es: Atención
pt: Atenção

source: Yes
es: Sí
pt: Sim

source: No
pt: Não

# confirmAppointment
source: Confirm clocking event
es: Confirmar marcación
pt: Confirmar marcação

# cancelAppointment
source: Do not clock in/out
es: No realizar marcación
pt: Não realizar marcação

# hoursWorkedTodayInfo
source: The amount of hours is calculated when there are paired clocking events (clock-in and clock-out), so the total is updated only when recording the end of a period.
es: Se calcula la cantidad de horas cuando hay marcaciones en pares (entrada y salida), así que solo se actualiza el total al registrar el fin de un período.
pt: A quantidade de horas é calculada quando existem marcações em pares (entrada e saída), portanto o total é atualizado apenas ao registrar o fim de um período.

# syncClockingEventSyncSuccess
source: Synchronization completed.
es: Sincronización concluda.
pt: Sincronização concluída.

# syncClockingEventSyncInternetUnavailable
source: Synchronization not completed. Check your internet connection.
es: Sincronización no ha concluido. Verifique su conexión con la internet.
pt: Sincronização não concluída. Verifique sua conexão com a internet.

# syncClockingEventSyncFailure
source: Sorry, the synchronization has failed. Please try again.
es: Perdón, la sincronización ha fallado. Intentélo oyta vez.
pt: Desculpe, ocorreu uma falha na sincronização. Tente novamente.

# configurations
source: Settings
es: Configuración
pt: Configurações

# completedAppointments
source: Clocking events made
es: Marcaciones realizadas
pt: Marcações registradas

# setKey
source: Configure application key
es: Configurar clave de aplicación
pt: Configurar chave da aplicação

source: Permissions
es: Permisos
pt: Permissões

# syncAppointInfo
source: Synchronize time information
es: Sincronizar información del punto
pt: Sincronizar informações do ponto

# resources
source: Features
es: Recursos
pt: Recursos

source: Facial recognition registration
es: Registro de reconocimiento facial
pt: Cadastro de reconhecimento facial

# facialRecognitionRegistrationDescription
source: Register facial recognition for a new employee
es: Registrar reconocimiento facial de un nuevo empleado
pt: Cadastrar reconhecimento facial de um novo colaborador

source: Read WEB QRcode
es: Leer QR Code Web
pt: Ler QRcode WEB

# readWebQRCodeDescription
source: Use device to register facial recognition of a new employee
es: Usar dispositivo para registrar reconocimiento facial de un nuevo empleado
pt: Usar dispositivo para cadastrar reconhecimento facial de um novo colaborador

# othersResources
source: Other
es: Otros
pt: Outros

source: Help
es: Ayuda
pt: Ajuda

source: Help center
es: Central de ayuda
pt: Central de ajuda

source: View tour again
es: Ver tour novamente
pt: Visualizar tour novamente

source: Privacy policy
es: Política de privacidad
pt: Política de privacidade

source: About
es: Sobre
pt: Sobre

# signOut
source: Log out
es: Salir
pt: Sair

# clockingEventNotAvailable
source: The clocking event is not available to your user.
es: La marcación de punto no está disponible para su usuario.
pt: A marcação de ponto não está disponível para seu usuário.

# descriptionClockingEventNotAvailable
source: Please wait or contact HR for more information.
es: Por favor, espere o contacte con RRHH para saber más.
pt: Por favor, aguarde ou contate o RH para obter mais informações.

# toView
source: View
es: Ver
pt: Visualizar

# successClockingEvent
source: Clocking event made at {hour} on {date} for {name}
es: Marcación realizada a la(s) {hour} en del {date} para {name}
pt: Marcação realizada às {hour} no dia {date} para {name}

# configurationReminders
source: Configure clocking event reminders
es: Configurar recordatorio del punto
pt: Configurar lembretes do ponto

# configurationNotifications
source: Configure settings
es: Configurar notificaciones
pt: Configurar notificações

# configurationRegisteredClock
source: Registered clocking events
es: Marcaciones registradas
pt: Marcações registradas

# configurationReports
source: Reports
es: Informes
pt: Relatórios

# configurationAppReview
source: App rating
es: Evaluación de la aplicación
pt: Avaliação do aplicativo

# configurationSearch
source: Search
es: Búsqueda
pt: Pesquisa

# configurationViewTourAgain
source: View tour again
es: Ver gira nuevamente
pt: Visualizar tour novamente

# configurationSynchronizationSuccessfully
source: Synchronization successful.
es: Sincronización realizada con éxito.
pt: Sincronização realizada com sucesso.

# configurationSynchronizationError
source: Could not synchronize the clocking events information at the moment. Please try again later.
es: No ha sido posible sincronizar la información del punto en el momento. Inténtelo de nuevo más tarde.
pt: Não foi possível sincronizar as informações do ponto no momento. Tente novamente mais tarde.

# facialTryAgain
source: Try again
es: Inténtalo de nuevo
pt: Tentar novamente

# facialRegistrationCompletedSuccessfully
source: Registration successful!
es: ¡Registro realizado con éxito!
pt: Cadastro realizado com sucesso!

# facialBackStart
source: Back home
es: Volver al inicio de la página
pt: Voltar ao início

# facialPerformingPhotoAnalysis
source: Analyzing photo...
es: Analizando la foto...
pt: Realizando análise da foto...

# facialLooksLikeAreOffline
source: No internet connection
es: Sin conexión con la internet
pt: Sem conexão com a internet

# facialRegistrationOnlineCheckConnection
source: The initial registration must be done connected to the internet. Check your connection and try again.
es: El registro inicial debe hacerse en línea. Verifique su conexión y inténtelo de nuevo.
pt: O cadastramento inicial deve ser feito conectado à internet. Verifique sua conexão e tente novamente.

# facialCheckingInformation
source: Verifying information...
es: Verificación de la información...
pt: Verificando informações...

# facialTipsFacialRecognition
source: Facial recognition tips
es: Consejos para el reconocimiento facial
pt: Dicas para o reconhecimento facial

# facialFollowInstructionsCapture
source: Follow the instructions for a good capture
es: Siga las instrucciones para una buena captura
pt: Siga as instruções para uma boa captura

# facialPositionCellPhoneEyeCamera
source: Position your cell phone at eye level and look directly to the camera;
es: Coloque el teléfono celular a la altura de los ojos y mire directamente a la cámara;
pt: Posicione o celular na altura dos seus olhos e olhe diretamente para a câmera;

# facialBeBrightEnvironmentPeopleBackground
source: Stay in a well-lit environment, without people and objects in the background;
es: Sitúese en un entorno bien iluminado, sin personas ni objetos de fondo;
pt: Esteja em um ambiente iluminado, sem pessoas e objetos ao fundo;

# facialAvoidWearingAccessoriesGlasses
source: Avoid using accessories that hide your face, such as glasses, caps, masks and hats;
es: Evite llevar accesorios que oculten su rostro, como gafas, gorras, máscaras y sombreros;
pt: Evite usar acessórios que escondam seu rosto, como óculos, bonés, máscaras e chapéus;

# facialAvoidShakingYourCellPhone
source: Avoid shaking your cell phone during the capture;
es: Evite agitar el teléfono celular durante la captura;
pt: Evite tremer o seu celular durante a captura;

# facialAvoidMakingFacesOrExpressions
source: Avoid making expressions that may interfere in the quality of the capture;
es: Evite hacer muecas o expresiones que puedan interferir en la calidad de la captura;
pt: Evite fazer caretas ou expressões que possam interferir na qualidade da captura;

# facialIfNecessaryAskHelpCamera
source: If necessary, ask another person for help and activate the back camera of your cell phone.
es: Si es necesario, pida ayuda a otra persona y active la cámara trasera de su celular.
pt: Se achar necessário, peça ajuda a outra pessoa e ative a câmera traseira do seu celular.

# facialStartReconnaissance
source: Start recognition
es: Empezar reconocimiento
pt: Iniciar reconhecimento

# facialPhotoCapture
source: Photo capture
es: Captura de la foto
pt: Captura de foto

# facialPositionFaceToCapture
source: Position your face to capture
es: Posicione su rostro a capturar
pt: Posicione o rosto para capturar

# facialFacialRecognition
source: Facial recognition
es: reconocimiento facial
pt: Reconhecimento facial

# facialFacialRecognitionMultiMode
source: Register by face
es: Registro por rostro
pt: Registrar por rosto

# recognitionMultiModeInProgress
source: Wait...
es: Espere...
pt: Aguarde...

# recognitionMultiModeDoSync
source: No registered faces were found. Perform face registration or synchronization to proceed with the clocking event.
es: No encontramos rostros registrados. Regístrelos o sincronízalos para proceder con la marcación.
pt: Não encontramos nenhuma face cadastrada. Realize o cadastramento de faces ou sincronização para prosseguir com a marcação.

# facialModalAlertTitle
source: Are you sure you want to register without facial recognition?
es: ¿Está seguro de que desea registrarse sin reconocimiento facial?
pt: Tem certeza que deseja registrar sem reconhecimento da face?

# facialModalAlertTryOtherWay
source: Try a different way
es: Inténtalo de otra manera
pt: Tentar outra forma

# facialModalAlertTryOtherWayDescription
source: If you can't register using facial recognition, try a different way of registering your clocking event.
es: Si no logra realizar el registro por reconocimiento facial, intente otra forma de registrar su marcación.
pt: Caso não consigo realizar o registro por reconhecimento facial tente outra forma para registrar sua marcação

# facialModalAlertContent
source: The clocking event will be done without the register of the facial recognition.
es: La marcación de punto se realizará sin el registro del reconocimiento facial.
pt: A marcação de ponto será realizada sem registro do reconhecimento facial.

# facialModalAlertBackButton
source: Go back
es: Volver
pt: Voltar

# facialModalAlertProceedButton
source: Register without the face
es: Registrar sin rostro
pt: Registrar sem face

# facialInitTechnologyTitle
source: Initializing technology
es: Inicializando la tecnología
pt: Inicializando tecnologia

# facialInitTechnologyContent
source: While facial recognition technology is being initialized, clocking events will be done without face identification.
es: Mientras se inicializa la tecnología de reconocimiento facial, la marcación de punto se hará sin identificación facial.
pt: Enquanto é iniciada a tecnologia de reconhecimento facial, a marcação de ponto será feita sem a identificação de face.

# facialRecognitionRegistrationQuestion
source: Registering for facial recognition?
es: ¿Registrar reconocimiento facial?
pt: Realizar o cadastro de reconhecimento facial?

# facialRecognitionRegistrationInformation
source: You haven't yet registered your face for clocking events with facial recognition. Register now and ensure your data is more secure and faster.
es: Aún no ha registrado su rostro para el registro de punto con reconocimiento facial. Regístrese ahora y asegúrese de que sus datos están más seguros y son más rápidos.
pt: Você ainda não cadastrou seu rosto para registro do ponto com reconhecimento facial. Cadastre agora e garanta mais segurança e agilidade dos seus dados.

# facialRegisterNow
source: Register now
es: Regístrese ahora
pt: Cadastrar agora

# facialCouldNotanalyzePhoto
source: Unable to analyze the photo
es: No ha sido posible analizar la foto
pt: Não foi possível analisar a foto

# facialTryAgainLater
source: Try again or wait a few moments to repeat the action.
es: Vuelva a intentarlo o espere unos instantes para repetir la acción.
pt: Tente novamente ou aguarde alguns instantes para repetir a ação.

# facialNotIdentifiedFace
source: Face not identified
es: Rostro no identificado
pt: Rosto não identificado

# facialLowQualityPhoto
source: The photo is low quality or blurry.
es: La foto es de baja calidad o está borrosa.
pt: A foto está com baixa qualidade ou desfocada.

# facialFaceIsntVisible
source: Make sure your face is visible and within the frame and try again.
es: Asegúrese de que su rostro está visible y dentro del encuadre e inténtelo de nuevo.
pt: Certifique-se de que seu rosto esteja visível e dentro do enquadramento e tente novamente.

# facialRecognitionRegistrationSoonAvailable
source: In a few minutes, facial recognition clocking events will be available to you.
es: La marcación por reconocimiento facial estará disponible en unos minutos.
pt: Dentro de alguns minutos a marcação por reconhecimento facial já estará disponível para você.

# facialFaceAlreadyRegistered
source: Face already registered!
es: ¡Rostro ya registrado!
pt: Rosto já cadastrado!

# facialRecognitionRegistrationAvailable
source: Facial recognition clocking event is now available.
es: La marcación por reconocimiento facial ya está disponible.
pt: A marcação por reconhecimento facial já está disponível.

# facialRecognitionRegistrationEmployee
source: Register facial recognition
es: Registro reconocimiento facial
pt: Cadastro reconhecimento facial

# facialSelectEmployeeTitle
source: Select the employee you want to register the facial recognition
es: Seleccione el empleado que desea registrar el reconocimiento facial
pt: Selecione o colaborador que deseja cadastrar o reconhecimento facial

# enterRrSearchForTheCollaborator
source: Type in or search for the employee
es: Digite o busque el empleado
pt: Digite ou busque o colaborador

source: Employee list
es: Lista de empleados
pt: Lista de colaboradores

# continueText
source: Continue
es: Continuar
pt: Continuar

# collaborator
source: Employee
es: Empleado
pt: Colaborador

source: User without permission
es: Usuario sin permiso
pt: Usuário sem permissão
