Repository: felipeduarte26/waapi-flutter-module
Catalog: packages/ponto-mobile-collector/lib/l10n/app_*.arb
Languages: es, pt

# userWithoutPermissionDescription
source: Please contact HR to check your user's permission.
es: Póngase en contacto con RRHH para verificar el permiso de su usuario.
pt: Por favor, contate o RH para verificar a permissão do seu usuário.

source: Unresponsive service
es: Servicio sin respuesta
pt: Serviço sem resposta

# unresponsiveServiceDescription
source: Unable to establish a connection with the clocking events service.
es: No ha sido posible establecer la conexión con el servicio de marcación de punto.
pt: Não foi possivel estabelecer uma conexão com o serviço de marcação de ponto.

# facialUserNoPermissionTitle
source: User without permission
es: Usuario sin permiso
pt: Usuário sem permissão

# facialUserNoPermissionMessage
source: Please contact HR to check your user's permission.
es: Por favor, póngase en contacto con RRHH para verificar el permiso de su usuario.
pt: Por favor, contate o RH para verificar a permissão do seu usuário.

# registerWithoutConfirm
source: Register clocking event without confirmation?
es: ¿Está seguro que desea registrar sin la confirmación?
pt: Tem certeza que deseja registrar sem a confirmação?

# willRegisterWithoutPhoto
source: Clocking event will be completed without photo confirmation.
es: El registro del punto será realizado sin la confirmación de la foto.
pt: O registro de ponto será realizado sem a confirmação de foto.

source: Register without photo
es: Registrar sin foto
pt: Registrar sem foto

source: Re-register
es: Volver a registrar
pt: Recadastrar

# permissionCameraNotAllowedMessage
source: To use facial recognition and photo capture after clocking in, you must allow access to the device's camera. This information is not mandatory, but complements your entry.
es: Para utilizar el reconocimiento facial y la captura de fotos después de marcar, es necesario permitir el acceso a la cámara del dispositivo. Esta información no es obligatoria, pero complementa su registro.
pt: Para utilizar o reconhecimento facial e captura de foto após marcação, é necessário permitir acesso à câmera do dispositivo. Essa informação não é obrigatória, mas complementa seu registro.

# permissionLocationNotAllowedMessage
source: We recommend adding the location to your clocking event and, to do so, you need to allow access to your device's location. This information is not mandatory, but it complements your entry.
es: Recomendamos añadir la dirección a su marcación de punto. Para eso, es necesario permitir acceso a la localización del dispositivo. Esta información no es obligatoria, pero complementa su registro.
pt: Recomendamos adicionar o local à sua marcação de ponto, para isso é necessário permitir acesso à localização do dispositivo. Essa informação não é obrigatória, mas complementa seu registro.

# goToConfiguration
source: Permissions
es: Permisos
pt: Permissões

# continueAction
source: Continue
es: Continuar
pt: Continuar

source: Device settings
es: Configuración del dispositivo
pt: Configurações do dispositivo

# setPushNotification
source: Configure push notifications
es: Configurar las notificaciones push
pt: Configurar notificações por push

# appReview
source: App evaluation
es: Evaluación de la app
pt: Avaliação do aplicativo

# searchApp
source: Search
es: Encuesta
pt: Pesquisa

# applicationKeyHelpTitle
source: Learn about the mobile device key configuration
es: Entienda la configuración de clave para el dispositivo móvil
pt: Entenda a configuração de chave para o dispositivo móvel

# applicationKeyHelpContent1
source: Register the application key on the Senior X Platform
es: Registre la clave de aplicación en la Plataforma Senior X
pt: Cadastre a chave de aplicação na Plataforma Senior X

# applicationKeyHelpContent2
source: Add the key and secret information for the registered application, which will be responsible for the communication between the Senior X Platform and Clocking Event 2.0;
es: Introduzca la información de clave y secreto para la aplicación registrada, que será responsable por la comunicación de la Plataforma Senior X con el Control de Asistencia 2.0;
pt: Adicione as informações de chave e segredo para a aplicação cadastrada, que será responsável pela comunicação da Plataforma Senior X com o Marcação de Ponto 2.0;

# applicationKeyHelpContent3
source: If you are sure that the information is correct and still having trouble signing in to the app, please verify this with the HR department of your company.
es: Si está seguro de que la información es correcta y sigue teniendo problemas para acceder a la aplicación, consulte con el departamento de RRHH de su empresa.
pt: Se você tem certeza de que as informações estão corretas e ainda estiver enfrentando problemas para entrar no aplicativo, verifique com o RH da sua empresa.

source: Key already registered!
es: ¡Clave ya registrada!
pt: Chave já cadastrada!

source: Register new key
es: Registrar nueva clave
pt: Registrar nova chave

# keyAlreadyRegisteredDescription
source: You can remove the key with the action below.
es: Usted puede eliminar la clave con la acción abajo.
pt: Você pode remover a chave com a ação abaixo.

# keyAlreadyRegisteredRemove
source: Remove key
es: Eliminar clave
pt: Remover chave

# helpTextDocumentationPortal
source: Documentation Portal
es: Portal de documentación
pt: Portal de documentação

# keyRegisteredSuccessfully
source: Key successfully registered!
es: ¡Clave regitrada con éxito!
pt: Chave cadastrada com sucesso!

# keyRegisteredSuccessfullyDescription
source: The resources will be available for use on the homepage.
es: Los recursos estarán disponibles para uso en el inicio.
pt: Os recursos estarão disponíveis para uso na home.

# keyRegisteredSuccessfullyBackHome
source: Back to homepage
es: Volver al inicio
pt: Voltar ao início

# searchEmployee
source: Search for an employee
es: Buscar empleado
pt: Buscar colaborador

# selectPeriodToFilter
source: Select a period to filter
es: Seleccione un período para filtrar
pt: Selecione um período para filtrar

source: Change
es: Cambiar
pt: Trocar

# init
source: Start
es: Inicial
pt: Inicial

source: End
es: Final
pt: Final

source: Filter
es: Filtrar
pt: Filtrar

source: Cancel
es: Cancelar
pt: Cancelar

source: Invalid date
es: Fecha inválida
pt: Data inválida

source: Invalid date format
es: Formato de fecha inválido
pt: Formato da data inválido

# moreThanEndDate
source: Greater than end date
es: Superior a la fecha final
pt: Maior que a data final

source: Less than start date
es: Inferior a la fecha inicial
pt: Menor que a data inicial

# driversJourney
source: Driver's shift
es: Jornada del conductor
pt: Jornada do motorista

source: Work status
es: Status de trabajo
pt: Status de trabalho

source: Not started
es: No iniciado
pt: Não iniciado

source: Working
es: Trabajando
pt: Trabalhando

source: Driving
es: Conduciendo
pt: Dirigindo

source: Mandatory break
es: Pausa obligatoria
pt: Pausa obrigatória

# foodTime
source: Break
es: Intervalo
pt: Intervalo

source: Waiting
es: Espera
pt: Espera

source: Actions
es: Acciones
pt: Ações

# startDrivingWithLineBreak
source: Start driving
es: Iniciar dirección
pt: Iniciar direção

# startMandatoryBreakWithLineBreak
source: Start mandatory break
es: Iniciar pausa obligatoria
pt: Iniciar pausa obrigatória

# startWaitingWithLineBreak
source: Start waiting
es: Iniciar espera
pt: Iniciar espera

# startFoodTimeWithLineBreak
source: Start Break
es: Iniciar intervalo
pt: Iniciar intervalo

# startJourney
source: Start shift
es: Iniciar jornada
pt: Iniciar jornada

# newJourney
source: New shift
es: Nueva jornada
pt: Nova jornada

source: Stop driving
es: Cerrar dirección
pt: Encerrar direção

# stopMandatoryBreak
source: Stop break
es: Cerrar pausa
pt: Encerrar pausa

# stopFoodTime
source: Stop Break
es: Cerrar intervalo
pt: Encerrar intervalo

source: Stop waiting
es: Cerrar espera
pt: Encerrar espera

# journeyStart
source: Shift start
es: Inicio de la jornada
pt: Início da jornada

# numberOfPauses
source: Number of breaks
es: Número de pausas
pt: Número de pausas

source: Total worked
es: Total trabajado
pt: Total trabalhado

# totalWorkedInfo
source: Updated total time worked from the start of the day until now. Does not include mandatory breaks and meals. If the total value is zeroed and red, it means that the workday contains odd appointments.
es: Tiempo total trabajado actualizado desde el inicio del viaje hasta el día de hoy. No incluye pausas obligatorias ni comidas. Si el valor total está a cero y en rojo, significa que el viaje contiene reservas impares.
pt: Tempo atualizado do total trabalhado do início da jornada até o momento. Não inclui pausas obrigatórias e refeições. Caso o valor total esteja zerado e vermelho, significa que a jornada contém marcações impares.

# timeInWorking
source: Time working
es: Tiempo trabajando
pt: Tempo trabalhando

# timeInDriving
source: Time driving
es: Tiempo conduciendo
pt: Tempo dirigindo

source: Time in mandatory break
es: Tiempo en pausa obligatoria
pt: Tempo em pausa obrigatória

# timeInFoodTime
source: Break time
es: Tiempo en intervalo
pt: Tempo em intervalo

# timeInWaiting
source: Time waiting
es: Tiempo en espera
pt: Tempo em espera

source: hours
es: horas
pt: horas

# seconds
source: sec
es: seg
pt: seg

# workingStatusDescription
source: Work shift elapsed since the beginning, regardless of specific statuses that have been recorded.
es: Jornada laboral transcurrida desde el inicio de la jornada, independientemente de los status específicos que se hayan registrado.
pt: Jornada de trabalho decorrida desde o início da jornada, independente dos status específicos que foram registrados.

source: Device Location
es: Localización de dispositivos
pt: Localização do dispositivo

# deviceLocationDescription
source: Allows determining the geographic location of the device at the time of the clocking events.
es: Permite determinar la localización geográfica del dispositivo en el momento de las marcaciones.
pt: Permite determinar a localização geográfica do dispositivo no momento das marcações.

# drive
source: Driving
es: Dirección
pt: Direção

# drivingStatusDescription
source: Vehicle driving time during the day's shift.
es: Tiempo de conducción del vehículo durante el día.
pt: Tempo de condução do veículo durante a jornada do dia.

# mandatoryBreakStatusDescription
source: Mandatory break is important to prevent fatigue and ensure safer travels, counted as part of your shift.
es: El descanso obligatorio es importante para prevenir la fatiga y asegurar viajes más seguros, se cuenta como parte de su viaje.
pt: A pausa obrigatória é importante para prevenir a fadiga e assegurar viagens mais seguras, é contado como parte da sua jornada.

# foodTimeOrBreaks
source: Meal or breaks
es: Alimentación o intervalos
pt: Refeição ou intervalos

# foodTimeStatusDescription
source: Like breaks, main meal breaks are important to avoid tiredness and fatigue. These breaks do not count as working time.
es: Como el descanso, los intervalos principales para alimentación son importantes para evitar el cansancio y la fatiga. Estos intervalos no cuentan como tiempo trabajado.
pt: Assim como a pausa, os intervalos principais para refeição são importantes para evitar cansaço e fadiga. Esses intervalos não contam como tempo trabalhado.

source: Waiting Time
es: Tiempo de espera
pt: Tempo de espera

# waitingStatusDescription
source: Waiting periods indicate a vehicle stoppage period that requires driver supervision, such as at weigh stations, truck loading and unloading, among others.
es: Los períodos de espera indican un período sin movimiento del vehículo, pero que requieren el acompañamiento del conductor, como fila de báscula, carga y descarga del camión, entre otros.
pt: Os períodos de espera indicam um período sem movimento do veículo, mas que necessitam do acompanhamento do motorista, como fila de balança, carga e descarga do caminhão, dentre outros.

source: Overnight
es: Pernoctación
pt: Pernoite

# overnightDescription
source: Registers overnight stays during longer journeys for rest between shifts.
es: Registra la estada/pernoctación durante un viaje más larga para descanso entre una jornada y otra.
pt: Registra a estada/pernoite durante uma viagem mais extensa para descanso entre uma jornada e outra.

source: Paid Break
es: Descanso pago
pt: Pausa abonada

# paidBreakStatusDescription
source: This break is considered working time and therefore does not result in a deduction from the employee's salary.
es: Este intervalo se considera como tiempo de trabajo y, por lo tanto, no resulta en una reducción del salario del empleado.
pt: Este intervalo é considerado como tempo de trabalho e, portanto, não resulta em redução do salário do empregado.

# mainTimeClocking
source: Time Clocking
es: Marcación de punto
pt: Marcação de ponto

# mainTimeClockingDescription
source: Clocking events (entry or exit) recorded.
es: Marcaciones de punto (de entrada o salida) registradas.
pt: Marcações de ponto (de entrada ou saída) registradas.

# hoursWorkedInfo
source: Updated total when clocking in and out. Includes working time, driving, and waiting.
es: Total actualizado al registrar la entrada y la salida. Incluye el tiempo de trabajo, de conducción y de espera.
pt: Total atualizado ao registrar entrada e saída. Inclui tempo de trabalho, direção e espera.

source: Time in breaks
es: Tiempo en intervalos
pt: Tempo em pausas

# breaksInfo
source: Updated total when starting and ending breaks. Includes mandatory breaks and meals.
es: Total actualizado al registrar inicio y fin. Incluye descanso obligatorio y alimentación.
pt: Total atualizado ao registrar início e fim. Inclui pausas obrigatórias e refeição.

source: More details
es: Más detalles
pt: Mais detalhes

# betweenTimes
source: From {startTime} to {endTime}, total {totalTime}
es: De {startTime} hasta {endTime}, total de {totalTime}
pt: De {startTime} até {endTime}, total de {totalTime}

# totalsOfTheDay
source: Daily totals
es: Totalizadores del día
pt: Totalizadores do dia

# foodTimeStatusDescriptionModal
source: The interval within a shift is typically designated for meals, but it is also crucial for preventing fatigue. Some shifts may include more than one break.
es: El intervalo dentro de una jornada es normalmente destinado para alimentación, pero también es muy importante para evitar la fatiga. En algunas jornadas puede haber más de un intervalo.
pt: O intervalo dentro de uma jornada é destinado, normalmente, para refeições, mas também é muito importante para evitar fadiga. Em algumas jornadas podem existir mais de um intervalo.

source: Was this information helpful?
es: ¿Esta información ha sido útil?
pt: Esta informação foi útil?

source: Enable logs
es: Habilitar registros
pt: Ativar logs

source: Disable logs
es: Desactivar registros
pt: Desativar logs

source: Logs disabled
es: Registros deshabilitados
pt: Logs desativados

source: Logs enabled
es: Registros habilitados
pt: Logs ativados

source: Send logs
es: Enviar registros
pt: Enviar logs

# successfulSyncLogs
source: Successful synchronizing logs
es: Sincronización exitosa de registros
pt: Sucesso ao sincronizar os logs

# partialSuccessSyncLogs
source: Partial success when synchronizing logs
es: Sincronización parcial de registros
pt: Sucesso parcial ao sincronizar os logs

# faliedSyncLogs
source: Failed to synchronize logs
es: No se pudieron sincronizar los registros
pt: Falha ao sincronizar os logs

# unexpectedErrorSyncLogs
source: Unexpected error when synchronizing logs
es: Error inesperado al sincronizar registros
pt: Erro inesperado ao sincronizar os logs

# notLogsToSync
source: There are no logs to synchronize
es: No hay registros para sincronizar
pt: Não existem logs para sincronizar

# aboutScreenAppTitle
source: Application
es: Aplicación
pt: Aplicativo

# aboutScreenVersion
source: Version
es: Versión
pt: Versão

# aboutScreenDeviceTitle
source: Device
es: Dispositivo
pt: Dispositivo

# aboutScreenIdentifier
source: Identifier
es: Identificador
pt: Identificador

# aboutScreenModel
source: Model
es: Modelo
pt: Modelo

# aboutScreenName
source: Name
es: Nombre
pt: Nome

# aboutScreenDevelopedBy
source: Developed by
es: Desarrollado por
pt: Desenvolvido por

# removeFilter
source: Clear
es: Borrar
pt: Limpar

# checkConnectivityForKeys
source: The application key must be managed online. Check your connection and try again.
es: La clave de la aplicación se debe gestionar en línea. Verifique su conexión e inténtelo de nuevo.
pt: A chave de aplicação deve ser gerenciada de forma online. Verifique sua conexão e tente novamente.

source: Select the starting date
es: Seleccione la fecha de inicio
pt: Selecione a data de início

source: Select the end date
es: Seleccione la fecha final
pt: Selecione a data final

# reminderClockingEventMessageIntraJourney
source: You clocked in less than {reminderTime} hour(s) ago. During the break for rest and meals, it's important to complete the minimum period before returning to work.
es: Usted registró el punto hace menos de {reminderTime}. Durante las pausas de descanso y alimentación, es importante completar el período mínimo antes de regresar al trabajo.
pt: Você marcou o ponto há menos de {reminderTime}. No intervalo para descanso e refeição importante completar o período mínimo antes de retornar ao trabalho.

# reminderClockingEventMessageInterJourney
source: You clocked in less than {reminderTime} hours ago. During the break between shifts, it's important to complete the minimum period before returning to work.
es: Usted registró el punto hace menos de {reminderTime}. Durante el descanso entre jornadas, es importante completar el período mínimo antes de regresar al trabajo.
pt: Você marcou o ponto há menos de {reminderTime}. No intervalo para descanso entre jornadas é importante completar o período mínimo antes de retornar ao trabalho.

source: Warning
es: Aviso
pt: Aviso

# registerKeyOnSyncLogs
source: Only sends logs with configured application key
es: Solo envía registros con la clave de aplicación configurada
pt: Os logs só podem ser enviados se houver uma chave de aplicação configurada

# hasNoConnectivityToSync
source: No connection to perform data sync.
es: Sin conexión para sincronizar datos.
pt: Sem conexão para realizar a sincronia de dados.

source: Unable to sync clocking events
es: No es posible sincronizar las marcaciones
pt: Não foi possível sincronizar marcações

source: Sync unsuccessful
es: Sincronización fallida
pt: Sincronização não sucedida

# reason
source: Reason: {reason}
es: Motivo: {reason}
pt: Motivo: {reason}

source: Unsynced clocking events
es: Marcaciones no sincronizadas
pt: Marcações não sincronizadas

# syncClockingEventsBeforeRemoveKeys
source: There are unsynchronized clocking events. Please synchronize before removing the key.
es: Hay marcaciones no sincronizadas. Sincronícelas antes de retirar la clave.
pt: Existem marcações não sincronizadas. Faça a sincronização antes de remover a chave.

# confirmRemoveKeys
source: Remove it? Your company account will be unlinked and all employee information, as well as clocking events, will be removed from the device.
es: ¿Seguro que desea eliminarla? Su cuenta de empresa se desvinculará y toda la información de los empleados, así como las marcaciones, se eliminarán del dispositivo.
pt: Tem certeza que deseja remover? Será desvinculada a conta de sua empresa e todas as informações dos colaboradores, assim como marcações, serão removidas do dispositivo.

source: Loading unsynced clocking events...
es: Buscando marcaciones no sincronizadas...
pt: Buscando marcações não sincronizadas...

# verifiyngConnectivity
source: Verifying internet connection...
es: Verificando conexión a Internet...
pt: Verificando conexão com a internet...

source: Syncing clocking events...
es: Sincronizando marcaciones...
pt: Sincronizando marcações...

source: Removing keys...
es: Removendo claves...
pt: Removendo chaves...

source: Keys not removed
es: Claves no removidas
pt: Chaves não removidas

# keysRemovedUnsuccessfully
source: Unable to completely remove keys. Try again.
es: No ha sido posible eliminar completamente las claves. Por favor, inténtelo de nuevo.
pt: Não foi possível fazer a remoção completa das chaves. Tente novamente.

source: Keys removed
es: Claves removidas
pt: Chaves removidas

# keysRemovedSuccessfully
source: The keys were successfully removed.
es: Las claves fueron removidas con éxito.
pt: As chaves foram removidas com sucesso.

# initJourney
source: Start workday?
es: ¿Iniciar jornada?
pt: Iniciar jornada?

# initJourneyBeforeStartAction
source: No workday in progress, would you like to start a workday before proceeding?
es: Ninguna jornada en curso. ¿Desea iniciar una jornada antes de continuar?
pt: Nenhuma jornada em andamento, deseja iniciar uma jornada antes de prosseguir?

# initMyJourney
source: Start my workday
es: Iniciar mi jornada
pt: Iniciar minha jornada

source: Manual registration
es: Registro manual
pt: Registro manual

# continueRegistration
source: Continue with registration?
es: ¿Desea continuar el registro?
pt: Deseja continuar o registro?

# wantToStartJourney
source: Start worktime?
es: ¿Desea iniciar la jornada?
pt: Deseja iniciar jornada?

# startJourneyBeforeStartAction
source: A worktime start event has not been set yet. Start now before registering {action}?
es: Aún no ha marcado el inicio de la jornada. ¿Desea iniciar ahora antes de marcar {action}?
pt: Ainda não foi realizada uma marcação de início de jornada. Deseja começar agora antes de registrar {action}?

# journeyStartedBeforeAction
source: Worktime and {actionLabel} started successfully.
es: Jornada y {actionLabel} iniciado(a) con éxito.
pt: Jornada e {actionLabel} iniciado(a) com sucesso.

# actionStartedWithoutJourney
source: {actionLabel} started, but worktime has not. A manual adjustment will have to be made later.
es: {actionLabel} iniciado(a), pero la jornada no. Habrá que hacer un ajuste manual posteriormente.
pt: {actionLabel} iniciado(a), mas a jornada não. Um ajuste manual deverá ser realizado posteriormente.

# finishCurrentActionBeforeStartNextAction
source: Finish {currentActionLabel} before starting {nextActionLabel} in sequence?
es: ¿Desea finalizar {currentActionLabel} antes de iniciar {nextActionLabel} en secuencia?
pt: Deseja finalizar {currentActionLabel} antes de iniciar {nextActionLabel} na sequência?

# newActionStartedAndPreviousDoesNot
source: {newActionLabel} started and {previousActionLabel} not finished by the application. Adjust manually if necessary later.
es: {newActionLabel} iniciado(a) y {previousActionLabel} no finalizado(a) por la aplicación. Ajústelo manualmente después si es necesario.
pt: {newActionLabel} iniciado(a) e {previousActionLabel} não finalizado(a) pela aplicação. Faça o ajuste manual posteriormente, se necessário.

# previousActionFinishedAndNewStarted
source: {previousActionLabel} finished and {newActionLabel} started successfully.
es: {previousActionLabel} finalizado(a) y {newActionLabel} iniciado(a) con éxito.
pt: {previousActionLabel} finalizado(a) e {newActionLabel} iniciado(a) com sucesso.

# closeActionBeforeEndJourney
source: End {actionLabel} before ending the worktime?
es: ¿Desea finalizar {actionLabel} antes de finalizar la jornada?
pt: Deseja finalizar {actionLabel} antes de encerrar a jornada?

# previousActionClosedAndJourneyEnded
source: {actionLabel} and worktime successfully completed.
es: {actionLabel} y jornada finalizada con éxito.
pt: {actionLabel} e jornada finalizada com sucesso.
