Repository: felipeduarte26/waapi-flutter-module
Catalog: packages/ponto-mobile-collector/lib/l10n/app_*.arb
Languages: es, pt

# journeyFinishedAndPreviousActionDoesNot
source: Worktime finished, but {actionLabel} not. A manual adjustment will have to be made later.
es: Jornada finalizada, pero {actionLabel} no. Habrá que hacer un ajuste manual posteriormente.
pt: Jornada finalizada, mas {actionLabel} não. Um ajuste manual deverá ser realizado posteriormente.

source: Finish
es: Finalizar
pt: Finalizar

source: Start
es: Iniciar
pt: Iniciar

# sureStartNewJourney
source: Start a new workday?
es: ¿Realmente desea iniciar una nueva jornada?
pt: Tem certeza que deseja iniciar uma nova jornada?

# previousJourneyStillRunning
source: The previous workday is still in progress. If you proceed, the end time clocking event will need to be entered manually later.
es: La jornada anterior aún está en curso. Si continúa, la marcación de finalización deberá ser introducida manualmente posteriormente.
pt: A jornada anterior ainda está em andamento. Se prosseguir, a marcação de finalização deverá ser inserida de forma manual posteriormente.

# finishJourney
source: End journey
es: Finalizar jornada
pt: Finalizar jornada

# wantRegisterOvernight
source: Do you want to register an overnight rest?
es: ¿Desea registrar pernoctación?
pt: Deseja registrar pernoite?

# reportOvernightAfterJourney
source: Report the occurrence of overnight rest after this workday, if necessary.
es: En caso necesario, introduzca la ocurrencia de pernoctación para descanso después de esa jornada.
pt: Informe a ocorrência de pernoite para descanso após essa jornada, caso seja necessário.

# registerOvernight
source: Register overnight rest
es: Registrar pernoctación
pt: Registrar pernoite

source: Start of
es: Comienzo del
pt: Início de

source: End of
es: Fin del
pt: Fim de

source: Work
es: Trabajo
pt: Trabalho

# addOvernightButton
source: Add overnight
es: Agregar pernoite
pt: Adicionar pernoite

source: Overnight added successfully
es: Pernocte agregado con éxito
pt: Pernoite adicionado com sucesso

# overnightAddedError
source: Error adding overnight
es: Añadir pernoite
pt: Erro ao adicionar pernoite

source: Journey
es: Jornada
pt: Jornada

# cameraPermission
source: Camera
es: Cámara
pt: Câmera

# cameraPermissionDescription
source: Permission to access the camera. We use this feature to capture a photo of the employee, read a QR code or perform facial recognition.
es: Permiso para acceder a la cámara. Usamos esta función para capturar una foto del empleado, leer un código QR o realizar reconocimiento facial.
pt: Permissão para acessar a câmera. Usamos esse recurso para conseguir capturar foto do colaborador, leitura de QR code ou para realizar o reconhecimento facial.

# gpsPermissionDescription
source: Permission to access GPS. We use this feature to identify the location where clocking events are recorded.
es: Permiso para acceder al GPS. Utilizamos esta función para identificar el lugar donde se registran las marcaciones.
pt: Permissão para acessar o GPS. Usamos esse recurso para identificar o local que as marcações são registradas.

# nfcPermissionDescription
source: NFC feature, we use this feature when the approach mode is activated by the employer to be able to register appointments.
es: Función NFC, utilizamos esta función cuando el empleador activa el modo de aproximación para poder registrar marcaciones.
pt: Recurso de NFC, usamos esse recurso quando o modo aproximação esta ativo pelo empregador para conseguir realizar os registro das marcações.

# deviceConfigurationPermission
source: Device permissions
es: Permisos del dispositivo
pt: Permissões do dispositivo

# privacyCenter
source: Privacy central
es: Centro de privacidad
pt: Central de privacidade

source: Privacy policies
es: Políticas de privacidad
pt: Políticas de privacidade

# info
source: Information
es: Información
pt: Informações

# viewDate
source: Visualization date
es: Fecha de visualización
pt: Data de visualização

# facialRegistrationCompleted
source: Clocking event made
es: Marcación realizada
pt: Marcação realizada

# facialCaceledRegistration
source: Clocking event canceled
es: Marcación cancelada
pt: Marcação cancelada

# facialRegistering
source: Wait...
es: Espere...
pt: Aguarde...

# facialCollaboratorNotFound
source: Employee not found or inactive
es: Empleado no encontrado o inactivo
pt: Colaborador não encontrado ou inativo

source: No face registered
es: No hay rostro registrado
pt: Nenhum rosto cadastrado

# offlineFeatureUnavailable
source: This functionality is not available while you are offline. Check your connection
es: Esta funcionalidad no está disponible mientras estás desconectado. Comprueba tu conexión
pt: Esta funcionalidade não está disponível enquanto estiver offline. Verifique sua conexão.

# titleNotifications
source: Notifications
es: Notificaciones
pt: Notificações

# notificationErrorNextPage
source: An error occurred while loading upcoming notifications. Tap Repeat and try again.
es: Ocurrió un error al cargar las próximas notificaciones. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao carregar as próximas notificações. Toque em Repetir para tentar novamente.

source: Repeat
es: Repetir
pt: Repetir

# notificationErrorState
source: Could not obtain your notifications
es: No ha sido posible obtener sus notificaciones
pt: Não foi possível obter suas notificações

# notificationErrorStateDescription
source: Unable to recover your notifications because an internal system error has occurred. Wait a few moments and to retry this action, tap Try Again.
es: El sistema presentó un error interno y, por eso, no ha sido posible recuperar sus notificaciones. Aguarde un rato y para repetir esta acción, pulse sobre Reintentar.
pt: O sistema apresentou um erro interno e, por isso, não foi possível recuperar suas notificações. Aguarde alguns instantes e para repetir esta ação, toque em Tentar novamente.

# notificationNotReceivedTitle
source: You did not receive any notifications yet.
es: Usted aún no recibió notificaciones.
pt: Você ainda não recebeu notificações.

# notificationNotReceivedDescription
source: When you receive a notification, it will be available here for consultation.
es: Cuando recibes una notificación, estará disponible aquí para su consulta.
pt: Quando você receber uma notificação, ela ficará disponível aqui para consulta.

source: Latest notifications
es: Últimas notificaciones
pt: Últimas notificações

# optionCancel
source: Cancel
es: Cancelar
pt: Cancelar

# errorMarkNotificationAsRead
source: An error occurred while marking your notification as read. Tap Repeat to try again.
es: Ocurrió un error al marcar su notificación como leída. Toque en Repetir para intentar nuevamente.
pt: Ocorreu um erro ao marcar sua notificação como lida. Toque em Repetir para tentar novamente.

# featureIsNotAvailableOffline
source: This feature is not available while offline. Please check your internet connection.
es: Esta función no está disponible sin conexión. Comprueba tu conexión.
pt: Esta funcionalidade não está disponível enquanto estiver offline. Verifique sua conexão.

# selectItem
source: Select
es: Seleccionar
pt: Selecionar

# facialMsgStatusVeryBlurryImage
source: The photo is out of focus or the face is in motion. Try again.
es: La foto está desenfocada o la cara está en movimiento. Vuelva a intentarlo.
pt: A foto está fora de foco ou o rosto está em movimento. Tente novamente.

# facialMsgStatusMoreThanOneFaceFoundInTheImage
source: Only one face should appear in the registration photo.
es: Solo debe aparecer una cara en la foto de registro.
pt: Somente um rosto deve aparecer na foto de cadastro.

# facialMsgStatusFacesNotFoundInTheImage
source: No face was sufficiently found in the image. Please try again.
es: No se ha encontrado ningún rostro con aparición suficiente en la imagen. Vuelva a intentarlo.
pt: Nenhum rosto foi encontrado com aparecimento suficiente na imagem. Tente novamente.

# facialMsgStatusNonFrontalFace
source: Position the face at the front and look directly at the camera.
es: Coloca la cara hacia delante y mira directamente a la cámara.
pt: Posicione o rosto de forma frontal e olhe diretamente para a câmera.

# facialMsgStatusPoorQualityImage
source: The image has low resolution, noise or poor lighting.
es: La imagen tiene baja resolución, ruido o iluminación inadecuada.
pt: A imagem tem baixa resolução, ruído ou iluminação inadequada.

# facialMsgStatusVerySmallFaceInTheImage
source: Bring your face closer to the camera.
es: Acerque la cara a la cámara.
pt: Aproxime mais seu rosto da câmera.

# facialMsgStatusFaceTooCloseToTheEdgeOfTheImage
source: Center your face on the screen and try again.
es: Centre su cara en la pantalla e inténtelo de nuevo.
pt: Centralize o rosto na tela e tente novamente.

# facialMsgStatusEvidenceOfFraud
source: The image did not meet the authenticity requirements. Try again.
es: La imagen no cumple los requisitos de autenticidad. Vuelva a intentarlo.
pt: A imagem não atendeu aos requisitos de autenticidade. Tente novamente.

# facialMsgStatusIdsWithCloseImagesWereFound
source: The face looks similar to another person in the database. Avoid duplicate registrations.
es: La cara se parece a otra persona de la base de datos. Evite el doble registro.
pt: O rosto parece semelhante a outra pessoa na base de dados. Evite duplicidade cadastral.

# facialMsgStatusGlassesDetectedOrTooMuchEyeShadow
source: Remove glasses or adjust lighting to avoid eye shadows.
es: Quítese las gafas o ajuste la iluminación para evitar sombras en los ojos.
pt: Remova os óculos ou ajuste a iluminação para evitar sombras nos olhos.

# facialMsgStatusLowConfidenceFaceDetection
source: The system was unable to detect a face with sufficient confidence. Try again.
es: El sistema no pudo detectar una cara con suficiente confianza. Vuelva a intentarlo.
pt: O sistema não conseguiu detectar um rosto com confiança suficiente. Tente novamente.

# facialTitleStatusVeryBlurryImage
source: Image too blurry
es: Imagen muy borrosa
pt: Imagem muito borrada

# facialTitleStatusMoreThanOneFaceFoundInTheImage
source: More than one face detected
es: Más de una cara detectada
pt: Mais de um rosto detectado

# facialTitleStatusFacesNotFoundInTheImage
source: Face not detected
es: Cara no detectada
pt: Rosto não detectado

# facialTitleStatusNonFrontalFace
source: Face out of position
es: Cara fuera de posición
pt: Rosto fora de posição

# facialTitleStatusPoorQualityImage
source: Poor image quality
es: Mala calidad de image
pt: Imagem com baixa qualidade

# facialTitleStatusVerySmallFaceInTheImage
source: Small face in the image
es: Cara pequeña en la imagen
pt: Rosto pequeno na imagem

# facialTitleStatusFaceTooCloseToTheEdgeOfTheImage
source: Face close to the edge
es: Cara próxima al borde
pt: Rosto próximo à borda

# facialTitleStatusEvidenceOfFraud
source: Possible fraud detected
es: Posible fraude detectado
pt: Possível fraude detectada

# facialTitleStatusIdsWithCloseImagesWereFound
source: Similarity to other faces
es: Semejanza con otras caras
pt: Similaridade com outros rostos

# facialTitleStatusGlassesDetectedOrTooMuchEyeShadow
source: Glasses or eye shadows
es: Gafas o sombras en los ojos
pt: Óculos ou sombras nos olhos

# facialTitleStatusLowConfidenceFaceDetection
source: Low confidence in the face
es: Baja confianza en la cara
pt: Baixa confiança na face

# privacy_police_change
source: We have updated our privacy policy
es: Actualizamos nuestra política de privacidad
pt: Atualizamos a nossa política de privacidade

# privacy_police_change_subtitle
source: Click to view or consult at any time at Settings > Privacy policy.
es: Haga clic para verla o consúltela en cualquier momento en el menú Configuración > Política de privacidad.
pt: Clique para visualizar ou consulte a qualquer momento no menu Configurações > Política de privacidade.

# reRegisterApplicationKey
source: Query application key
es: Consultar clave de aplicación
pt: Consultar chave de aplicação

source: Error authenticating application key.
es: Error al autenticar la clave de aplicación.
pt: Erro ao autenticar chave de aplicação.

source: Authenticating...
es: Autenticando...
pt: Autenticando...

source: Authentication failure
es: Error de Autenticación
pt: Falha de Autenticação

# errorWhileAuthenticatingApplicationKey
source: An error occurred while authenticating the application key registered on this device.
es: Ha ocurrido un error al autenticar la clave de aplicación registrada en este dispositivo.
pt: Ocorreu um erro ao autenticar a chave de aplicação cadastrada neste dispositivo.

# recognitionBlocked
source: Recognition blocked, please wait
es: Reconocimiento bloqueado, por favor espere
pt: Reconhecimento bloqueado, aguarde

# secondsFullName
source: seconds
es: segundos
pt: segundos

# totalTimeSinceLastJourney
source: Time since last workday
es: Tiempo desde la última jornada
pt: Tempo desde a última jornada

# userNameScreenTitle
source: Log in with credentials
es: Iniciar sesión con credenciales
pt: Entrar com credenciais
