Repository: felipeduarte26/waapi-flutter-module
Catalog: packages/senior-platform-authentication-ui/lib/src/core/l10n/app_*.arb
Languages: es, pt

# userNameScreenTitle
source: Log in with credentials
es: Iniciar sesión con credenciales
pt: Entrar com credenciais

# userNameScreenSubTitle
source: Log in
es: Iniciar sesión en la cuenta
pt: Entrar na conta

# loginBtnText
source: Log in
es: Entrar
pt: Entrar

# tenantNotFoundErrorMessage
source: Tenant not found. Please try again.
es: Tenant no encontrado. Por favor, inténtelo de nuevo.
pt: Tenant não encontrado. Por favor, tente novamente.

# genericErrorMessage
source: A problem has occurred. Please try again.
es: Hubo un problema. Por favor, inténtalo de nuevo.
pt: Houve um problema. Por favor, tente novamente.

# unauthorizedErrorMessage
source: Incorrect email or password. Please try again.
es: Correo electrónico o contraseña incorrectos. Por favor, inténtelo de nuevo.
pt: Email ou senha incorretos. Por favor, tente novamente.

# nextBtnText
source: Next
es: Avanzar
pt: Avançar

# passwordHint
source: Password
es: Contraseña
pt: Senha

# usernameHint
source: Login
es: Iniciar sesión

# passwordRequiredMessage
source: A password is required
es: Contraseña es obligatoria
pt: Senha é obrigatória

# usernameRequiredMessage
source: An email is required
es: Correo electrónico es obligatorio
pt: E-mail é obrigatório

# usernameInvalidMessage
source: Unknown user
es: Usuario desconocido
pt: Usuário desconhecido

# samlScreenTitle
source: SAML validation
es: Validación SAML
pt: Validação SAML

# samlGreetingsMessage
source: Hello!
es: ¡Hola!
pt: Olá!

# samlWelcomeMessage
source: Your company uses SAML security layers for authentication, so we need to externally validate your password and login.
es: Su empresa utiliza capas de seguridad SAML para la autenticación, por lo que necesitamos validar externamente su contraseña e inicio de sesión..
pt: Sua empresa utiliza camadas de segurança SAML para autenticação, por isso precisamos validar sua senha e login externamente.

# samlValidateCredentialsBtnText
source: Validate credentials
es: Validar credenciales
pt: Validar credenciais

# samlCheckboxMessage
source: Do not show this message again.
es: No volver a mostrar este mensaje.
pt: Não mostrar esta mensagem novamente.

source: Authentication code
es: Código de autenticación
pt: Código de autenticação

# insertAuthenticationCodeMessage
source: Enter the 6-digit code
es: Introduzca el código de 6 dígitos
pt: Insira o código de 6 dígitos

# insertAuthenticationCodeMessageBody
source: The code can be obtained on your authenticator application.
es: El código se puede obtener de su aplicación de autenticación..
pt: O código pode ser obtido no seu aplicativo autenticador.

# unauthorizedErrorMessageMfaCode
source: Incorrect authentication code. Please try again.
es: Código de autenticación incorrecto. Inténtalo de nuevo.
pt: Codigo de autenticação incorreto. Por favor, tente novamente.

# sendBtnText
source: Send
es: Enviar
pt: Enviar

# pasteCode
source: Paste copied code?
es: ¿Pegar código copiado?
pt: Colar código copiado?

# youWantToPasteCode
source: Would you like to paste the code {code}?
es: ¿Quieres pegar el código {code}?
pt: Você deseja colar o código {code}?

source: Multifactor authentication
es: Autenticación multifactor
pt: Autenticação de multifator

source: Paste
es: Pegar
pt: Colar

source: Cancel
es: Cancelar
pt: Cancelar

# invalidCode
source: The entered code is invalid or expired. Please try again.
es: El código introducido no es válido o ha caducado, inténtelo de nuevo..
pt: Código inserido e inválido ou expirado. por favor, tente novamente.

# firstAuthenticationMultifactor
source: For your first access, you need to configure your user to perform two-factor authentication. The configuration must be done via email.
es: Para su primer acceso, debe configurar su usuario para realizar la autenticación de dos factores. La configuración debe realizarse por correo electrónico.
pt: Para seu primeiro acesso, é necessário configurar seu usuário para realizar a autenticação de duplo fator. A configuração deve ser feita via e-mail.

# redefineAuthenticationMultifactor
source: Your MFA configuration has been reset by the administrator. Please set it up again.
es: Su configuración MFA ha sido restablecida por el administrador, por favor configúrela de nuevo.
pt: Sua configuração de MFA foi redefinida pelo administrador, por favor configure-a novamente.

# requestSendEmail
source: Request sent to email.
es: Solicitud enviada al correo electrónico.
pt: Solicitação envidada para o email.

# requestSendEmailMessage
source: We have sent an email to {email}. Please check your inbox to continue the process.
es: Hemos enviado un correo electrónico a {email}. Por favor, compruebe su correo electrónico para continuar con el proceso.
pt: Enviamos um email para {email}. Verifique seu e-mail para prosseguir com o processo.

source: Back
es: Volver
pt: Voltar

# requestConfig
source: Request configuration
es: Solicitar configuración
pt: Solicitar configuração

# genericErrorTitle
source: Error while loading the information.
es: Error al cargar las informaciones.
pt: Erro ao carregar as informações.

# genericErrorDescription
source: Try again in a few moments.
es: Inténtelo de nuevo en unos instantes.
pt: Tente novamente em alguns instantes.

# recoveryPasswordBtnText
source: Recover password
es: Recuperar contraseña
pt: Recuperar senha

# recoveryPasswordTitle
source: Send email for password resetting?
es: ¿Enviar un correo electrónico para restablecer la contraseña?
pt: Enviar e-mail para redefinição da senha?

# recoveryPasswordDescription
source: If the provided user is registered in our database, we will send an email with instructions for password recovery.
es: Si el usuario introducido está registrado con nosotros, le enviaremos un email con instrucciones sobre como recuperar su contraseña.
pt: Caso o usuário informado esteja cadastrado em nossa base, enviaremos um e-mail com as instruções para a recuperação da senha.

# recoveryPasswordDescriptionNote
source: If the user is LDAP or SAML, password changes must be made in the identity provider used.
es: Si el usuario es LDAP o SAML, el cambio de la contraseña debe ser realizado en el proveedor de identidad utilizado.
pt: Se o usuário for LDAP ou SAML, a alteração da senha deve ser feita no provedor de identidade utilizado.

source: Note
es: Atención
pt: Atenção

# recoveryPasswordSendEmailBtnText
source: Send email
es: Enviar correo electrónico
pt: Enviar e-mail

# recoveryPasswordRecaptchaTitle
source: Please fill in the recaptcha to proceed
es: Por favor, Rellene el recaptcha para continuar
pt: Por favor, preencha o recaptcha para continuar

# continueBtnText
source: Continue
es: Continuar
pt: Continuar

# recoveryPasswordFinishedTitle
source: Password reset request sent to your email.
es: Solicitud de restablecimiento de contraseña enviada a su correo electrónico.
pt: Solicitação de redefinição de senha enviada para seu e-mail.

# recoveryPasswordFinishedDescription
source: Check your inbox. If you are a registered user, we will send you an email with instructions on how to recover your password.
es: Compruebe su bandeja de entrada. Si eres un usuario registrado, te enviaremos un correo electrónico con instrucciones para recuperar tu contraseña.
pt: Confira sua caixa de entrada. Caso seja um usuário cadastrado, enviaremos um e-mail com as instruções para a recuperação da senha.

# backToBeginingBtnText
source: Home
es: Volver al principio
pt: Voltar ao início

source: Help
es: Ayuda
pt: Ajuda

# helpTextLoginAuthenticationTitle
source: Forgot your login or having trouble logging into the application?
es: ¿Ha olvidado sus datos de acceso o tiene problemas para conectarse?
pt: Esqueceu seu login ou está com problemas para entrar no aplicativo?

# helpTextLoginAuthenticationDescriptio11
source: Your login consists of
es: Sus datos de acceso son los siguientes
pt: Seu login é formado por

# helpTextLoginAuthenticationDescriptio12
source: user@domain.com.br
es: usuario@dominio.com.br
pt: usuario@dominio.com.br

# helpTextLoginAuthenticationDescriptio13
source: (typed without graphic accents).
es: (introducido sin acentos).
pt: (digitado sem acentos).

# helpTextLoginAuthenticationDescriptio2
source: If you are sure that the information is correct and you are still experiencing problems logging into the application,
es: Si estás seguro de que las informaciones son correctas y sigues teniendo problemas para iniciar sesión en la aplicación,
pt: Se você tem certeza de que as informações estão corretas e ainda estiver enfrentando problemas para entrar no aplicativo,

# helpTextLoginAuthenticationDescriptio21
source: check with your company's HR department
es: consúltalo con el departamento de RRHH de tu empresa.
pt: verifique com o RH da sua empresa.

# helpTextLoginAuthenticationDescriptio3
source: See more information on the
es: Más informaciones en
pt: Veja mais informações no

# helpTextDocumentationPortal
source: Documentation Portal
es: Portal de documentación
pt: Portal de documentação

# helpTextLoginMfaDescriptioTitle
source: What is an authenticator application?
es: ¿Qué es una aplicación autenticadora??
pt: O que é um aplicativo autenticador?

# helpTextLoginMfaDescriptioTitle2
source: How to find out the authenticator application used for login?
es: ¿Cómo averiguar la aplicación autenticadora utilizada para el inicio de sesión?
pt: Como descobrir o aplicativo autenticador utilizado para o login?

# helpTextLoginMfaDescriptio1
source: The authenticator application is a secure and convenient way to prove who you are.
es: La aplicación de autenticación es una forma segura y conveniente de demostrar quién eres.
pt: O aplicativo autenticador é uma maneira segura e conveniente de provar quem você é.

# helpTextLoginMfaDescriptio2
source: It generates two-factor verification codes on your cell phone.
es: Genera códigos de verificación de dos factores en tu móvil.
pt: Nele gera-se códigos de verificação em dois fatores no seu celular.

# helpTextLoginMfaDescriptio3
source: Copy the code offered in the authenticator and enter this code here.
es: Copie el código ofrecido en el autenticador e introdúzcalo aquí.
pt: Copie o código oferecido no autenticador e informe aqui este código.

# helpTextLoginMfaDescriptio4
source: Check with your company's HR or see more information on
es: Consulte con RRHH de su empresa o vea más información en
pt: Verifique com o RH de sua empresa ou veja mais informações do

# resetPasswordScreenTitle
source: New password
es: Nueva contraseña
pt: Nova senha

# resetPasswordScreenSubtitle
source: Create new password
es: Crear nueva contraseña
pt: Criar nova senha

# resetPasswordScreenDescription
source: To proceed, you must create a new password:
es: Para continuar, debe crear una nueva contraseña:
pt: Para prosseguir, é preciso que você crie uma nova senha:

# newPasswordHint
source: New password
es: Nueva contraseña
pt: Nova senha

# confirmNewPasswordHint
source: Confirm your new password
es: Confirme su nueva contraseña
pt: Confirme sua nova senha

# resetPasswordBtnText
source: Redefine password
es: Restablecer contraseña
pt: Redefinir senha

# passwordPolicyMinimumLength
source: Use at least {minimumLength} and at most {maximumLength} characters.
es: Utilice los caracteres mínimos {minimumLength} y máximos {maximumLength}..
pt: Utilize no mínimo {minimumLength} e no máximo {maximumLength} caracteres.

# passwordPolicyRequireNumbers
source: Your password must contain numbers.
es: Su contraseña debe contener números.
pt: Sua senha precisa conter números.

# passwordPolicyRequireLowerCase
source: Use at least one lowercase letter.
es: Utilice al menos una letra minúscula.
pt: Utilize pelo menos uma letra minúscula.

# passwordPolicyRequireUpperCase
source: Use at least one uppercase letter.
es: Utilice al menos una mayúscula.
pt: Utilize pelo menos uma letra maiúscula.

# passwordPolicyRequireSpecialCharacters
source: Your password must contain special characters.
es: Su contraseña debe contener caracteres especiales.
pt: Sua senha precisa conter caracteres especiais.

# passwordPolicyPasswordConfirmPasswordMatches
source: The password and the password confirmation must match.
es: La contraseña y la confirmación de contraseña deben coincidir.
pt: A senha e a confirmação da senha devem ser iguais.

# usernameTextfieldHintText
source: user@domain.com.br
es: usuario@dominio.com.br
pt: usuario@dominio.com.br

# loginWithKeyConfigurationKey
source: Key configuration
es: Configuración de la clave
pt: Configuração da chave

# loginWithKeyTitle
source: Enter the access key to configure the device
es: Insiera la clave de acceso para configuración del dispositivo
pt: Informe a chave de acesso para configuração do dispositivo

# loginWithKeyHelperKey
source: You can find the key on the platform
es: Usted puede encontrar la clave en la plataforma
pt: Você pode encontrar a chave na plataforma

# loginWithKeyHelperDomain
source: You can find the domain on the platform
es: Usted puede encontrar el Dominio en la plataforma
pt: Você pode encontrar o domínio na plataforma

# loginWithKeyWrongDomain
source: Domain not found
es: Dominio no encontrado
pt: Domínio não encontrado

# loginWithKeyHelperSecret
source: You can find the secret on the platform
es: Usted puede encontrar el secreto en la plataforma
pt: Você pode encontrar o segredo na plataforma

# loginWithKeyWrongKey
source: Incorrect access key
es: Clave de acceso incorrecta
pt: Chave de acesso incorreta

# loginWithKeyWrongSecret
source: Segredo incorreto
es: Secreto incorrecto

# loginWithKeyAccessKey
source: Access key
es: Clave de acceso
pt: Chave de acesso

# loginWithKeySecret
source: Secret
es: Secreto
pt: Segredo

# loginWithKeyDomain
source: Domain
es: Dominio
pt: Domínio

# loginWithKeyHelper
source: The information must be obtained from your company's system administrator, contact HR for more information.
es: La información debe ser obtenida con el administrador del sistema de su empresa. Contacte com RRHH para saber más.
pt: As informações devem ser obtidas junto ao administrador do sistema de sua empresa, contate o RH para obter mais informações.

# loginWithKeyDomainNotFound
source: Domain not found
es: Domínio no encontrado
pt: Domínio não encontrado

# loginWithKeyUnauthorizedErrorMessage
source: Incorrect key or secret. Please try again
es: Clave o secreto incorrectos. Por favor, inténtelo nuevamente
pt: Chave ou segredo incorretos. Por favor, tente novamente.

# loginWithKeyHelpTitle
source: Need help?
es: ¿Necesita ayuda?
pt: Precisa de ajuda?

# loginWithKeyUnauthorizedErrorHelper
source: Incorrect key or secret
es: Clave o secreto incorrectos
pt: Chave ou segredo incorretos

# enableAccessWithBiometricsTitle
source: Enable access with biometrics
es: ¿Permitir el acceso por biometría?
pt: Habilitar acesso com biometria?

# enableAccessWithBiometricsContent
source: Once this function is activated, biometrics will be required to unlock the application. This option can be changed in Settings
es: Cuando esta función está activada, usted necesita usar biometría para desbloquear la aplicación. Es posible alterar esta opción en Configuración.
pt: Quando esta função estiver ativada, você precisará usar a biometria para desbloquear o aplicativo. Você poderá alterar essa opção em Configurações.

source: Yes
es: Sí
pt: Sim

source: Account access with biometrics
es: Acceso a la cuenta por biometría
pt: Acesso à conta com biometria

source: Unregistered security methods.
es: Métodos de seguridad no registrados.
pt: Métodos de segurança não cadastrados

# unregisteredSecurityMethodsContent
source: To use this option, please enable biometrics or another security method in your device settings. Return to the app and enable the option in Settings.
es: Para utilizar esta opción, por favor, active la biometría u otro método de seguridad en la configuración de su dispositivo. Regrese a la aplicación y active la opción en Configuración.
pt: Para utilizar esta opção, por favor, ative a biometria ou outro método de segurança nas configurações do seu dispositivo. Retorne ao aplicativo e habilite a opção em Configurações.

# signWithBiometrics
source: Sign in with biometrics
es: Ingresar con biometría
pt: Entrar com biometria

# optionExitDialogExit
source: Sign Out
es: Salir
pt: Sair

# unableToLogInOffline
source: Unable to log in. Check your access credentials and your internet connection.
es: No ha sido posible iniciar sesión. Verifique sus credenciales de acceso y su conexión a Internet.
pt: Não foi possível realizar o login. Verifique as credenciais de acesso e sua conexão com a internet.

# errorTryingAuthenticateWithBiometrics
source: Error trying to authenticate with biometrics
es: Error al intentar autenticar con biometría
pt: Erro ao tentar autenticar com biometria

# checkInternetConnectionTryAgain
source: Check your internet connection and try again.
es: Verifique su conexión a internet y vuelva a intentarlo.
pt: Verifique sua conexão com a internet e tente novamente.

source: No
pt: Não
